Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/admin_panel/index.po
Languages: es

source: Accessing the panel
es: Accediendo al panel

source: The *Admin Panel* is a model-centric interface where trusted users can manage content on GeoNode.
es: El *Panel de administración* es una interfaz centrada en el modelo en el que los usuarios confiables pueden administrar contenido en GeoNode.

source: Only the staff users can access the admin interface.
es: Solo los usuarios con permisos pueden acceder a la interfaz de administración.

source: The “staff” flag, which controls whether the user is allowed to log in to the admin interface, can be set by the admin panel itself.
es: El propio panel de administración puede configurar el indicador "personal", que controla si el usuario puede iniciar sesión en la interfaz de administración.

source: The panel can be reached from :guilabel:`Admin` link of the *User Menu* in the navigation bar (see the picture below) or through this URL: ``http://<your_geonode_host>/admin``.
es: Se puede acceder al panel desde el enlace :guilabel:`Admin` del *Menú de Usuario* en la barra de navegación (ver la imagen a continuación) o a través de esta URL: ``http\://<your_geonode_host>/admin``.

source: *The Admin Link of the User Menu*
es: *El enlace hacia Administración en el Menú de Usuario*

source: When clicking on that link the Django-based *Admin Interface* page opens and shows you all the Django models registered in GeoNode.
es: Al hacer clic en ese enlace, se abre la página *Interfaz de administración* basada en Django y le muestra todos los modelos de Django registrados en GeoNode.

source: *The GeoNode Admin Interface*
es: *La interfaz de administración de GeoNode*

source: Reset or Change the admin password
es: Restablecer o Cambiar la contraseña de administrador

source: From the *Admin Interface* you can access the :guilabel:`Change password` link by clicking on the username on the right side of the navigation bar. which will open a dropdown.
es: Desde la *Interfaz de administración* puedes acceder al enlace :guilabel:`Cambiar contraseña` haciendo clic en el nombre de usuario en el lado derecho de la barra de navegación lo que abrirá un menú desplegable.

source: *The Change Password Link*
es: *El enlace para cambiar la contraseña*

source: It allows you to access the *Change Password Form* through which you can change your password.
es: Le permite acceder al *Formulario de Cambio de Contraseña* a través del cual podrá cambiar su contraseña.

source: *The Change Password Form*
es: *El formulario de cambio de contraseña*

source: Once the fields have been filled out, click on :guilabel:`Change my password` to perform the change.
es: Una vez rellenados los campos pulsa en :guilabel:`Cambiar mi contraseña` para realizar el cambio.

source: Simple Theming
es: Personalización de Temas

source: GeoNode provides by default some theming options manageable directly from the Administration panel. Most of the times those options allows you to easily change the GeoNode look and feel without touching a single line of `HTML` or `CSS`.
es: GeoNode proporciona de forma predeterminada algunas opciones de temas que se pueden administrar directamente desde el panel de Administración. La mayoría de las veces, esas opciones le permiten cambiar fácilmente la apariencia de GeoNode sin tocar una sola línea de `HTML` o `CSS`.

source: As an `administrator` go to ``http://<your_geonode_host>/admin/geonode_themes/geonodethemecustomization/``.
es: Como `administrador`, vaya a ``http://<your_geonode_host>/admin/geonode_themes/geonodethemecustomization/``.

source: *List of available Themes*
es: *Lista de temas disponibles*

source: The panel shows all the available GeoNode themes, if any, and allows you to create new ones.
es: El panel muestra todos los temas de GeoNode disponibles, si los hay, y le permite crear otros nuevos.

source: Only one theme at a time can be **activated** (aka *enabled*). By disabling or deleting all the available themes, GeoNode will turn the gui back to the default one.
es: Solo se puede **activar** un tema a la vez (también conocido como *habilitado*). Al deshabilitar o eliminar todos los temas disponibles, GeoNode devolverá la interfaz gráfica de usuario a la predeterminada.

source: Editing or creating a new Theme, will actually allow you to customize several properties.
es: Editar o crear un nuevo tema le permitirá personalizar varias propiedades.

source: At least you'll need to provide a ``Name`` for the Theme. Optionally you can specify also a ``Description``, which will allow you to better identify the type of Theme you created.
es: Al menos deberás proporcionar un ``Nombre`` para el tema. Opcionalmente puedes especificar también una ``Descripción``, que te permitirá identificar mejor el tipo de Tema que creaste.

source: *Theme Name and Description*
es: *Nombre y descripción del tema*

source: Just below the ``Description`` field, you will find the ``Enabled`` checkbox, allowing you to toggle the Theme.
es: Justo debajo del campo ``Descripción``, encontrará la casilla de verificación ``Activado``, que le permitirá alternar el tema.

source: Jumbotron and Get Started link
es: Enlace Jumbotron y Comenzar

source: Remember, everytime you want to apply some changes to the Theme, you **must** save the Theme and reload the GeoNode browser tab. In order to quickly switch back to the Home page, you can just click the ``VIEW SITE`` link on the top-right corner of the Admin dashboard.
es: Recuerde, cada vez que desee aplicar algunos cambios al Tema, **debe** guardar el Tema y recargar la pestaña del navegador GeoNode. Para volver rápidamente a la página de inicio, simplemente haga clic en el enlace ``Ver el sitio`` en la esquina superior derecha del panel de administración.

source: The next section, allows you to define the first important Theme properties. This part involves the GeoNode main page sections.
es: La siguiente sección le permite definir las primeras propiedades importantes del tema. Esta parte involucra las secciones de la página principal de GeoNode.

source: *Jumbotron and Logo options*
es: *Opciones Jumbotron y Logo*

source: By changing those properties as shown above, you will easily change your default home page from this
es: Al cambiar esas propiedades como se muestra arriba, cambiará fácilmente su página de inicio predeterminada desde este

source: *GeoNode Default Home*
es: *Inicio predeterminado de GeoNode*

source: to this
es: a esto

source: *Updating Jumbotron and Logo*
es: *Actualizando Jumbotron y Logo*

source: It is possible to optionally **hide** the ``Jumbotron text``.
es: Opcionalmente, es posible **ocultar** el ``texto Jumbotron``.

source: *Hide Jumbotron text*
es: *Ocultar texto Jumbotron*

source: Slide show
es: Diapositivas

source: To switch between a slide show and a jumbotron, flip the value of the welcome theme from "slide show" to "jumbotron" and vice versa to either display a jumbotron with content or a slide show in the home page
es: Para cambiar entre una presentación de diapositivas y un jumbotron, cambie el valor del tema de bienvenida de "presentación de diapositivas" a "jumbotron" y viceversa para mostrar un jumbotron con contenido o una presentación de diapositivas en la página de inicio

source: For example, to display a slide show, change the welcome theme from jumbotron background
es: Por ejemplo, para mostrar una presentación de diapositivas, cambie el tema de bienvenida del fondo jumbotron

source: to slide show
es: a presentación de diapositivas

source: Before creating a slide show, make sure you have slides to select from (in the multi-select widget) to make up the slide show.
es: Antes de crear una presentación de diapositivas, asegúrese de tener diapositivas para seleccionar (en el widget de selección múltiple) para poder crearla.

source: If no slides exist, click the plus (+) button beside the slide show multi-select widget to add a new slide.
es: Si no existen diapositivas, haga clic en el botón más (+) al lado del widget de selección múltiple de presentación de diapositivas para agregar una nueva diapositiva.

source: Fill in the slide name, slide content using markdown formatting, and upload a slide image (the image that will be displayed when the slide is in view).
es: Complete el nombre de la diapositiva, el contenido de la diapositiva usando el formato Markdown y cargue una imagen de la diapositiva (la imagen que se mostrará cuando la diapositiva esté a la vista).

source: For slide images that already contain text, hide slide content by checking the checkbox labeled "Hide text in the jumbotron slide" as shown below, then save the slide.
es: Para imágenes de diapositivas que ya contienen texto, oculte el contenido de la diapositiva marcando la casilla de verificación "Ocultar texto en la diapositiva jumbotron" como se muestra a continuación y luego guarde la diapositiva.

source: It is also possible to hide a slide from all slide show themes that use it by unchecking the checkbox labeled "Is enabled" as shown below.
es: También es posible ocultar una diapositiva de todos los temas de presentación de diapositivas que la utilizan desmarcando la casilla de verificación "Está habilitado", como se muestra a continuación.

source: Selecting the above slide in a slide show and enabling slide show (using the "welcome theme" configuration) will create a slide show with a slide as shown below:
es: Seleccionar la diapositiva anterior en una presentación y activar el modo de presentación (usando la configuración del "tema de bienvenida") generará una presentación con una diapositiva como la que se muestra a continuación:

source: Switching between different themes
es: Cambiar entre diferentes temas

source: In the case you have defined more Themes, switching between them is as easy as ``enabling`` one and ``disabling`` the others.
es: En el caso de que haya definido más temas, cambiar entre ellos es tan fácil como "habilitar" uno y "deshabilitar" los demás.

source: Remember to save the Themes everytime and refresh the GeoNode home page on the browser to see the changes.
es: Recuerde guardar los temas cada vez y actualizar la página de inicio de GeoNode en el navegador para ver los cambios.

source: It is also important that there is **only one** Theme enabled **at a time**.
es: También es importante que haya **sólo** un tema habilitado **a la vez**.

source: In order to go back to the standard GeoNode behavior, just disable or delete all the available Themes.
es: Para volver al comportamiento estándar de GeoNode, simplemente deshabilite o elimine todos los temas disponibles.

source: Add a new user
es: Agregar un nuevo usuario

source: In GeoNode, administrators can manage other users. For example, they can *Add New Users* through the following form.
es: En GeoNode, los administradores pueden administrar a otros usuarios. Por ejemplo, pueden *Agregar Nuevos Usuarios* a través del siguiente formulario.

source: *Adding New Users*
es: *Agregar nuevos usuarios*

source: The form above can be reached from the *Admin Panel* at the following path: *Home > People > Users*. Click on :guilabel:`+ Add user` to open the form page.
es: Se puede acceder al formulario anterior desde el *Panel de administración* en la siguiente ruta: *Inicio > Personas > Usuarios*. Haga clic en :guilabel:`+ Añadir usuario` para abrir la página del formulario.

source: *The Add User button in the Users List page*
es: *El botón Añadir usuario en la página Lista de usuarios*

source: It is also available, in the GeoNode UI, the :guilabel:`Add User` link of the *About* menu in the navigation bar.
es: También está disponible, en la UI de GeoNode, el enlace :guilabel:`Añadir Usuario` del menú *Acerca de* en la barra de navegación.

source: *Add User Link*
es: *Enlace Añadir usuario*

source: To perform the user creation fill out the required fields (*username* and *password*) and click on :guilabel:`Save`. You will be redirected to the *User Details Page* which allows to insert further information about the user.
es: Para realizar la creación de usuario complete los campos requeridos (*nombre de usuario* y *contraseña*) y haga clic en :guilabel:`Guardar`. Serás redirigido a la *Página de detalles del usuario* que permite insertar más información sobre el usuario.

source: *The User Details Page*
es: *La página de detalles del usuario*

source: The user will be visible into the *Users List Page* of the *Admin Panel* and in the *People Page* (see :ref:`user-info`).
es: El usuario será visible en la *Página de lista de usuarios* del *Panel de administración* y en la *Página de personas* (ver :ref:`user-info`).

source: *The User in the People page*
es: *El Usuario en la página Personas*

source: Activate/Disable a User
es: Activar/Desactivar un usuario

source: When created, new users are *active* by default. You can check that in the *User Details Page* from the *Admin Panel* (see the picture below).
es: Cuando se crean, los nuevos usuarios están *activos* de forma predeterminada. Puede comprobarlo en la *Página de detalles del usuario* desde el *Panel de administración* (vea la imagen a continuación).

source: *New Users Active by default*
es: *Nuevos usuarios activos por defecto*

source: *Active* users can interact with other users and groups, can manage resources and, more in general, can take actions on the GeoNode platform.
es: Los usuarios *activos* pueden interactuar con otros usuarios y grupos, pueden administrar recursos y, más en general, pueden realizar acciones en la plataforma GeoNode.

source: Untick the *Active* checkbox to disable the user. It will be not considered as user by the GeoNode system.
es: Desmarque la casilla de verificación *Activo* para deshabilitar al usuario. No será considerado usuario por el sistema GeoNode.

source: *Disabled Users*
es: *Usuarios deshabilitados*

source: Change a User password
es: Cambiar la contraseña de usuario

source: GeoNode administrators can also change/reset the password for those users who forget it. As shown in the picture below, click on ``this form`` link from the *User Details Page* to access the *Change Password Form*.
es: Los administradores de GeoNode también pueden cambiar/restablecer la contraseña de aquellos usuarios que la olviden. Como se muestra en la imagen a continuación, haga clic en el enlace ``este formulario`` desde la *Página de detalles del usuario* para acceder al *Formulario de cambio de contraseña*.

source: *Changing Users Passwords*
es: *Cambiar las contraseñas de los usuarios*

source: The *Change User Password Form* should looks like the following one. Insert the new password two times and click on :guilabel:`CHANGE PASSWORD`.
es: El *Formulario de cambio de contraseña de usuario* debería verse como el siguiente. Inserta la nueva contraseña dos veces y haz clic en :guilabel:`CAMBIAR CONTRASEÑA`.

source: Promoting a User to Staff member or superuser
es: Promoción de un usuario a miembro del personal o superusuario

source: Active users have not access to admin tools. GeoNode makes available those tools only to *Staff Members* who have the needed permissions. *Superusers* are staff members with full access to admin tools (all permissions are assigned to them).
es: Los usuarios activos no tienen acceso a las herramientas de administración. GeoNode dispone de estas herramientas únicamente para los *miembros del personal* con los permisos necesarios. Los *superusuarios* son miembros del personal con acceso completo a las herramientas de administración, ya que se les asignan todos los permisos.

source: Administrators can promote a user to *Staff Member* by ticking the **Staff status** checkbox in the *User Details Page*. To make some user a *Superuser*, the **Superuser status** checkbox should be ticked. See the picture below.
es: Los administradores pueden promover a un usuario a *Miembro del Personal* marcando la casilla **Estado de personal** en la *Página de detalles del usuario*. Para convertir a un usuario en *Superusuario*, se debe marcar la casilla **Estado de superusuario**. Véase la imagen a continuación.

source: *Staff and Superuser permissions*
es: *Permisos de personal y superusuario*

source: Creating a Group
es: Creando un grupo

source: In GeoNode is possible to create new groups with set of permissions which will be inherited by all the group members.
es: En GeoNode es posible crear nuevos grupos con un conjunto de permisos que serán heredados por todos los miembros del grupo.

source: The creation of a Group can be done both on the GeoNode UI and on the *Admin Panel*, we will explain how in this paragraph.
es: La creación de un Grupo se puede realizar tanto en la UI de GeoNode como en el *Panel de Administración*, explicaremos cómo en este párrafo.

source: The :guilabel:`Create Groups` link of *About* menu in the navigation bar allows administrators to reach the *Group Creation Page*.
es: El enlace :guilabel:`Crear grupos` del menú *Acerca de* en la barra de navegación permite a los administradores acceder a la *Página de creación de grupos*.

source: *The Create Group Link*
es: *El enlace Crear grupo*

source: The following form will open.
es: Se abrirá el siguiente formulario.

source: *The Group Creation Form*
es: *El formulario de creación de grupo*

source: Fill out all the required fields and click :guilabel:`Create` to create the group. The *Group Details Page* will open.
es: Complete todos los campos obligatorios y haga clic en :guilabel:`Crear` para crear el grupo. Se abrirá la *Página de detalles del grupo*.

source: *The Group Details Page*
es: *La página de detalles del grupo*

source: The new created group will be searchable in the *Groups List Page*.
es: El nuevo grupo creado se podrá buscar en la *Página de lista de grupos*.

source: *The Groups List Page*
es: *La página de lista de grupos*

source: The :guilabel:`Create a New Group` button on the *Groups List Page* allows to reach the *Group Creation Form*.
es: El botón :guilabel:`Crear un grupo nuevo` en la *Página de lista de grupos* permite acceder al *Formulario de creación de grupos*.

source: As already mentioned above, groups can also be created from the Django-based *Admin Interface* of GeoNode.
es: Como ya se mencionó anteriormente, los grupos también se pueden crear desde la *Interfaz de administración* basada en Django de GeoNode.

source: The *Groups* link of the *AUTHENTICATION AND AUTHORIZATION* section allows to manage basic Django groups which only care about permissions.
es: El enlace *Grupos* de la sección *AUTENTICACIÓN Y AUTORIZACIÓN* permite gestionar grupos básicos de Django, los cuales solo se ocupan de los permisos.

source: To create a GeoNode group you should take a look at the *GROUPS* section.
es: Para crear un grupo de GeoNode debes echar un vistazo a la sección *GRUPOS*.

source: *The Groups Section on the Admin Panel*
es: *La sección de Grupos en el Panel de Administración*

source: As you can see, GeoNode provides two types of groups. You will learn more about that in the next paragraph.
es: Como puede ver, GeoNode proporciona dos tipos de grupos. Aprenderá más sobre eso en la siguiente sección.

source: Types of Groups
es: Tipos de grupos

source: In GeoNode users can be grouped through a *Group Profile*, an enhanced Django group which can be enriched with some further information such as a description, a logo, an email address, some keywords, etc. It also possible to define some *Group Categories* based on which those group profiles can be divided and filtered.
es: En GeoNode, los usuarios pueden agruparse a través de un *Perfil de grupo*, un grupo Django mejorado que puede enriquecerse con información adicional como una descripción, un logotipo, una dirección de correo electrónico, algunas palabras clave, etc. También es posible definir algunas *Categorías de Grupo* en función de las cuales se pueden dividir y filtrar esos perfiles de grupo.

source: A new **Group Profile** can be created as follow:
es: Se puede crear un nuevo **Perfil de grupo** de la siguiente manera:

source: click on the *Group Profile* :guilabel:`+ Add` button
es: haga clic en el botón *Perfil de grupo* :guilabel:`+ Añadir group profile`

source: fill out all the required fields (see the picture below), *Group Profiles* can be explicitly related to group categories
es: complete todos los campos obligatorios (vea la imagen a continuación), *Perfiles de grupo* se pueden relacionar explícitamente con categorías de grupo

source: *A new Group Profile*
es: *Un nuevo perfil de grupo*

source: click on :guilabel:`Save` to perform the creation, the new created group profile will be visible in the *Group Profiles List*
es: haga clic en :guilabel:`Guardar` para realizar la creación, el nuevo perfil de grupo creado será visible en la *Lista de perfiles de grupo*

source: *The Group Profiles List*
es: *La lista de perfiles de grupo*

source: Group Categories
es: Categorías de grupo

source: *Group Profiles* can also be related to *Group Categories* which represents common topics between groups. In order to add a new **Group Category** follow these steps:
es: *Perfiles de grupo* también pueden estar relacionados con *Categorías de grupo* que representan temas comunes entre grupos. Para agregar una nueva **Categoría de grupo**, siga estos pasos:

source: click on the *Group Categories* :guilabel:`+ Add group category` button
es: haga clic en el botón *Categorías de grupo* :guilabel:`+ Añadir group category`

source: fill out the creation form (type *name* and *description*)
es: complete el formulario de creación (escriba *Nombre* y *Descripción*)

source: *A new Group Category*
es: *Una nueva categoría de grupo*

source: click on :guilabel:`Save` to perform the creation, the new created category will be visible in the *Group Categories List*
es: haga clic en :guilabel:`Guardar` para realizar la creación, la nueva categoría creada será visible en la *Lista de Categorías de Grupo*

source: *The Group Categories List*
es: *La lista de categorías de grupo*

source: Managing a Group
es: Gestionar un grupo

source: Through the :guilabel:`Groups` link of *About* menu in the navigation bar, administrators can reach the *Groups List Page*.
es: A través del enlace :guilabel:`Grupos` del menú *Acerca de* en la barra de navegación, los administradores pueden acceder a la *Página de lista de grupos*.

source: *The Groups Link in the navigation bar*
es: *El enlace de Grupos en la barra de navegación*

source: In that page all the GeoNode *Group Profiles* are listed.
es: En esa página se enumeran todos los *Perfiles de grupo* de nuestro GeoNode.

source: *Group Profiles List Page*
es: *Página de lista de perfiles de grupo*

source: For each group some summary information (such as the *title*, the *description*, the number of *members* and *managers*) are displayed near the *Group Logo*.
es: Para cada grupo, se muestra información resumida (como el *título*, la *descripción*, el número de *miembros* y *administradores*) cerca del *Logotipo del grupo*.

source: Administrators can manage a group from the *Group Profile Details Page* which is reachable by clicking on the *title* of the group.
es: Los administradores pueden administrar un grupo desde la *Página de detalles del perfil del grupo* a la que se puede acceder haciendo clic en el *título* del grupo.

source: *Group Profile Details Page*
es: *Página de detalles del perfil del grupo*

source: As shown in the picture above, all information about the group are available on that page:
es: Como se muestra en la imagen de arriba, toda la información sobre el grupo está disponible en esa página:

source: the group *Title*;
es: el *Título* del grupo;
