Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/admin_panel/index.po
Languages: es

source: A ``Menu Placeholder`` from the existing ones.
es: Un ``Marcador de posición de menú`` de los existentes.

source: A ``Order`` in the case you'll create more menus associated to the same placeholder.
es: Un ``Pedido`` en el caso de que crees más menús asociados al mismo marcador de posición.

source: ``Menu Item``; finally you will need to create voices belonging to the *menu*. For the time being, GeoNode allows you to create only ``href`` links.
es: ``Elemento de menú``; Finalmente necesitarás crear voces que pertenezcan al *menú*. Por el momento, GeoNode le permite crear sólo enlaces ``href``.

source: *Create a new Menu Item from the Admin panel*
es: *Crear un nuevo elemento de menú desde el panel de administración*

source: The ``Menu`` won't be visible until you add more than one ``Menu Item``, If you have 1, item, the item will be showed(but not under the menu).
es: El ``Menú`` no será visible hasta que agregue más de un ``Elemento de menú``. Si tiene 1 elemento, el elemento se mostrará (pero no debajo del menú).

source: OAuth2 Access Tokens
es: Tokens de acceso OAuth2

source: This small section won't cover entirely the GeoNode OAuth2 security integration, this is explained in detail in other sections of the documentation (refer to :ref:`geoserver_geonode_aa`).
es: Esta pequeña sección no cubrirá por completo la integración de seguridad de GeoNode OAuth2; esto se explica en detalle en otras secciones de la documentación (consulte :ref:`geoserver_geonode_aa`).

source: Here we will focus mainly on the :guilabel:`Admin > DJANGO/GEONODE OAUTH TOOLKIT` panel items with a specific attention to the ``Access tokens`` management.
es: Aquí nos centraremos principalmente en los elementos del panel :guilabel:`Admin > DJANGO/GEONODE OAUTH TOOLKIT` con especial atención a la gestión de ``Tokens de acceso``.

source: The :guilabel:`Admin > DJANGO/GEONODE OAUTH TOOLKIT` panel (as shown in the figure below) allows an admin to manage everything related to GeoNode OAuth2 grants and permissions.
es: El panel :guilabel:`Admin > DJANGO/GEONODE OAUTH TOOLKIT` (como se muestra en la figura siguiente) permite a un administrador administrar todo lo relacionado con las concesiones y permisos de GeoNode OAuth2.

source: As better explained in other sections of the documentation, this is needed to correctly handle the communication between GeoNode and GeoServer.
es: Como se explica mejor en otras secciones de la documentación, esto es necesario para manejar correctamente la comunicación entre GeoNode y GeoServer.

source: *DJANGO/GEONODE OAUTH TOOLKIT Admin panel*
es: *Panel de administración del KIT DE HERRAMIENTAS DJANGO/GEONODE OAUTH*

source: Specifically from this panel an admin can create, delete or extend OAuth2 ``Access tokens``.
es: Específicamente desde este panel, un administrador puede crear, eliminar o extender ``Tokens de acceso`` de OAuth2.

source: The section :ref:`geoserver_geonode_aa` better explains the concepts behind OAuth2 sessions; we want just to refresh the mind here about the basic concepts:
es: La sección :ref:`geoserver_geonode_aa` explica mejor los conceptos detrás de las sesiones de OAuth2; Aquí solo queremos refrescar la mente sobre los conceptos básicos:

source: If the `SESSION_EXPIRED_CONTROL_ENABLED <../../basic/settings/index.html#session-expired-control-enabled>`_ setting is set to `True` (by default it is set to `True`) a registered user cannot login to neither GeoNode nor GeoServer without a valid ``Access token``.
es: Si la configuración `SESSION_EXPIRED_CONTROL_ENABLED <../../basic/settings/index.html#session-expired-control-enabled>`_ está configurada en `Verdadero` (de forma predeterminada está configurada en `Verdadero`), un usuario registrado no puede iniciar sesión ni en GeoNode ni en GeoServer sin un ``Token de acceso``.

source: When logging-in into GeoNode through the sign-up form, GeoNode checks if a valid ``Access token`` exists and it creates a new one if not, or extends the existing one if expired.
es: Al iniciar sesión en GeoNode a través del formulario de registro, GeoNode verifica si existe un "token de acceso" válido y crea uno nuevo si no, o extiende el existente si ha caducado.

source: New ``Access tokens`` expire automatically after `ACCESS_TOKEN_EXPIRE_SECONDS <../../basic/settings/index.html#access-token-expire-seconds>`_ setting (by default 86400)
es: Los nuevos ``tokens de acceso`` caducan automáticamente después de la configuración `ACCESS_TOKEN_EXPIRE_SECONDS <../../basic/settings/index.html#access-token-expire-seconds>`_ (por defecto 86400)

source: When an ``Access token`` expires, the user will be kicked out from the session and forced to login again
es: Cuando un ``Token de acceso`` caduca, el usuario será expulsado de la sesión y obligado a iniciar sesión nuevamente

source: Create a new token or extend an existing one
es: Cree un nuevo token o amplíe uno existente

source: It is possible from the :guilabel:`Admin > DJANGO/GEONODE OAUTH TOOLKIT` panel to create a new ``Access token`` for a user.
es: Es posible desde el panel :guilabel:`Admin > DJANGO/GEONODE OAUTH TOOLKIT` crear un nuevo ``Token de acceso`` para un usuario.

source: In order to do that, just click on the :guilabel:`Add` button beside ``Access tokens`` topic
es: Para hacer eso, simplemente haga clic en el botón :guilabel:`Agregar` al lado del tema ``Tokens de acceso``

source: *Add a new ``Access token``*
es: *Agregar un nuevo ``Token de acceso``*

source: On the new form
es: En el nuevo formulario

source: *Create an ``Access token``*
es: *Crear un ``Token de acceso``*

source: select the followings:
es: seleccione lo siguiente:

source: ``User``; use the search tool in order to select the correct user. The form want the user PK, which is a number, and **not** the username. The search tool will do everything for you.
es: ``Usuario``; Utilice la herramienta de búsqueda para seleccionar el usuario correcto. El formulario quiere la PK del usuario, que es un número, y **no** el nombre de usuario. La herramienta de búsqueda hará todo por usted.

source: *Select a User*
es: *Seleccione un usuario*

source: ``Source refresh token``; this is not mandatory, leave it blank.
es: ``Token de fuente de actualización``; Esto no es obligatorio, déjelo en blanco.

source: ``Token``; write here any alphanumeric string. This will be the ``access_token`` that the member can use to access the OWS services. We suggest to use a service like https://passwordsgenerator.net/ in order to generate a strong token string.
es: ``Token``; escriba aquí cualquier cadena alfanumérica. Este será el ``access_token`` que el miembro podrá utilizar para acceder a los servicios de OWS. Sugerimos utilizar un servicio como https://passwordsgenerator.net/ para generar una cadena de token segura.

source: *Select a Token*
es: *Seleccione un Token*

source: ``Application``; select **GeoServer**, this is mandatory
es: ``Aplicación``; seleccione **GeoServer**, esto es obligatorio

source: *Select the GeoServer Application*
es: *Seleccione la aplicación GeoServer*

source: ``Expires``; select an expiration date by using the :guilabel:`date-time` widgets.
es: ``Expira``; seleccione una fecha de vencimiento usando los widgets :guilabel:`fecha-hora`.

source: *Select the Token Expiration*
es: *Seleccione el vencimiento del token*

source: ``Scope``; select **write**, this is mandatory.
es: ``Alcance``; seleccione **write**, esto es obligatorio.

source: *Select the Application Scope*
es: *Seleccione el ámbito de aplicación*

source: Do not forget to :guilabel:`Save`.
es: No olvides :guilabel:`Guardar`.

source: From now on, GeoNode will use this ``Access Token`` to control the user session (notice that the user need to login again if closing the browser session), and the user will be able to access the OWS Services by using the new ``Access Token``, e.g.:
es: De ahora en adelante, GeoNode usará este ``Token de acceso`` para controlar la sesión del usuario (tenga en cuenta que el usuario debe iniciar sesión nuevamente si cierra la sesión del navegador), y el usuario podrá acceder a los Servicios OWS utilizando el nuevo ``Token de acceso``, por ejemplo:

source: Notice the ``...quest=GetCapabilities&access_token=123456`` (**access_token**) parameter at the end of the URL.
es: Observe el parámetro ``...quest=GetCapabilities&access_token=123456`` (**access_token**) al final de la URL.

source: Force a User Session to expire
es: Forzar la caducidad de una sesión de usuario

source: Everything said about the creation of a new ``Access Token``, applies to the deletion of the latter.
es: Todo lo dicho sobre la creación de un nuevo ``Access Token``, se aplica a la eliminación de este último.

source: From the same interface an admin can either select an expiration date or delete all the ``Access Tokens`` associated to a user, in order to force its session to expire.
es: Desde la misma interfaz, un administrador puede seleccionar una fecha de vencimiento o eliminar todos los ``Tokens de acceso`` asociados a un usuario, para forzar la expiración de su sesión.

source: Remember that the user could activate another session by logging-in again on GeoNode with its credentials.
es: Recuerde que el usuario podría activar otra sesión iniciando sesión nuevamente en GeoNode con sus credenciales.

source: In order to be sure the user won't force GeoNode to refresh the token, reset first its password or de-activate it.
es: Para asegurarse de que el usuario no obligue a GeoNode a actualizar el token, primero restablezca su contraseña o desactívela.
