Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/admin_panel/index.po
Languages: es

source: Notice that by enabling the ``Featured`` option here, will allow GeoNode to show the Map thumbnail and the Map detail link at the top under featured resources on the :guilabel:`Home Page`
es: Tenga en cuenta que al habilitar la opción ``Destacados`` aquí, GeoNode podrá mostrar la miniatura del mapa y el enlace de detalles del mapa en la parte superior debajo de los recursos destacados en :guilabel:`Página de inicio`

source: Manage the documents using the admin panel
es: Gestione los documentos utilizando el panel de administración

source: Similarly to the Datasets and Maps, it is possible to manage the available GeoNode Documents through the Admin panel also.
es: De manera similar a los conjuntos de datos y mapas, también es posible administrar los documentos de GeoNode disponibles a través del panel de administración.

source: Move to :guilabel:`Admin > Documents` to access the Documents list.
es: Vaya a :guilabel:`Admin > Documentos` para acceder a la lista de Documentos.

source: By clicking over one Document link, it will show a detail page allowing you to modify some of the resource info like the metadata, the keywords, the title, etc.
es: Al hacer clic en el enlace de un documento, se mostrará una página de detalles que le permitirá modificar parte de la información del recurso, como los metadatos, las palabras clave, el título, etc.

source: Manage the base metadata choices using the admin panel
es: Administre las opciones de metadatos base usando el panel de administración

source: :guilabel:`Admin > Base` contains almost all the objects you need to populate the resources metadata choices.
es: :guilabel:`Admin > Base` contiene casi todos los objetos que necesita para completar las opciones de metadatos de recursos.

source: *Admin dashboard Base Panel*
es: *Panel "Base" en el Panel de Administración*

source: In other words the options available from the :guilabel:`select-boxes` of the resource :guilabel:`Edit Metadata` and :guilabel:`Advanced Metadata` forms.
es: En otras palabras, las opciones disponibles en los formularios :guilabel:`select-box` de los recursos :guilabel:`Edit Metadata` y :guilabel:`Advanced Metadata`.

source: *Metadata Form*
es: *Formulario de Metadatos*

source: *Advanced Metadata Form*
es: *Formulario de Metadatos Avanzado*

source: When editing the resource metadata through the :guilabel:`Edit Metadata`, some fields are marked as ``mandatory`` and by filling those information the ``Completeness`` progress will advance accordingly.
es: Al editar los metadatos del recurso a través de la opción :guilabel:`Editar metadatos`, algunos campos están marcados como ``obligatorios`` y al completar esa información el progreso de ``Integridad`` avanzará en consecuencia.

source: *Metadata Completeness*
es: *Integridad de los metadatos*

source: Even if not all the fields have been filled, the system won't prevent you to update the metadata; this is why the ``Mandatory`` fields are mandatory to be fully compliant with an ``ISO 19115`` metadata schema, but are only recommended to be compliant with GeoNode.
es: Incluso si no se han completado todos los campos, el sistema no le impedirá actualizar los metadatos; por esto, los campos ``Obligatorios`` son necesarios para cumplir completamente con el esquema de metadatos ``ISO 19115``, pero solo se recomiendan para cumplir con GeoNode.

source: Also the ``Completeness`` indicates how far the metadata is to be compliant with an ``ISO 19115`` metadata schema.
es: Además, "Integridad" indica hasta qué punto los metadatos deben cumplir con un esquema de metadatos "ISO 19115".

source: Of course, it is **highly** recommended to always fill as much as possible at least all the metadata fields marked as ``Mandatory``.
es: Por supuesto, es **altamente** recomendable llenar siempre en la medida de lo posible al menos todos los campos de metadatos marcados como ``Obligatorios``.

source: This will improve not only the quality of the data stored into the system, but will help the users to easily search for them on GeoNode.
es: Esto mejorará no sólo la calidad de los datos almacenados en el sistema, sino que también ayudará a los usuarios a buscarlos fácilmente en GeoNode.

source: All the ``Search & Filter`` panels and options of GeoNode are, in fact, based on the resources metadata fields. Too much generic descriptions and too empty metadata fields, will give highly un-precise and very wide search results to the users.
es: Todos los paneles y opciones de ``Buscar y filtrar`` de GeoNode se basan, de hecho, en los campos de metadatos de los recursos. Demasiadas descripciones genéricas y campos de metadatos demasiado vacíos darán a los usuarios resultados de búsqueda muy amplios y poco precisos.

source: Hierarchical keywords
es: Palabras clave jerárquicas

source: Through the :guilabel:`Admin > Base > Hierarchical keywords` panel it will be possible to manage all the keywords associated to the resources.
es: A través del panel :guilabel:`Admin > Base > Palabras clave jerárquicas` será posible gestionar todas las palabras clave asociadas a los recursos.

source: *Hierarchical keywords list*
es: *Lista jerárquica de palabras clave*

source: *Hierarchical keywords edit*
es: *Edición de palabras clave jerárquicas*

source: The :guilabel:`Name` is the human readable text of the keyword, what users will see.
es: El :guilabel:`Name` es el texto legible para el usuario de la palabra clave, lo que los usuarios verán.

source: The :guilabel:`Slug` is a unique label used by the system to identify the keyword; most of the times it is equal to the name.
es: :guilabel:`Slug` es una etiqueta única utilizada por el sistema para identificar la palabra clave; la mayoría de las veces es igual al nombre.

source: Notice that through the :guilabel:`Position` and :guilabel:`Relative to` selectors, it is possible to establish a hierarchy between the available keywords. The hierarchy will be reflected in the form of a tree from the metadata panels.
es: Observe que a través de los selectores :guilabel:`Position` y :guilabel:`Relative to`, es posible establecer una jerarquía entre las palabras clave disponibles. La jerarquía se reflejará en forma de árbol desde los paneles de metadatos.

source: By default each user with editing metadata rights on any resource, will be able to insert new keywords into the system by simply typing a free text on the keywords metadata field.
es: Por defecto, cada usuario con derechos para editar metadatos en cualquier recurso podrá insertar nuevas palabras clave en el sistema simplemente escribiendo un texto libre en el campo de metadatos de palabras clave.

source: It is possible to force the user to select from a fixed list of keywords through the `FREETEXT_KEYWORDS_READONLY <../../basic/settings/index.html#freetext-keywords-readonly>`_ setting.
es: Es posible obligar al usuario a seleccionar de una lista fija de palabras clave a través de la configuración `FREETEXT_KEYWORDS_READONLY <../../basic/settings/index.html#freetext-keywords-readonly>`_.

source: When set to `True` keywords won't be writable from users anymore. Only admins can will be able to manage them through the :guilabel:`Admin > Base > Hierarchical keywords` panel.
es: Cuando se establece en "Verdadero", los usuarios ya no podrán escribir en las palabras clave. Sólo los administradores podrán gestionarlas a través del panel :guilabel:`Admin > Base > Palabras clave jerárquicas`.

source: Licenses
es: Licencias

source: Through the :guilabel:`Admin > Base > Licenses` panel it will be possible to manage all the licenses associated to the resources.
es: A través del panel :guilabel:`Admin > Base > Licencias` será posible gestionar todas las licencias asociadas a los recursos.

source: *Metadata editor Licenses*
es: *Licencias de editor de metadatos*

source: It is **strongly** recommended to not publish resources without an appropriate license. Always make sure the data provider specifies the correct license and that all the restrictions have been honored.
es: Se recomienda **encarecidamente** no publicar recursos sin una licencia adecuada. Asegúrese siempre de que el proveedor de datos especifique la licencia correcta y de que se hayan respetado todas las restricciones.

source: Metadata Regions
es: Regiones de metadatos

source: Through the :guilabel:`Admin > Base > Metadata Regions` panel it will be possible to manage all the admin areas associated to the resources.
es: A través del panel :guilabel:`Admin > Base > Regiones de Metadatos` será posible gestionar todas las áreas de administración asociadas a los recursos.

source: *Resource Metadata Regions*
es: * Regiones de recursos de metadatos*

source: Notice that those regions are used by GeoNode to filter search results also through the resource list view.
es: Tenga en cuenta que GeoNode utiliza esas regiones para filtrar los resultados de búsqueda también a través de la vista de lista de recursos.

source: GeoNode tries to guess the ``Regions`` intersecting the data bounding boxes when uploading a new dataset. Those should be refined by the user dataset on anyway.
es: GeoNode intenta adivinar las ``regiones`` que intersectan los cuadros delimitadores de datos al cargar un nuevo conjunto de datos. De todos modos, el conjunto de datos del usuario debería refinarlos.

source: Metadata Restriction Code Types and Spatial Representation Types
es: Tipos de Códigos de Restricción de Metadatos y Tipos de Representación Espacial

source: Through the :guilabel:`Admin > Base > Metadata Restriction Code Types` and :guilabel:`Admin > Base > Metadata Spatial Representation Types` panels, it will be possible to **update only** the metadata descriptions for restrictions and spatial representation types.
es: A través de los paneles :guilabel:`Admin > Base > Tipos de códigos de restricción de metadatos` y :guilabel:`Admin > Base > Tipos de representación espacial de metadatos`, será posible **actualizar únicamente** las descripciones de los metadatos para las restricciones y los tipos de representación espacial.

source: Such lists are *read-only* by default since they have been associated to the specific codes of the ``ISO 19115`` metadata schema. Changing them would require the system to provide a custom dictionary through the metadata catalog too. Such functionality is not supported actually by GeoNode.
es: Estas listas son de *solo lectura* de forma predeterminada, ya que se han asociado a códigos específicos del esquema de metadatos ``ISO 19115``. Cambiarlos requeriría que el sistema también proporcionara un diccionario personalizado a través del catálogo de metadatos. En realidad, GeoNode no admite dicha funcionalidad.

source: Metadata Topic Categories
es: Categorías de temas de metadatos

source: Through the :guilabel:`Admin > Base > Metadata Topic Categories` panel it will be possible to manage all the resource metadata categories avaialble into the system.
es: A través del panel :guilabel:`Admin > Base > Categorías de Temas de Metadatos` será posible gestionar todas las categorías de metadatos de recursos disponibles en el sistema.

source: Notice that by default, GeoNode provides the standard topic categories available with the ``ISO 19115`` metadata schema. Changing them means that the system won't be compliant with the standard ``ISO 19115`` metadata schema anymore. ``ISO 19115`` metadata schema extensions are not currently supported natively by GeoNode.
es: Tenga en cuenta que, por defecto, GeoNode proporciona las categorías de temas estándar disponibles con el esquema de metadatos ``ISO 19115``. Cambiarlas significa que el sistema ya no será compatible con el esquema de metadatos estándar ``ISO 19115``. Las extensiones del esquema de metadatos ``ISO 19115`` no son compatibles de forma nativa con GeoNode en este momento.

source: It is worth notice that GeoNode allows you to associate `Font Awesome Icons <https://fontawesome.com/icons?d=gallery>`_ to each topic category through their ``fa-icon`` code. Those icons will be used by GeoNode to represent the topic category on both the ``Search & Filter`` menus and :guilabel:`Metadata` panels.
es: Vale la pena señalar que GeoNode le permite asociar `Font Awesome Icons <https://fontawesome.com/icons?d=gallery>`_ a cada categoría de tema a través de su código ``fa-icon``. GeoNode utilizará esos íconos para representar la categoría de tema tanto en los menús ``Buscar y filtrar`` como en los paneles :guilabel:`Metadatos`.

source: The list of the ``Metadata Topic Categories`` on the home page is currently fixed. To change it you will need to update or override the GeoNode ``index.html`` HTML template.
es: La lista de ``Categorías de temas de metadatos`` en la página de inicio está actualmente arreglada. Para cambiarlo, necesitará actualizar o anular la plantilla HTML ``index.html`` de GeoNode.

source: By default the ``Metadata Topic Categories`` are *writable*. Meaning that they can be removed or created by the :guilabel:`Admin` panel.
es: Por defecto, las ``Categorías de temas de metadatos`` son *editables*. Lo que significa que pueden ser eliminados o creados por el panel :guilabel:`Admin`.

source: It is possible to make them fixed (it will be possible to update their descriptions and icons only) through the `MODIFY_TOPICCATEGORY <../../basic/settings/index.html#modify-topiccategory>`_ setting.
es: Es posible corregirlos (solo será posible actualizar sus descripciones e íconos) a través de la configuración `MODIFY_TOPICCATEGORY <../../basic/settings/index.html#modify-topiccategory>`_.

source: Announcements
es: Anuncios

source: As an Administrator you might need to broadcast announcements to the world about your portal or simply to the internal contributors.
es: Como administrador, es posible que necesites transmitir anuncios al mundo sobre tu portal o simplemente a los contribuyentes internos.

source: GeoNode ``Announcements`` allow actually to do that; an admin has the possibility to create three types of messages, accordingly to their severity, decide their validity in terms of time period (start date and expiring date of the announcement), who can view them or not (everyone or just the registerd members) and whenever a user can hide the message or not and how long.
es: Los ``Anuncios`` de GeoNode permiten realmente hacer eso; un administrador tiene la posibilidad de crear tres tipos de mensajes, según su gravedad, decidir su validez en términos de período de tiempo (fecha de inicio y fecha de vencimiento del anuncio), quién puede verlos o no (todos o solo los miembros registrados) y cuándo un usuario puede ocultar el mensaje o no y por cuánto tiempo.

source: There are three types of announcements accordingly to their severity level: ``General``, ``Warning`` and ``Critical`` The difference is mainly the color of the announcement box.
es: Hay tres tipos de anuncios según su nivel de gravedad: ``General``, ``Advertencia`` y ``Crítico`` La diferencia es principalmente el color del cuadro del anuncio.

source: Only administrators and staff members can create and manage announcements.
es: Sólo los administradores y miembros del personal pueden crear y gestionar anuncios.

source: Currently there two ways to access and manage the announcements list:
es: Actualmente existen dos formas de acceder y gestionar la lista de anuncios:

source: Via the GeoNode interface, from the :guilabel:`Profile` panel
es: A través de la interfaz de GeoNode, desde el panel :guilabel:`Perfil`

source: Those are accessible by both admins and staff members.
es: Son accesibles tanto para los administradores como para los miembros del personal.

source: *Announcements from the Profile panel*
es: *Anuncios desde el panel de Perfil*

source: Via the GeoNode :guilabel:`Admin` panel
es: A través del panel GeoNode :guilabel:`Admin`

source: Those are accessible by admins only.
es: Sólo los administradores pueden acceder a ellos.

source: *Announcements from the Admin panel*
es: *Anuncios del panel de administración*

source: The functionalities are almost the same for both the interfaces, except that from the :guilabel:`Admin` panel it is possible to manage the dismissals too.
es: Las funcionalidades son casi las mismas para ambas interfaces, excepto que desde el panel :guilabel:`Admin` también es posible gestionar las desestimaciones.

source: ``Dismissals`` are basically records of members that have read the announcement and closed the message box. An announcement can have one ``dismissal type`` among the three below:
es: Las ``desestimaciones`` son básicamente registros de miembros que han leído el anuncio y cerrado el cuadro de mensaje. Un anuncio puede tener uno de los tres ``tipo de desestimaciones`` siguientes:

source: :guilabel:`No Dismissal Allowed` it won't be possible to close the announcement's message box at all.
es: :guilabel:`No se permiten desestimaciones` no será posible cerrar el cuadro de mensaje del anuncio en absoluto.

source: :guilabel:`Session Only Dismissal` (*) the default one, it will be possible to close the announcement's message box for the current browser session. It will show up again at next access.
es: :guilabel:`Descarte solo de sesión` (*) el predeterminado, será posible cerrar el cuadro de mensaje del anuncio para la sesión actual del navegador. Aparecerá nuevamente en el próximo acceso.

source: :guilabel:`Permanent Dismissal Allowed` once the announcement's message box is closed, it won't appear again for the current member.
es: :guilabel:`Desestimación permanente permitida` una vez que se cierra el cuadro de mensaje del anuncio, no volverá a aparecer para el miembro actual.

source: How to create and manage Announcements
es: Cómo crear y gestionar anuncios

source: From the :guilabel:`Profile` panel, click on ``Announcements`` link
es: Desde el panel :guilabel:`Perfil`, haz clic en el enlace ``Anuncios``

source: *Announcements List from the Profile panel*
es: *Lista de anuncios del panel de perfil*

source: Click either on :guilabel:`New Announcement` to create a new one or over a title of an existing one to manage its contents.
es: Haga clic en :guilabel:`Nuevo Anuncio` para crear uno nuevo o sobre el título de uno existente para administrar su contenido.

source: Create a new announcement is quite straight; you have to fill the fields provided by the form.
es: Crear un nuevo anuncio es bastante sencillo; tienes que rellenar los campos proporcionados por el formulario.

source: In order to be visible, you will need to check the :guilabel:`Site wide` option **in any case**. You might want to hide the message to *anonymous* users by enabling the :guilabel:`Members only` option too.
es: Para que sea visible, deberás marcar la opción :guilabel:`Todo el sitio` **en cualquier caso**. Es posible que desees ocultar el mensaje a usuarios *anónimos* habilitando también la opción :guilabel:`Solo miembros`.

source: *Create Announcement from the Profile panel*
es: *Crear anuncio desde el panel de perfil*

source: Managing announcements form the :guilabel:`Admin` panel, is basically the same; the fields for the form will be exactly the same.
es: Administrar anuncios desde el panel :guilabel:`Admin`, es básicamente lo mismo; Los campos del formulario serán exactamente los mismos.

source: *Create Announcement from the Admin panel*
es: *Crear anuncios desde el panel de administración*

source: Accessing announcements options from the :guilabel:`Admin` panel, allows you to manage dismissals also. Through this interface you will be able to selectively decide members which can or cannot view a specific announcement, or force them to visualize the messages again by deleting the dismissals accordingly.
es: Accediendo a las opciones de anuncios desde el panel :guilabel:`Admin`, permite gestionar también las desestimaciones. A través de esta interfaz podrás decidir selectivamente qué miembros pueden o no ver un anuncio específico, u obligarlos a visualizar los mensajes nuevamente eliminando las desestimaciones en consecuencia.

source: *Create Dismissal from the Admin panel*
es: *Crear desestimaciones desde el panel de administración*

source: Menus, Items and Placeholders
es: Menús, elementos y marcadores de posición

source: GeoNode provides some integrated functionalities allowing you to quickly and easily customize the top-bar menu (see the example below).
es: GeoNode proporciona algunas funcionalidades integradas que le permiten personalizar rápida y fácilmente el menú de la barra superior (consulte el ejemplo a continuación).

source: *GeoNode Top-Bar Menu customization*
es: *Personalización del menú de la barra superior de GeoNode*

source: With minor changes of the ``basic.html`` template, potentially, it could be possible to use the same approach for a more complex customization. Let's start with the simple one.
es: Con cambios menores en la plantilla ``basic.html``, potencialmente, podría ser posible utilizar el mismo enfoque para una personalización más compleja. Empecemos por el sencillo.

source: By default GeoNode provides custom ``placeholders`` already defined into the ``basic.html`` template, called ``CARDS_MENU``, ``TOPBAR_MENU_RIGHT``, ``TOPBAR_MENU_LEFT``, ``TOPBAR_MENU``.
es: Por defecto, GeoNode proporciona ``marcadores de posición`` personalizados ya definidos en la plantilla ``basic.html``, llamados ``CARDS_MENU``, ``TOPBAR_MENU_RIGHT``, ``TOPBAR_MENU_LEFT``, ``TOPBAR_MENU``.

source: From the :guilabel:`Admin > Base` panel, it is possible to access to the ``Menu``, ``Menu Items`` and ``Menu Placeholder`` options.
es: Desde el panel :guilabel:`Admin > Base`, es posible acceder a las opciones ``Menú``, ``Elementos de Menú`` y ``Marcador de Posición de Menú``.

source: *Menu, Menu Items and Menu Placeholder options on the Admin panel*
es: *Menú, elementos del menú y opciones de marcador de posición del menú en el panel de administración*

source: The hierarchical structure of a custom ``Menu`` is the following one:
es: La estructura jerárquica de un ``Menú`` personalizado es la siguiente:

source: ``Menu Placeholder``; first of all you need to define a *placeholder* both into the :guilabel:`Admin > Base` panel and the ``basic.html`` template, using the same **keyword**.
es: ``Marcador de posición de menú``; Primero que nada necesitas definir un *marcador de posición* tanto en el panel :guilabel:`Admin > Base` como en la plantilla ``basic.html``, usando la misma **palabra clave**.

source: By default GeoNode provides already defined menus.
es: Por defecto, GeoNode proporciona menús ya definidos.

source: *The default ``TOPBAR_MENU`` Menu Placeholder on the Admin panel*
es: *El marcador de posición del menú predeterminado ``TOPBAR_MENU`` en el panel de administración*

source: ``Menu``; second thing to do is to create a new *menu* associated to the corresponding *placeholder*.
es: ``Menú``; Lo segundo que debe hacer es crear un nuevo *menú* asociado al *marcador de posición* correspondiente.

source: This is still possible from the :guilabel:`Admin > Base` panel
es: Esto todavía es posible desde el panel :guilabel:`Admin > Base`

source: *Create a new Menu from the Admin panel*
es: *Crear un nuevo menú desde el panel de administración*

source: You will need to provide:
es: Deberá proporcionar:

source: A ``Title``, representing the name of the ``Menu`` visible by the users
es: Un ``Título``, que representa el nombre del ``Menú`` visible por los usuarios

source: By using this approach, internationalization won't be supported. For the time being GeoNode does not support this for menus created from the :guilabel:`Admin > Base` panel.
es: Al utilizar este enfoque, no se respaldará la internacionalización. Por el momento GeoNode no soporta esto para menús creados desde el panel :guilabel:`Admin > Base`.
