Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/admin_panel/index.po
Languages: es

source: the *Last Editing Date* which shows a timestamp corresponding to the last editing of the group properties;
es: la *Fecha de última modificación* que muestra una marca de tiempo correspondiente a la última edición de las propiedades del grupo;

source: the *Keywords* associated with the group;
es: las *Palabras clave* asociadas al grupo;

source: *Permissions* on the group (Public, Public(invite-only), Private);
es: *Permisos* en el grupo (Público, Público (solo por invitación), Privado);

source: *Members* who join the group;
es: *Miembros* que se unen al grupo;

source: *Managers* who manage the group.
es: *Administradores* que gestionan el grupo.

source: There are also four links:
es: También hay cuatro enlaces:

source: The :guilabel:`Edit Group Details` link opens the *Group Profile Form* through which the following properties can be changed:
es: El enlace :guilabel:`Editar Detalles del Grupo` abre el *Formulario de perfil de grupo* a través del cual se pueden cambiar las siguientes propiedades:

source: *Title*.
es: *Título*.

source: *Logo* (see next paragraphs).
es: *Logotipo* (ver siguientes párrafos).

source: *Description*.
es: *Descripción*.

source: *Email*, to contact one or all group members.
es: *Correo electrónico*, para contactar a uno o todos los miembros del grupo.

source: *Keywords*, a comma-separated list of keywords.
es: *Palabras clave*, una lista de palabras clave separadas por comas.

source: *Access*, which regulates permissions:
es: *Acceso*, que regula los permisos:

source: *Public*: any registered user can view and join a public group.
es: *Público*: cualquier usuario registrado puede ver y unirse a un grupo público.

source: *Public (invite-only)*: only invited users can join, any registered user can view the group.
es: *Público (solo por invitación)*: solo los usuarios invitados pueden unirse, cualquier usuario registrado puede ver el grupo.

source: *Private*: only invited users can join the group, registered users cannot see any details about the group, including membership.
es: *Privado*: solo los usuarios invitados pueden unirse al grupo, los usuarios registrados no pueden ver ningún detalle sobre el grupo, incluida la membresía.

source: *Categories*, the group categories the group belongs to.
es: *Categorías*, las categorías de grupo a las que pertenece el grupo.

source: :guilabel:`Manage Group Members` (see next paragraphs).
es: :guilabel:`Administrar los Miembros del Grupo` (ver los siguientes párrafos).

source: the :guilabel:`Delete this Group`, click on it to delete the Group Profile. GeoNode requires you to confirm this action.
es: el :guilabel:`Eliminar este Grupo`, haga clic en él para eliminar el Perfil del Grupo. GeoNode requiere que confirmes esta acción.

source: *Confirm Group Deletion*
es: *Confirmar eliminación del grupo*

source: the :guilabel:`Group Activities` drives you to the *Group Activities Page* where you can see all datasets, maps and documents associated with the group. There is also a *Comments* tab which shows comments on those resources.
es: :guilabel:`Actividades del Grupo` lo lleva a la *Página de actividades del grupo* donde puede ver todos los conjuntos de datos, mapas y documentos asociados con el grupo. También hay una pestaña *Comentarios* que muestra comentarios sobre esos recursos.

source: *Group Activities*
es: *Actividades del Grupo*

source: Group Logo
es: Logotipo del Grupo

source: Each group represents something in common between its members. So each group should have a *Logo* which graphically represents the idea that identify the group.
es: Cada grupo representa algo en común entre sus miembros. Por lo que cada grupo debe tener un *Logotipo* que represente gráficamente la idea que identifica al grupo.

source: On the *Group Profile Form* page you can insert a logo from your disk by click on :guilabel:`Browse...`.
es: En la página *Formulario de perfil de grupo* puedes insertar un logotipo desde tu disco haciendo clic en :guilabel:`Examinar...`.

source: *Editing the Group Logo*
es: *Edición del logotipo del grupo*

source: Click on :guilabel:`Update` to apply the changes.
es: Haga clic en :guilabel:`Actualizar` para aplicar los cambios.

source: Take a look at your group now, you should be able to see that logo.
es: Echa un vistazo a tu grupo ahora, deberías poder ver ese logotipo.

source: *The Group Logo*
es: *El logotipo del grupo*

source: Managing Group members
es: Gestionar Miembros del Grupo

source: The :guilabel:`Manage Group Members` link opens the *Group Members Page* which shows *Group Members* and *Group Managers*. **Managers** can edit group details, can delete the group, can see the group activities and can manage memberships. Other **Members** can only see the group activities.
es: El enlace :guilabel:`Administrar Miembros del Grupo` abre la *Página de miembros del grupo* que muestra *Miembros del grupo* y *Administradores del grupo*. **Los administradores** pueden editar los detalles del grupo, eliminar el grupo, ver las actividades del grupo y administrar las membresías. Otros **Miembros** solo pueden ver las actividades del grupo.

source: In Public Groups, users can join the group without any approval. Other types of groups require the user to be invited by the group managers.
es: En los grupos públicos, los usuarios pueden unirse al grupo sin necesidad de aprobación. Otros tipos de grupos requieren que el usuario sea invitado por los administradores del grupo.

source: Only group managers can *Add new members*. In the picture below, you can see the manager can search for users by typing their names into the *User Identifiers* search bar. Once found, he can add them to the group by clicking the :guilabel:`Add Group Members` button. The *Assign manager role* flag implies that all the users found will become managers of the group.
es: Sólo los administradores de grupo pueden *Agregar nuevos miembros*. En la imagen a continuación, puede ver que el administrador puede buscar usuarios escribiendo sus nombres en la barra de búsqueda *Identificadores de usuario*. Una vez encontrados, puede agregarlos al grupo haciendo clic en el botón :guilabel:`Administrar miembros del grupo`. El indicador *Asignar rol de administrador* implica que todos los usuarios encontrados se convertirán en administradores del grupo.

source: *Adding a new Member to the Group*
es: *Agregar un nuevo miembro al grupo*

source: The following picture shows you the results.
es: La siguiente imagen muestra los resultados.

source: *New Members of the Group*
es: *Nuevos Miembros del Grupo*

source: If you want to change the role of group members after adding them, you can use the "promote" button to make a member into a manager, and the "demote" button to make a manager into a regular member.
es: Si desea cambiar el rol de los miembros del grupo después de agregarlos, puede usar el botón "Ascender" para convertir a un miembro en administrador y el botón "Degradar" para convertir a un administrador en miembro normal.

source: Group based advanced data workflow
es: Flujo de trabajo avanzado basado en grupos

source: By default GeoNode is configured to make every resource suddenly available to everyone, i.e. publicly accessible even from anonymous/non-logged in users.
es: De forma predeterminada, GeoNode está configurado para que todos los recursos estén repentinamente disponibles para todos, es decir, accesibles públicamente incluso para usuarios anónimos o que no hayan iniciado sesión.

source: It is actually possible to change few configuration settings in order to allow GeoNode to enable an advanced publication workflow.
es: En realidad, es posible cambiar algunas configuraciones para permitir que GeoNode habilite un flujo de trabajo de publicación avanzado.

source: With the advanced workflow enabled, your resources won't be automatically published (i.e. made visible and accessible for all, contributors or simple users).
es: Con el flujo de trabajo avanzado habilitado, tus recursos no se publicarán automáticamente (es decir, no serán visibles ni accesibles para todos, ya sean colaboradores o usuarios simples).

source: For now, your item is only visible by yourself, the manager of the group to which the resource is linked (this information is filled in the metadata), the members of this group, and the GeoNode Administrators.
es: Por ahora, tu ítem solo es visible para ti, el administrador del grupo al que está vinculado el recurso (esta información se completa en los metadatos), los miembros de este grupo y los administradores de GeoNode.

source: Before being published, the resource will follow a two-stage review process, which is described below:
es: Antes de ser publicado, el recurso seguirá un proceso de revisión de dos etapas, que se describe a continuación:

source: *From upload to publication: the review process on GeoNode*
es: *Desde la carga hasta la publicación: el proceso de revisión en GeoNode*

source: How to enable the advanced workflow
es: Cómo habilitar el flujo de trabajo avanzado

source: You have to tweak the GeoNode settings accordingly.
es: Tienes que ajustar la configuración de GeoNode en consecuencia.

source: Please see the details of the following GeoNode ``Settings``:
es: Consulte los detalles de las siguientes ``Configuraciónes`` de GeoNode:

source: Summarizing, when all the options above of the Advanced Workflow are enabled, upon a new upload we will have:
es: En resumen, cuando todas las opciones anteriores del Flujo de trabajo avanzado estén habilitadas, al realizar una nueva carga tendremos:

source: The **"unpublished"** resources will be **hidden** to **anonymous users only**. The **registered users** will be still able to access the resources (if they have the rights to do that, of course).
es: Los recursos **"no publicados"** estarán **ocultos** solo para los **usuarios anónimos**. Los **usuarios registrados** aún podrán acceder a los recursos (si, por supuesto, tienen los derechos para hacerlo).

source: The **"unpublished"** resources will remain hidden to users if the permission (see *Admin Guide section: 'Manage Permissions'*) will be explicitly removed
es: Los recursos **"no publicados"** seguirán ocultos para los usuarios si el permiso (ver sección de la *Guía del Administrador: 'Gestionar permisos'*) se elimina explícitamente

source: During the upload, whenever the advanced workflow is enabled, the **owner's Groups** are automatically allowed to access the resource, even if the **"anonymous"** flag has been disabled. Those permissions can be removed later on
es: Durante la carga, siempre que el flujo de trabajo avanzado esté habilitado, los **Grupos del propietario** del recurso tienen automáticamente acceso al recurso, incluso si la opción **"anónimo"** ha sido desactivada. Estos permisos pueden ser eliminados más adelante

source: During the upload, **"managers"** of the owner's Groups associated to the resource, are always allowed to edit the resource, the same as they are admin for that resource
es: Durante la carga, los "administradores" de los grupos del propietario asociados al recurso siempre tienen permiso para editar el recurso, igual que si fueran administradores del mismo

source: **"managers"** of the owner's Groups associated to the resource are allowed to **"publish"** also the resources, not only to **"approve"** them
es: Los **"administradores"** de los grupos del propietario asociados al recurso también pueden **"publicar"** los recursos, no solo **"aprobarlos"**

source: Change the owner rights in case of advanced workflow is on
es: Cambie los derechos del propietario en caso de que el flujo de trabajo avanzado esté habilitado

source: After switching ``ADMIN_MODERATE_UPLOADS`` to True and resource is approved owner is no longer able to modify it. He will see new button on the resource detail page: Request change. After clicking this, view with short form is shown. On this view user can write short message why he want to modify the resource.
es: Después de cambiar ``ADMIN_MODERATE_UPLOADS`` a Verdadero y aprobar el recurso, el propietario ya no podrá modificarlo. Verá un nuevo botón en la página de detalles del recurso: Solicitar cambio. Al hacer clic en este botón, se mostrará una vista con un formulario breve. En esta vista, el usuario puede escribir un mensaje corto explicando por qué desea modificar el recurso.

source: This message will be sent through messaging and email system to administrators:
es: Este mensaje se enviará a través del sistema de mensajería y correo electrónico a los administradores:

source: After administrator unapprove the resource owner is again able to modify it.
es: Después de que el administrador desapruebe el recurso, el propietario podrá modificarlo nuevamente.

source: The group Manager approval
es: La aprobación del administrador del grupo

source: Here, the role of the Manager of the group to which your dataset, document or map is linked is to check that the uploaded item is correct. Particularly, in the case of a dataset or a map, it consists of checking that the chosen cartographic representation and the style are fitting but also that the discretization is appropriate.
es: Aquí, la función del administrador del grupo al que está vinculado su conjunto de datos, documento o mapa es verificar que el elemento cargado sea correcto. En particular, en el caso de un conjunto de datos o de un mapa, consiste en comprobar que la representación cartográfica elegida y el estilo son adecuados pero también que la discretización es adecuada.

source: The Manager must also check that the metadata are properly completed and that the mandatory information (Title, Abstract, Edition, Keywords, Category, Group, Region) are filled.
es: El Responsable también debe verificar que los metadatos estén correctamente completados y que la información obligatoria (Título, Resumen, Edición, Palabras clave, Categoría, Grupo, Región) esté completa.

source: If needed, the Manager can contact the contributor responsible of the dataset, document or map in order to report potential comments or request clarifications.
es: Si es necesario, el Gestor puede ponerse en contacto con el colaborador responsable del conjunto de datos, documento o mapa para informar posibles comentarios o solicitar aclaraciones.

source: Members of the group can also take part in the reviewing process and give some potential inputs to the responsible of the dataset, document or map.
es: Los miembros del grupo también pueden participar en el proceso de revisión y dar algunos aportes potenciales al responsable del conjunto de datos, documento o mapa.

source: When the Manager considers that the resource is ready to be published, he should approve it. To do so, the Manager goes to the resource detail page, then opens the :guilabel:`Edit Metadata`. In the :guilabel:`Settings` tab, the manager checks the :guilabel:`Approved` box, and then updates the metadata and saves the changes:
es: Cuando el Gestor considere que el recurso está listo para ser publicado, deberá aprobarlo. Para hacerlo, el Administrador va a la página de detalles del recurso y luego abre :guilabel:`Editar metadatos`. En la pestaña :guilabel:`Configuración`, el administrador marca la casilla :guilabel:`Aprobado` y luego actualiza los metadatos y guarda los cambios:

source: Following this approval, the GeoNode Administrators receive a notification informing them that an item is now waiting for publication
es: Después de esta aprobación, los administradores de GeoNode reciben una notificación informándoles que un elemento ahora está esperando su publicación

source: The publication by the GeoNode Administrator
es: La publicación del Administrador de GeoNode

source: Prior to the public release of an approved resource, the Administrator of the platform performs a final validation of the item and its metadata, notably to check that it is in line with license policies.
es: Antes de la publicación de un recurso aprobado, el administrador de la plataforma realiza una validación final del elemento y sus metadatos, en particular para comprobar que cumple con las políticas de licencia.

source: If needed, the GeoNode Administrator can contact the Manager who has approved the resource, as well as its responsible.
es: De ser necesario, el Administrador de GeoNode puede contactar al Gerente que ha aprobado el recurso, así como a su responsable.

source: Once the resource is validated, the item is made public by the Administrator. It can now be viewed, accessed, and downloaded in accordance with the ``Permissions`` set by the responsible contributor.
es: Una vez validado el recurso, el Administrador hace público el elemento. Ahora se puede ver, acceder y descargar de acuerdo con los "Permisos" establecidos por el colaborador responsable.

source: Promotion, Demotion and Removal of Group Members
es: Promoción, degradación y destitución de miembros del grupo

source: If the owner is a group Manager, They have permissions to edit, approve, and publish the resource.
es: Si el propietario es un administrador de grupo, tiene permisos para editar, aprobar y publicar el recurso.

source: When a group member is promoted to a manager role, they gain permissions to edit, approve and publish the resource.
es: Cuando un miembro del grupo asciende a un rol de administrador, obtiene permisos para editar, aprobar y publicar el recurso.

source: When a group manager is demoted to a member role, they lose edit permissions of the resource and only remain with view and download permissions.
es: Cuando un administrador de grupo es degradado a una función de miembro, pierde los permisos de edición del recurso y solo permanece con permisos de visualización y descarga.

source: When a member is removed from the group, they can nolonger access the unpublished resource anymore.
es: Cuando un miembro es eliminado del grupo, ya no puede acceder al recurso no publicado.

source: Manage profiles using the admin panel
es: Administrar perfiles usando el panel de administración

source: So far GeoNode implements two distinct roles, that can be assigned to resources such as datasets, maps or documents:
es: Hasta ahora GeoNode implementa dos roles distintos, que se pueden asignar a recursos como conjuntos de datos, mapas o documentos:

source: party who authored the resource
es: la parte que creó el recurso

source: party who can be contacted for acquiring knowledge about or acquisition of the resource
es: la parte que se puede contactar para obtener información sobre el recurso o para su adquisición

source: These two profiles can be set in the GeoNode interface by accessing the metadata page and setting the ``Point of Contact`` and ``Metadata Author`` fields respectively.
es: Estos dos perfiles se pueden configurar en la interfaz de GeoNode accediendo a la página de metadatos y configurando los campos ``Punto de contacto`` y ``Autor de metadatos`` respectivamente.

source: Is possible for an administrator to add new roles if needed, by clicking on the :guilabel:`Add contact role` button in the :guilabel:`Base -> Contact Roles` section:
es: Es posible que un administrador agregue nuevos roles si es necesario, haciendo clic en el botón :guilabel:`Agregar rol de contacto` en la sección :guilabel:`Base -> Roles de contacto`:

source: Clicking on the :guilabel:`People` section (see figure) will open a web for with some personal information plus a section called :guilabel:`Users`.
es: Al hacer clic en la sección :guilabel:`Personas` (ver figura) se abrirá una web con algunos datos personales más una sección llamada :guilabel:`Usuarios`.

source: Is important that this last section is not modified here unless the administrator is very confident in that operation.
es: Es importante que este último apartado no se modifique aquí a menos que el administrador tenga mucha confianza en esa operación.

source: Manage datasets using the admin panel
es: Administrar conjuntos de datos usando el panel de administración

source: Some of the datasets information can be edited directly through the admin interface although the best place is in the :guilabel:`Dataset -> Metadata Edit` in GeoNode.
es: Parte de la información de los conjuntos de datos se puede editar directamente a través de la interfaz de administración, aunque el mejor lugar es :guilabel:`Conjunto de datos -> Edición de metadatos` en GeoNode.

source: Clicking on the :guilabel:`Admin > Dataset > Datasets` link will show the list of available datasets.
es: Al hacer clic en el enlace :guilabel:`Admin > Conjunto de datos > Conjuntos de datos` se mostrará la lista de conjuntos de datos disponibles.

source: It is not recommended to modify the Datasets' ``Attributes`` or ``Styles`` directly from the Admin dashboard unless you are aware of your actions.
es: No se recomienda modificar los ``Atributos`` o los ``Estilos`` de los conjuntos de datos directamente desde el panel de administración a menos que esté al tanto de sus acciones.

source: The ``Metadata`` information can be changed for multiple datasets at once through the :guilabel:`Metadata batch edit` action. Select the datasets you want to edit in the batch and at the bottom, enter the `Metadata batch edit` action then click :guilabel:`Go`.
es: La información de ``Metadatos`` se puede cambiar para múltiples conjuntos de datos a la vez mediante la acción :guilabel:`Edición por lotes de metadatos`. Seleccione los conjuntos de datos que desea editar en el lote y en la parte inferior, ingrese la acción `Edición por lotes de metadatos` y luego haga clic en :guilabel:`Ir`.

source: This will open a form with the information you can edit in a batch. see picture below.
es: Esto abrirá un formulario con la información que puede editar en un lote. Ver imagen a continuación.

source: By clicking over one Dataset link, it will show a detail page allowing you to modify some of the resource info like the metadata, the keywords, the title, etc.
es: Al hacer clic en el enlace de un conjunto de datos, se mostrará una página de detalles que le permitirá modificar parte de la información del recurso, como los metadatos, las palabras clave, el título, etc.

source: It is strongly recommended to always use the GeoNode resource :guilabel:`Edit Metadata` or :guilabel:`Advanced Metadata` tools in order to edit the metadata info.
es: Se recomienda encarecidamente utilizar siempre las herramientas :guilabel:`Editar metadatos` o :guilabel:`Advanced Metadata` para editar la información de los metadatos en GeoNode.

source: The ``Permissions`` can be changed also for multiple Datasets at once through the :guilabel:`Set permissions` action.
es: Los ``Permisos`` también se pueden cambiar para múltiples conjuntos de datos a la vez mediante la acción :guilabel:`Establecer permisos`.

source: By clicking over one Dataset link, it will show a detail page allowing you to modify the permissions for the selected resources.
es: Al hacer clic en el enlace de un conjunto de datos, se mostrará una página de detalles que le permitirá modificar los permisos para los recursos seleccionados.

source: Manage the maps using the admin panel
es: Administrar los mapas usando el panel de administración

source: Similarly to the Datasets, it is possible to manage the available GeoNode Maps through the Admin panel also.
es: De manera similar a los conjuntos de datos, también es posible administrar los mapas de GeoNode, disponibles a través del panel de administración.

source: Move to :guilabel:`Admin > Maps` to access the Maps list.
es: Vaya a :guilabel:`Admin > Maps` para acceder a la lista de Mapas.
