Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/contribute/documentation/index.po
Languages: es

source: How to contribute to GeoNode's Documentation
es: Cómo contribuir a la documentación de GeoNode

source: If you feel like adding or changing something in the GeoNode documentation you are very welcome to do so. The documentation always needs improvement as the development of the software is going quite fast.
es: Si deseas agregar o cambiar algo en la documentación de GeoNode, puedes hacerlo. La documentación siempre necesita mejoras, ya que el desarrollo del software avanza bastante rápido.

source: To contribute to the GeoNode documentation you should:
es: Para contribuir a la documentación de GeoNode debes:

source: Read the GeoServer Style Guidelines
es: Lea las pautas de estilo de GeoServer

source: Create an account on GitHub
es: Crea una cuenta en GitHub

source: Fork the GeoNode repository
es: Bifurcar el repositorio GeoNode

source: Edit the files
es: Editar los archivos

source: Submit pull requests
es: Enviar solicitudes de extracción

source: All these things can generally be done within your browser, you won't need to download anything. However, if you need to add images or planning bigger changes working locally is recommended.
es: En general, todo esto se puede hacer desde el navegador, no es necesario descargar nada. Sin embargo, si necesitas agregar imágenes o planeas hacer cambios más grandes, se recomienda trabajar de forma local.

source: Style Guidelines
es: Pautas de estilo

source: While we do not have strict rules for writing docs, we encourage you to read GeoServer Style Guidelines before you start writing: https://docs.geoserver.org/latest/en/docguide/style.html
es: Si bien no tenemos reglas estrictas para escribir documentos, te recomendamos leer las Pautas de estilo de GeoServer antes de comenzar a escribir: https://docs.geoserver.org/latest/en/docguide/style.html

source: The first step is to create an account on GitHub. Just go to `Github <https://github.com>`_, find a username that suits you, enter your email and a password and hit *Sign up for GitHub*. After you've signed in, visit the geonode_documentation repository https://github.com/geonode/documentation.
es: El primer paso es crear una cuenta en GitHub. Solo tienes que ir a `Github <https://github.com>`_, buscar un nombre de usuario que te convenga, introducir tu correo electrónico y una contraseña y pulsar *Registrarse en GitHub*. Una vez que hayas iniciado sesión, visita el repositorio geonode_documentation https://github.com/geonode/documentation.

source: Fork the documentation repository
es: Bifurcar el repositorio de documentación

source: In order to make changes, you first have to fork the repository. On the top right of the website, you will find a button named "fork" to do so.
es: Para realizar cambios, primero debes bifurcar el repositorio. En la parte superior derecha del sitio web, encontrarás un botón llamado "fork" para hacerlo.

source: If you want to read more about forking please visit the official GitHub docs: https://help.github.com/articles/fork-a-repo.
es: Si deseas leer más sobre la bifurcación, visite la documentación oficial de GitHub: https://help.github.com/articles/fork-a-repo.

source: Edit files on Github
es: Editar archivos en Github

source: For smaller changes you can use the GitHub website. Navigate your Browser to your forked repository. To make changes to files, navigate to the file in question and hit the *edit* button on the right top.
es: Para realizar cambios menores, puedes utilizar el sitio web de GitHub. Navega en tu navegador hasta el repositorio bifurcado. Para realizar cambios en los archivos, navega hasta el archivo en cuestión y presiona el botón *editar* en la parte superior derecha.

source: The documentation is written in *reStructeredText*, a lightweight markup language. To learn how to use it see: https://docutils.sourceforge.net/docs/user/rst/quickref.html.
es: La documentación está escrita en *reStructeredText*, un lenguaje de marcado ligero. Para aprender a usarlo, consulte: https://docutils.sourceforge.net/docs/user/rst/quickref.html.

source: By hitting the *preview* button you will be able to see how your changes will look like. To save your changes, click on *Commit Changes* at the bottom of the site.
es: Al hacer clic en el botón *vista previa* podrás ver cómo se verán sus cambios. Para guardar los cambios, haz clic en *Confirmar cambios* en la parte inferior del sitio.

source: To ask the documentation maintainers to integrate your changes the creation of a *Pull Request* is needed. Therefore use the *new pull request* button to start the process. Find more about Pull requests at the official GitHub documentation: https://help.github.com/en/github/collaborating-with-issues-and-pull-requests/about-pull-requests .
es: Para solicitar a los encargados de la documentación que integren tus cambios, es necesario crear una *Pull Request*. Por lo tanto, utiliza el botón *new pull request* para iniciar el proceso. Encuentra más información sobre las solicitudes de incorporación de cambios en la documentación oficial de GitHub: https://help.github.com/en/github/collaborating-with-issues-and-pull-requests/about-pull-requests .

source: Edit files locally
es: Editar archivos localmente

source: If you're planning bigger changes on the structure of the documentation, it is advisable to make your changes locally. Further, while you can work on your master branch, it is recommended to create a dedicated branch for your changes.
es: Si planeas realizar cambios más importantes en la estructura de la documentación, es recomendable realizar los cambios de forma local. Además, si bien puedes trabajar en tu rama maestra, se recomienda crear una rama dedicada a los cambios.

source: Start by navigating to a folder where you like to keep your repository locally and install the needed dependencies ::
es: Comienza navegando a una carpeta donde deseas mantener tu repositorio localmente e instala las dependencias necesarias::

source: Your repository should now be up to date! For more information on those commands go to https://git-scm.com/docs. Let's install the dependencies ::
es: ¡Tu repositorio ya debería estar actualizado! Para obtener más información sobre esos comandos, visita https://git-scm.com/docs. Instalemos las dependencias:

source: You can now start the sphinx development server which will serve and live-reload your docs at https://localhost:8000 ::
es: Ahora puedes iniciar el servidor de desarrollo de Sphinx que servirá y recargará en vivo sus documentos en https://localhost:8000 ::

source: When finished create a build with following command ::
es: Cuando termine, crea una compilación con el siguiente comando::

source: Create a pull request
es: Crear una solicitud de extracción

source: As with directly editing files in your browser, you will need to create a Pull request to ask for integrating your changes into the main repository. ::
es: Al igual que con la edición directa de archivos en tu navegador, deberás crear una solicitud de extracción para solicitar la integración de tus cambios en el repositorio principal. ::

source: After running these commands, navigate your browser to your GitHub repository and create a pull request as explained above.
es: Después de ejecutar estos comandos, navega con tu navegador hasta tu repositorio de GitHub y crea una solicitud de extracción como se explicó anteriormente.
