Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/download_handlers/index.po
Languages: es

source: Download Handlers
es: Manejadores de Descargas

source: With GeoNode 4.2.x has been introduced the concept of Download Handler and ofc GeoNode provides a default implementation of it which process the download via WPS
es: Con GeoNode 4.2.x se ha introducido el concepto de Manejador de Descargas y, por supuesto, GeoNode proporciona una implementación predeterminada que procesa la descarga a través de WPS

source: Follow an example of how to create a custom download handler and to replace the default one or add an additional one.
es: Sigue un ejemplo de cómo crear un controlador de descarga personalizado y reemplazar el predeterminado o agregar uno adicional.

source: Settings
es: Ajustes

source: Default: ``geonode.layers.download_handler.DatasetDownloadHandler``
es: Predeterminado: ``geonode.layers.download_handler.DatasetDownloadHandler``

source: path to the download handler location
es: ruta a la ubicación del controlador de descarga

source: Default: ``[]``
es: Predeterminado: ``[]``

source: List of paths of the additional download handlers
es: Lista de rutas de los controladores de descarga adicionales

source: The default download handler is placed under the `geonode.layers` [package](https://github.com/GeoNode/geonode/blob/master/geonode/layers/download_handler.py)
es: El controlador de descarga predeterminado se coloca en el `geonode.layers` [package](https://github.com/GeoNode/geonode/blob/master/geonode/layers/download_handler.py)

source: Follow an example of an basic class for define the download handler:
es: A continuación un ejemplo de una clase básica para definir el controlador de descarga:

source: If you prefer to inherit from the already existing one, the response is generated in the `process_dowload` method
es: Si prefieres heredar del ya existente, la respuesta se genera en el método `process_dowload`
