Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/users_groups/contacting_users.po
Languages: es

source: Contacting other users
es: Contactar con otros usuarios

source: GeoNode allows you to communicate by message with other registered users and groups.
es: GeoNode te permite comunicarte por mensaje con otros usuarios y grupos registrados.

source: To send a message to some user and/or groups you can follow the link :guilabel:`Message User` from your *Profile* page (see :ref:`editing-profile`) or from the *Profile* details page (see the previous section :ref:`user-info`) of that user.
es: Para enviar un mensaje a algún usuario y/o grupo puedes seguir el enlace :guilabel:`Usuario de Mensaje` desde tu página *Perfil* (ver :ref:`editing-profile`) o desde la página de detalles *Perfil* (ver la sección anterior :ref:`user-info`) de ese usuario.

source: *Send message to users and groups*
es: *Enviar mensaje a usuarios y grupos*

source: Insert your content, type a subject and click on :guilabel:`Send message` to send the message to the users and groups you have selected.
es: Inserta tu contenido, escribe un asunto y haz clic en :guilabel:`Enviar mensaje` para enviar el mensaje a los usuarios y grupos que hayas seleccionado.

source: You will be redirected to the *Conversation* details page related to the subject.
es: Serás redirigido a la página de detalles de *Conversación* relacionada con el tema.

source: *Your message*
es: *Tu mensaje*

source: The Inbox page
es: La página de la bandeja de entrada

source: You can view your conversations in your *Inbox* page, reachable through the :guilabel:`Back to inbox` button (see the picture above) or from the :guilabel:`Inbox` link of the user menu.
es: Puedes ver tus conversaciones en tu página *Bandeja de entrada*, accesible a través del botón :guilabel:`Volver a la bandeja de entrada` (ver la imagen de arriba) o desde el enlace :guilabel:`Bandeja de entrada` del menú de usuario.

source: *Inbox link*
es: *Enlace a la bandeja de entrada*

source: The picture below shows how your *Inbox* page should look like.
es: La siguiente imagen muestra cómo debería verse tu página *Bandeja de entrada*.

source: *Inbox page*
es: *Página de bandeja de entrada*

source: In *Inbox* all the unread messages are listed. You haven't received any message yet so your *Inbox* is empty. If you switch to the *All* tab you can see all the conversations you are involved in.
es: En *Bandeja de entrada* se enumeran todos los mensajes no leídos. Aún no has recibido ningún mensaje, por lo que tu *Bandeja de entrada* está vacía. Si cambia a la pestaña *Todos* podrá ver todas las conversaciones en las que participa.

source: *All your conversations*
es: *Todas tus conversaciones*

source: When some user send a reply to your message your *Inbox* shows it, see the picture below for an example.
es: Cuando algún usuario envía una respuesta a su mensaje, su *Bandeja de entrada* lo muestra, vea la imagen a continuación como ejemplo.

source: *A reply to your message*
es: *Una respuesta a tu mensaje*

source: You can open the *Conversation* details by clicking on the *Subject* link.
es: Puede abrir los detalles de la *Conversación* haciendo clic en el enlace *Asunto*.

source: *Conversation details*
es: *Detalles de la Conversación*

source: As you can see in the picture above, in the *Conversation* page you have the ability to write a quick reply. Type your message in the text box and click on :guilabel:`Send Reply` to do that.
es: Como puedes ver en la imagen de arriba, en la página *Conversación* tienes la posibilidad de escribir una respuesta rápida. Escribe tu mensaje en el cuadro de texto y haz clic en :guilabel:`Enviar respuesta` para hacerlo.

source: In the *Inbox* page there is also the :guilabel:`Create Message` button that provides you a quick link to the message creation form.
es: En la página *Bandeja de entrada* también está el botón :guilabel:`Crear mensaje` que te proporciona un enlace rápido al formulario de creación de mensajes.
