Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/users_groups/users_info.po
Languages: es

source: Viewing other users information
es: Ver información de otros usuarios

source: Once your account is created, you can view other accounts on the system.
es: Una vez creada su cuenta, podrá ver otras cuentas en el sistema.

source: To see information about other users on the system, click the :guilabel:`People` link of the :guilabel:`About` menu in *Home* page.
es: Para ver información sobre otros usuarios en el sistema, haz clic en el enlace :guilabel:`Personas` del menú :guilabel:`Acerca de` en la página de *Inicio*.

source: *About menu - People link*
es: *Acerca del menú - Enlace de personas*

source: You will see a list of users registered on the system.
es: Verás una lista de usuarios registrados en el sistema.

source: *List of the registered users*
es: *Lista de los usuarios registrados*

source: The *Search* tool is very useful in case of many registered users, type the name of the user you are looking for in the input text field to filter the users list.
es: La herramienta *Buscar* es muy útil en caso de que haya muchos usuarios registrados, escriba el nombre del usuario que está buscando en el campo de entrada de texto para filtrar la lista de usuarios.

source: Select a user and click on its *username* to access to the user details page.
es: Seleccione un usuario y haga clic en su *nombre de usuario* para acceder a la página de detalles del usuario.

source: *User details*
es: *Detalles de usuario*

source: In this page the main information about the user are shown: personal information (organization) and the resources the user owns (datasets, maps, documents and other apps).
es: En esta página se muestra la información principal sobre el usuario: información personal (organización) y los recursos que posee el usuario (conjuntos de datos, mapas, documentos y otras aplicaciones).

source: Through the :guilabel:`User Activities` link, in right side of the page, it is possible to visualize all the activities the user has been done.
es: A través del enlace :guilabel:`Actividades del Usuario`, en el lado derecho de la página, es posible visualizar todas las actividades que ha realizado el usuario.

source: *User activities*
es: *Actividades del usuario*

source: The :guilabel:`Message User` link lets you to contact other users, see the next section to read more about that.
es: El enlace :guilabel:`Mensaje de usuario` le permite contactar a otros usuarios; consulte la siguiente sección para leer más al respecto.

source: It is also possible, in GeoNode, to see the recent activities of all users through the :guilabel:`Recent Activities` link of the user menu.
es: También es posible, en GeoNode, ver las actividades recientes de todos los usuarios a través del enlace :guilabel:`Actividades recientes` del menú de usuario.

source: *Recent Activities link*
es: *Enlace de actividades recientes*

source: In the picture below an example.
es: En la imagen de abajo un ejemplo.

source: *Recent Activities*
es: *Actividades recientes*

source: As you can see, you can decide whether to see only the activities related to datasets or those related to maps or comments by switching the tabs.
es: Como puedes ver, puedes decidir si deseas ver solo las actividades relacionadas con conjuntos de datos o aquellas relacionadas con mapas o comentarios cambiando las pestañas.
