Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/devel/mapstore/index.po
Languages: es

source: Start MapStore2 client in development mode
es: Iniciar el cliente MapStore2 en modo de desarrollo

source: Pre-requisites
es: Prerrequisitos

source: You need a running instance of GeoNode somewhere; in this specific example we assume GeoNode is running on ::guilabel:`http://localhost:8000`
es: Necesitas una instancia de GeoNode en ejecución en algún lugar; en este ejemplo específico, asumimos que GeoNode se está ejecutando en ::guilabel:`http://localhost:8000`

source: Install needed packages
es: Instalar los paquetes necesarios

source: Prepare the source code
es: Preparar el código fuente

source: Compile MapStore2 Client
es: Compilar el cliente MapStore2

source: Edit the file ``env.json``
es: Editar el archivo ``env.json``

source: Run MapStore2 in Development mode
es: Ejecutar MapStore2 en modo de desarrollo

source: Connect to :::guilabel:`http://localhost:8081`
es: Conectate a :::guilabel:`http://localhost:8081`

source: This is a ``proxied`` version of GeoNode form MapStore2 client. **To upload new layers user the original GeoNode**.
es: Esta es una versión "proxy" de GeoNode del cliente MapStore2. **Para cargar nuevas capas, utiliza el GeoNode original**.

source: Everytime you render a map, from GeoNode layers details page or map creation, you will access to the MapStore2 dev mode runnig code.
es: Cada vez que renderizas un mapa, desde la página de detalles de capas de GeoNode o la creación de mapas, accederás al código de ejecución del modo de desarrollo de MapStore2.

source: You can now update the code on the fly.
es: Ahora puedes actualizar el código sobre la marcha.

source: Example 1: Disable the PrintPlugin from the Layer Details small map
es: Ejemplo 1: Deshabilitar el complemento de impresión desde el mapa pequeño de Detalles de capa

source: Example 2: Disable the MousePositionPlugin from the big maps
es: Ejemplo 2: Deshabilitar el complemento MousePositionPlugin de los mapas grandes
