Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/basic/theme/index.po
Languages: es

source: GeoNode Themes
es: Temas de GeoNode

source: We have already explained in :ref:`simple-theming` how to change the GeoNode theme directly from the *Admin Interface*. This is an easy way for customizing GeoNode appearance but, in some cases, you might want to have more control on it.
es: Ya hemos explicado en :ref:`simple-theming` cómo cambiar el tema de GeoNode directamente desde la *Interfaz de administración*. Esta es una manera fácil de personalizar la apariencia de GeoNode pero, en algunos casos, es posible que desees tener más control sobre ella.

source: In those cases, you have to venture into the code and it is highly recommended to use a GeoNode Project and customize it instead of the GeoNode default HTML/CSS code. See the following sections to learn more about that.
es: En esos casos, es necesario adentrarse en el código y se recomienda encarecidamente utilizar un proyecto de GeoNode personalizado en lugar del código HTML/CSS predeterminado de GeoNode. Consulta las siguientes secciones para obtener más información al respecto.

source: Theming your GeoNode Project
es: Personalización del tema de tu Proyecto GeoNode

source: There are a range of options available to you if you want to change the default look and feel of your :ref:`geonode-project`.
es: Hay una variedad de opciones disponibles si deseas cambiar la apariencia predeterminada de tu :ref:`geonode-project`.

source: Logos and graphics
es: Logotipos y gráficos

source: GeoNode intentionally does not include a large number of graphics files in its interface. This keeps page loading time to a minimum and makes for a more responsive interface. That said, you are free to customize your GeoNode’s interface by simply changing the default logo, or by adding your own images and graphics to deliver a GeoNode experience the way you envision it.
es: GeoNode intencionalmente no incluye una gran cantidad de archivos gráficos en su interfaz. Esto mantiene el tiempo de carga de las páginas al mínimo y ofrece una interfaz más receptiva. Dicho esto, tienes la libertad de personalizar la interfaz de tu GeoNode simplemente cambiando el logo predeterminado o añadiendo tus propias imágenes y gráficos para ofrecer una experiencia de GeoNode tal como la imaginas.

source: Your GeoNode project has a directory already set up for storing your own images at ``<my_geonode>/static/img``. You should place any image files that you intend to use for your project in this directory.
es: Tu proyecto GeoNode ya tiene un directorio configurado para almacenar tus propias imágenes en ``<my_geonode>/static/img``. Debes colocar cualquier archivo de imagen que planees usar para tu proyecto en este directorio.

source: Let’s walk through an example of the steps necessary to change the default logo.
es: Vamos a recorrer un ejemplo de los pasos necesarios para cambiar el logo predeterminado.

source: Change to the :file:`img` directory:
es: Cambie al directorio :file:`img`:

source: If you haven't already, obtain your logo image. The URL below is just an example, so you will need to change this URL to match the location of your file or copy it to this location:
es: Si aún no lo has hecho, obtén la imagen de tu logo. La URL a continuación es solo un ejemplo, por lo que deberás cambiar esta URL para que coincida con la ubicación de tu archivo o copiarlo a esta ubicación:

source: Create snippets directory :
es: Crea el directorio de fragmentos snippets:

source: Create a new HTML file named :file:`brand_navbar.html`
es: Crea un nuevo archivo HTML llamado :file:`brand_navbar.html`

source: Restart your GeoNode project and look at the page in your browser:
es: Reinicia tu proyecto GeoNode y observa la página en tu navegador:

source: It is a good practice to cleanup the **static_folder** and the Browser Cache before reloading in order to be sure that the changes have been correctly taken and displayed on the screen.
es: Es una buena práctica limpiar la **static_folder** y la caché del navegador antes de recargar para asegurarte de que los cambios se han aplicado y se muestran correctamente en la pantalla.

source: Visit your site at http://localhost/ or the remote URL for your site.
es: Visite tu sitio en http://localhost/ o la URL remota de tu sitio.

source: *Custom logo*
es: *Logotipo personalizado*

source: In the following sections you will learn how to customize this header to make it as you want.
es: En las siguientes secciones aprenderás a personalizar este encabezado para dejarlo como quieras.

source: You should commit these changes to your repository as you progress through this section, and get in the habit of committing early and often so that you and others can track your project on GitHub. Making many atomic commits and staying in sync with a remote repository makes it easier to collaborate with others on your project.
es: Debes comprometer estos cambios en tu repositorio a medida que avances en esta sección, y adquirir el hábito de hacer commits frecuentes para que tú y otros puedan seguir el progreso de tu proyecto en GitHub. Realizar muchos commits atómicos y mantener la sincronización con un repositorio remoto facilita la colaboración con otros en tu proyecto.

source: Cascading Style Sheets
es: Hojas de estilo en cascada

source: In the last section you already learned how to override GeoNode’s default CSS rules to include your own logo. You are able to customize any aspect of GeoNode’s appearance this way. In the last screenshot, you saw that the main area in the homepage is covered up by the expanded header.
es: En la sección anterior ya aprendiste cómo sobrescribir las reglas CSS predeterminadas de GeoNode para incluir tu propio logo. De esta manera, puedes personalizar cualquier aspecto de la apariencia de GeoNode. En la última captura de pantalla, viste que el área principal en la página de inicio está cubierta por el encabezado expandido.

source: First, we’ll walk through the steps necessary to displace it downward so it is no longer hidden, then change the background color of the header to match the color in our logo graphic.
es: Primero, revisaremos los pasos necesarios para desplazar el encabezado hacia abajo para que ya no quede oculto, y luego cambiaremos el color de fondo del encabezado para que coincida con el color de nuestro gráfico de logo.

source: Reopen :file:`<my_geonode>/static/css/brand_navbar.html` in your editor:
es: Vuelve a abrir el archivo :file:`<my_geonode>/static/css/brand_navbar.html` en tu editor:

source: Append a rule to change the background color of the header to match the logo graphic:
es: Agregue una regla para cambiar el color de fondo del encabezado para que coincida con el gráfico del logotipo:

source: Create new file to manipulate *hero* section:
es: Crear nuevo archivo para manipular la sección *hero*:

source: Add the following code to change the background image and font for the *hero* section:
es: Agrega el siguiente código para cambiar la imagen de fondo y la fuente de la sección *hero*:

source: Collect the static files into STATIC_ROOT, restart the development server and reload the page:
es: Recopile los archivos estáticos en STATIC_ROOT, reinicie el servidor de desarrollo y vuelva a cargar la página:

source: *CSS override*
es: *Anulación de CSS*

source: You can continue adding rules to this file to override the styles that are in the GeoNode base CSS file which is built from `base.less <https://github.com/GeoNode/geonode/blob/master/geonode/static/geonode/less/base.less>`_.
es: Puedes seguir añadiendo reglas a este archivo para sobrescribir los estilos que están en el archivo CSS base de GeoNode, el cual se construye a partir de `base.less <https://github.com/GeoNode/geonode/blob/master/geonode/static/geonode/less/base.less>`_.

source: You may find it helpful to use your browser's development tools to inspect elements of your site that you want to override to determine which rules are already applied. See the screenshot below.
es: Puede ser útil utilizar las herramientas de desarrollo de tu navegador para inspeccionar los elementos de tu sitio que deseas modificar y determinar qué reglas ya están aplicadas. Consulta la captura de pantalla a continuación.

source: *Screenshot of using browser debugger to inspect the CSS overrides*
es: *Captura de pantalla del uso del depurador del navegador para inspeccionar las modificaciones de CSS*

source: Modify GeoNode Homepage
es: Modificar la página de inicio de GeoNode

source: So far we learned how to modify some template sections of your GeoNode main page. You can do it individually per section template, adding a new page under :file:`<my_geonode>/templates/geonode-mapstore-client/snippets` folder with the section name (ex: :file:`brand_navbar.html`) or by extending the base template file :file:`custom_theme.html` where you can add different theme settings in one place.
es: Hasta ahora hemos aprendido cómo modificar algunas secciones de la plantilla de la página principal de tu GeoNode. Puedes hacerlo individualmente por sección de la plantilla, agregando una nueva página en la carpeta :file:`<my_geonode>/templates/geonode-mapstore-client/snippets` con el nombre de la sección (por ejemplo, :file:`brand_navbar.html`), o extendiendo el archivo de plantilla base :file:`custom_theme.html`, donde puedes agregar diferentes configuraciones de tema en un solo lugar.

source: Remove the previous `hero` section :file:`hero.html` file:
es: Elimina el archivo de la sección `hero` anterior :file:archivo`hero.html`:

source: Create a new :file:`custom_theme.html` file:
es: Crea un nuevo archivo :file:`custom_theme.html`:

source: Add the following content to this page:
es: Añade el siguiente contenido a esta página:

source: Restart httpd server
es: Reinicia el servidor httpd

source: Your customized layout should be similar to the next picture:
es: Tu diseño personalizado debe ser similar a la siguiente imagen:

source: Edit title and intro message
es: Edita el título y mensaje de introducción

source: Login as administrator on GeoNode and go to ``Admin`` page:
es: Inicia sesión como administrador en GeoNode y ve a la página "Administrador":

source: Create a new theme under `GeoNode Themes Library` and ``Themes``:
es: Crea un nuevo tema en ``Biblioteca de temas de GeoNode`` y ``Temas``:

source: Add a ``Name``, ``Description`` and turn on ``Is enabled`` option. At the bottom, add a ``Jumbotron title`` and ``Jumbotron content``. This will override the default GeoNode welcome title and message. Click ``Save`` at the bottom in the end.
es: Agrega un ``Name`` (Nombre), ``Description`` (Descripción) y activa la opción ``Is enabled`` (Esta habilitado). En la parte inferior, agregue un ``Jumbotron title`` y un ``Jumbotron content``. Esto anulará el título y el mensaje de bienvenida predeterminados de GeoNode. Haga clic en ``Guardar`` en la parte inferior al final.

source: After this, reload your GeoNode homepage. The output should be similar to this:
es: Después de esto, vuelva a cargar la página de inicio de GeoNode. El resultado debería ser similar a esto:
