Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/devel/running/index.po
Languages: es

source: How to run GeoNode Core for development
es: Cómo ejecutar GeoNode Core para el desarrollo

source: In order to start Geonode Core for development, you need to make sure that no Geonode instance is running first. This can be done by running the following commands:
es: Para iniciar Geonode Core para el desarrollo, debes asegurarte que no se esté ejecutando ninguna instancia de Geonode. Esto se puede hacer ejecutando los siguientes comandos:

source: Then you need to start both geoserver and django services as follows:
es: Luego debes iniciar los servicios geoserver y django de la siguiente manera:

source: Now you can visit your Geonode GUI by typing http://localhost:8000 into your browser window
es: Ahora puede visitar la GUI de Geonode escribiendo http://localhost:8000 en la ventana de su navegador

source: How to run GeoNode Project for development
es: Cómo ejecutar el proyecto GeoNode para desarrollo

source: In order to run a project for development, the following steps have to be followed:
es: Para ejecutar un proyecto de desarrollo se deben seguir los siguientes pasos:

source: 1- Make sure there is no running instance of Geonode first by running the following command:
es: 1- Asegúrate primero que no haya ninguna instancia de Geonode en ejecución ejecutando el siguiente comando:

source: The above command will stop all services related to Geonode if running
es: El comando anterior detendrá todos los servicios relacionados con Geonode si se ejecuta

source: 2- Start the servers by running paver start as follows:
es: 2- Inicia los servidores ejecutando paver start de la siguiente manera:

source: Now you can visit your geonode project site by typing http://localhost:8000 into your browser window
es: Ahora puedes visitar el sitio de tu proyecto geonode escribiendo http://localhost:8000 en la ventana de tu navegador
