Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/dashboard/index.po
Languages: es

source: Dashboard
es: Tablero

source: Dashboard is a MapStore tool integrated in GeoNode that provides the user with a space to add many Widgets, such as charts, maps, tables, texts and counters, and can create connections between them in order to:
es: Dashboard es una herramienta MapStore integrada en GeoNode que proporciona al usuario un espacio para agregar muchos Widgets, como gráficos, mapas, tablas, textos y contadores, y puede crear conexiones entre ellos para:

source: Provide an overview to better visualize a specific data context
es: Proporcionar una descripción general para visualizar mejor un contexto de datos específico.

source: Interact spatially and analytically with the data by creating connections between widgets
es: Interactuar espacial y analíticamente con los datos creando conexiones entre widgets.

source: Perform analysis on involved data/layers
es: Realizar análisis de datos/capas involucradas

source: To build a new Dashboard go to :guilabel:`Add Resource` option on the *All Resources* page and choose option *Create dashboard* or select :guilabel:`New` option on the *Dashboards* page
es: Para crear un nuevo panel, ve a la opción :guilabel:`Agregar recurso` en la página *Todos los recursos* y elije la opción *Crear dashboard* o selecciona la opción :guilabel:`Nuevo` en la página *Dashboards*

source: *Create dashboard from All Resources page*
es: *Crear tablero desde la página Todos los recursos*

source: *Create dashboard from Dashboards page*
es: *Crear tablero desde la página Tableros*

source: Now you landed on the Dashboard edition page that is composed of the following sections:
es: Ahora has llegado a la página de edición del Tablero que se compone de las siguientes secciones:

source: *New Dashboard Apps option*
es: *Nueva opción de aplicaciones de tablero*

source: Further Reading
es: Otras lecturas

source: Follow the link below to get more detailed information about the usage of Dashboard.
es: Sigue el enlace a continuación para obtener información más detallada sobre el uso de Dashboard.

source: `Dashboard Documentation <https://mapstore.readthedocs.io/en/latest/user-guide/exploring-dashboards>`_
es: `Documentación del panel <https://mapstore.readthedocs.io/en/latest/user-guide/exploring-dashboards>`_
