Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/devel/api/usage/index.po
Languages: es

source: API usage examples
es: Ejemplos de uso de API

source: In this section, we are going to demostrate how GeoNode API can be utilized/integrated with other applications using Python.
es: En esta sección, demostraremos cómo se puede utilizar/integrar la API de GeoNode con otras aplicaciones que utilizan Python.

source: Resource Listing and Details
es: Listado de recursos y detalles

source: As mentioned in previous chapters, GeoNode resources are categorized in different types e.g. datasets, maps, documents. Etc. All available resources can be listed with API ``GET /api/v2/resources``.
es: Como se mencionó en capítulos anteriores, los recursos de GeoNode se clasifican en diferentes tipos, por ejemplo, conjuntos de datos, mapas, documentos, etc. Todos los recursos disponibles se pueden enumerar con la API ``GET /api/v2/resources``.

source: To obtain a single resource, a primary key is provided in the url. Eg ``GET /api/v2/resources/{resource.pk}``.
es: Para obtener un único recurso, se proporciona una clave principal en la URL. Por ejemplo, ``GET /api/v2/resources/{resource.pk}``.

source: Example Requests:
es: Ejemplos de solicitudes:

source: Listing
es: Listado

source: Detail
es: Detalle

source: The above requests work for publicly visible resources. If a resource is private either the Basic Auth or the Bearer token must be included inside the headers.
es: Las solicitudes anteriores funcionan para recursos visibles públicamente. Si un recurso es privado, se debe incluir el token de autenticación básica o de portador dentro de los encabezados.

source: Listing with basic auth:
es: Listado con autorización básica:

source: A token can be used in place of Basic Auth by setting ``'Authorization': 'Bearer <token>'``.
es: Se puede usar un token en lugar de la autenticación básica configurando ``'Authorization': 'Bearer <token>'``.

source: Resource Download
es: Descarga de recursos

source: The download URL for a resource can be obtained from ``resource.download_url``. This URL executes the synchronous download of a resource in its default download format (ESRI Shapefile for vector, Geotiff for rasters and the original format for documents). Additional export formats for datasets are available through the UI. At the moment the API doesn’t expose them.
es: La URL de descarga de un recurso se puede obtener desde ``resource.download_url``. Esta URL ejecuta la descarga sincrónica de un recurso en su formato de descarga predeterminado (ESRI Shapefile para vectores, Geotiff para rásteres y el formato original para documentos). Hay formatos de exportación adicionales para conjuntos de datos disponibles a través de la interfaz de usuario. Por el momento, la API no los expone.

source: Resource Links
es: Enlaces de recursos

source: From the resource detail response, URls and links to services can be obtained from the ``resource.links[]`` array value. The purpose of each link is defined by its ``link_type``. The “name” also can specify additional information about the linked resource.
es: Desde la respuesta del detalle del recurso, las URL y los enlaces a servicios se pueden obtener del valor de la matriz ``resource.links[]``. El propósito de cada enlace está definido por su ``link_type``. El "nombre" también puede especificar información adicional sobre el recurso vinculado.

source: Links to each metadata format can be obtained from links with ``link_type = "metadata"``
es: Los enlaces a cada formato de metadatos se pueden obtener desde los enlaces con ``link_type = "metadata"``

source: OGC services
es: Servicios OGC

source: OGC requests can be built by taking: the OGC base url from links from ``resource.links[]`` with ``"link_type"= ("OGC:WMS | OGC:WFS | OGC:WCS)`` the OGC service layername obtained from the ``resource.alternate`` property
es: Las solicitudes OGC se pueden crear tomando: la URL base de OGC de los enlaces de ``resource.links[]`` con ``"link_type"= ("OGC:WMS | OGC:WFS | OGC:WCS)`` el nombre de la capa de servicio OGC obtenido de la propiedad ``resource.alternate``

source: Embedding
es: Incrustar

source: A resource can be embedded inside a third party website. The “embed view” of a resource is suitable to be placed inside an iframe. The URL for the embedded view can be obtained from the ``resource.embed_url`` property.
es: Un recurso puede incrustarse dentro de un sitio web de terceros. La “vista incrustada” de un recurso es adecuada para colocarse dentro de un iframe. La URL de la vista incrustada se puede obtener de la propiedad ``resource.embed_url``.

source: Resource Searching and Filtering
es: Búsqueda y filtrado de recursos

source: GeoNode resources can be filtered with the following query parameters:
es: Los recursos de GeoNode se pueden filtrar con los siguientes parámetros de consulta:

source: Parameters
es: Parámetros

source: Examples:
es: Ejemplos:

source: Filter with a single value
es: Filtrar con un único valor

source: Filter with multiple values
es: Filtrar con múltiples valores

source: With filter APIs of format ``/api/v2/resources?filter{filter_key}=value``, additional methods(in and icontains) can be used on them to provide extensively filtered results. Eg ``/api/v2/resources?filter{regions.name.icontains}=global`` ``/api/v2/resources?filter{regions.name.in}=global``.
es: Con las API de filtro de formato ``/api/v2/resources?filter{filter_key}=value``, se pueden usar métodos adicionales (in e icontains) para proporcionar resultados filtrados de forma exhaustiva. Por ejemplo, ``/api/v2/resources?filter{regions.name.icontains}=global`` ``/api/v2/resources?filter{regions.name.in}=global``.

source: It's important to note that other methods are case sensitive except the icontains.
es: Es importante tener en cuenta que otros métodos distinguen entre mayúsculas y minúsculas, excepto los icontains.

source: Dataset specific resources
es: Recursos específicos del conjunto de datos

source: Get the metadata of uploaded datasets with:
es: Obtenga los metadatos de los conjuntos de datos cargados con:

source: Status Code: ``200``
es: Código de estado: ``200``

source: This is very similar to `GET /api/v2/resources` but provides additional metadata specifically for datasets like `featureinfo_custom_template` or `attribute_set`
es: Esto es muy similar a `GET /api/v2/resources` pero proporciona metadatos adicionales específicamente para conjuntos de datos como `featureinfo_custom_template` o `attribute_set`

source: Example:
es: Ejemplo:

source: Resource Upload
es: Carga de recursos

source: The API supports the upload of datasets and documents.
es: La API admite la carga de conjuntos de datos y documentos.

source: Datasets
es: Conjuntos de datos

source: The dataset upload form accepts file formats of ESRI Shapefile, GeoTIFF, Comma Separated Value (CSV), Zip Archive, XML Metadata File, and Styled Layer Descriptor (SLD). For a successful upload, the form requires base_file, dbf_file, shx_file, and prj_file. The xml_file, and Sld_file are optional.
es: El formulario de carga de conjuntos de datos acepta formatos de archivo ESRI Shapefile, GeoTIFF, Comma Separated Value (CSV), Zip Archive, XML Metadata File y Styled Layer Descriptor (SLD). Para una carga exitosa, el formulario requiere base_file, dbf_file, shx_file y prj_file. xml_file y Sld_file son opcionales.

source: Documents
es: Documentos

source: Documents can be uploaded as form data.
es: Los documentos se pueden cargar como datos de formulario.

source: Documents can also be created to reference remote resources. In this case the ``doc_url`` parameter must be used to set the URL of the remote document.
es: También se pueden crear documentos para hacer referencia a recursos remotos. En este caso, se debe utilizar el parámetro ``doc_url`` para establecer la URL del documento remoto.

source: Notice that if the URL doesn't end with a valid doc extension, the ``extension`` parameter must be used (e.g. ``extension: 'jpeg'``).
es: Tenga en cuenta que si la URL no termina con una extensión de documento válida, se debe utilizar el parámetro ``extension`` (por ejemplo, ``extension: 'jpeg'``).

source: Tracking dataset upload progress
es: Seguimiento del progreso de carga del conjunto de datos

source: When an upload request is executed, GeoNode creates an "Execution request" and keeps updating its state and progress (it’s a property attribute, calculated on getting the response) attributes as the resource is being created and configured in Geoserver. An execution can be in one of the following status:
es: Cuando se ejecuta una solicitud de carga, GeoNode crea una "Solicitud de ejecución" y continúa actualizando sus atributos de estado y progreso (es un atributo de propiedad, calculado al obtener la respuesta) a medida que el recurso se crea y configura en Geoserver. Una ejecución puede estar en uno de los siguientes estados:

source: When the dataset is successfully uploaded, the final state of the upload is set to ``finished``.
es: Cuando el conjunto de datos se carga correctamente, el estado final de la carga se establece como "finished".

source: In order to view status of the execution, the API method ``GET /api/v2/executionrequest/{execution_id}`` where ``{execution_id}`` is the value returned by the initial call to the upload API.
es: Para ver el estado de la ejecución, el método API ``GET /api/v2/executionrequest/{execution_id}`` donde ``{execution_id}`` es el valor devuelto por la llamada inicial a la API de carga.

source: The returned object contains, beyond all the information related to the execution, the inputs that were passed to the execution request, and output params specific to the type of execution. In the case of a dataset upload, the output params contain the URL of the catalog page for the new datast.
es: El objeto devuelto contiene, además de toda la información relacionada con la ejecución, los datos de entrada que se pasaron a la solicitud de ejecución y los parámetros de salida específicos del tipo de ejecución. En el caso de una carga de conjunto de datos, los parámetros de salida contienen la URL de la página del catálogo para el nuevo conjunto de datos.

source: You can also filter executions by status. Eg ``GET /api/v2/executionrequest?filter{action}=import&filter{source}=upload&filter{status}=finished``
es: También puedes filtrar las ejecuciones por estado. Por ejemplo, ``GET /api/v2/executionrequest?filter{action}=import&filter{source}=upload&filter{status}=finished``

source: Overwriting a dataset
es: Sobrescribir un conjunto de datos

source: Uploading a resource will create by default a new dataset. This behaviour can be changed by setting the ``overwrite_existing_layer`` parameter to ``True``. In this case the upload procedure will overwrite a resource whose name matches with the new one.
es: Al cargar un recurso se creará de forma predeterminada un nuevo conjunto de datos. Este comportamiento se puede cambiar configurando el parámetro ``overwrite_existing_layer`` en ``True``. En este caso, el procedimiento de carga sobrescribirá un recurso cuyo nombre coincida con el nuevo.

source: Skip existing dataset
es: Omitir el conjunto de datos existente

source: If the parameter ``skip_existing_layers`` is set to true ``True`` the uplad procedure will ignore files whose name matched with already existing resources.
es: Si el parámetro ``skip_existing_layers`` se establece en verdadero ``True`` el procedimiento uplad ignorará los archivos cuyo nombre coincida con recursos ya existentes.

source: Upload of a metadata file
es: Carga de un archivo de metadatos

source: A complete metadata file conforming to ISO-19115 can be uploaded for a dataset.
es: Se puede cargar un archivo de metadatos completo que cumpla con la norma ISO-19115 para un conjunto de datos.

source: Resource Delete
es: Eliminar recurso

source: Status Code: ``204``
es: Código de estado: ``204``

source: GeoNode offers a download option to resources of resource_type dataset and document. For datasets, the download option is available for only datasets with uploaded files.
es: GeoNode ofrece una opción de descarga para los recursos de tipo de recurso "dataset" y "documento". Para los conjuntos de datos, la opción de descarga solo está disponible para aquellos que tienen archivos cargados.

source: Dataset Update Metadata
es: Actualización de Metadatos del Conjunto de Datos

source: The following example changes the title and the license of a dataset.
es: El siguiente ejemplo cambia el título y la licencia de un conjunto de datos.

source: `bbox_polygon` and `ll_bbox_polygon` are derived values which cannot be changed.
es: `bbox_polygon` y `ll_bbox_polygon` son valores derivados que no se pueden cambiar.

source: Users, Groups and Permissions
es: Usuarios, grupos y permisos

source: Users
es: Usuarios

source: User detail
es: Detalle del usuario

source: Create a new user
es: Crear un nuevo usuario

source: Edit a User
es: Editar un usuario

source: Delete a User
es: Eliminar un usuario

source: In this case the list of validation rules configured in :ref:`user-deletion-rules` are checked before the deletion is executed.
es: En este caso, se comprueba la lista de reglas de validación configuradas en :ref:`user-deletion-rules` antes de ejecutar la eliminación.

source: List user groups
es: Lista de grupos de usuarios

source: Transfer resources owned by a user to another
es: Transferir recursos de propiedad de un usuario a otro

source: In this case the resources will be transfered to the user with id 1001, instead using the payload={"owner": "DEFAULT"} the resources will be transfered to the principal user
es: En este caso los recursos serán transferidos al usuario con id 1001, en lugar de utilizar el payload={"owner": "DEFAULT"} los recursos serán transferidos al usuario principal

source: Remove user as a group manager
es: Eliminar usuario como administrador de grupo

source: In this case the user shall be removed as a group manager from the following group ids, if the payload would be payload={"groups": "ALL"} the user will be removed as a group manager from all the groups its part of
es: En este caso, el usuario será eliminado como administrador de grupo de los siguientes ID de grupo; si la carga útil fuera payload={"groups": "ALL"}, el usuario será eliminado como administrador de grupo de todos los grupos de los que forma parte.

source: Groups
es: Grupos

source: In GeoNode, On listing groups, the api returns groups which have group profiles. Therefore for django groups which are not related to a group profile are not included in the response. However these can be accessed in the Django Administration panel.
es: En GeoNode, al listar grupos, la API devuelve grupos que tienen perfiles de grupo. Por lo tanto, para Django, los grupos que no están relacionados con un perfil de grupo no se incluyen en la respuesta. Sin embargo, se puede acceder a ellos en el panel de administración de Django.

source: Permissions
es: Permisos

source: Permissions in GeoNode are set per resource and per user or group. The following are general permissions that can be assigned:
es: Los permisos en GeoNode se configuran por recurso y por usuario o grupo. Los siguientes son permisos generales que se pueden asignar:

source: *View:* allows to view the resource. ``[view_resourcebase]``
es: *Ver:* permite ver el recurso. ``[view_resourcebase]``

source: *Download:* allows to download the resource specifically datasets and documents. ``[ view_resourcebase, download_resourcebase]``
es: *Descargar:* permite descargar recursos, específicamente conjuntos de datos y documentos. ``[ view_resourcebase, download_resourcebase]``

source: *Edit:* allows to change attributes, properties of the datasets features, styles and metadata for the specified resource. ``[view_resourcebase, download_resourcebase, change_resourcebase, change_dataset_style, change_dataset_data, change_resourcebase_metadata]``
es: *Editar:* permite cambiar atributos, propiedades de las características, estilos y metadatos de los conjuntos de datos para el recurso especificado. ``[view_resourcebase, download_resourcebase, change_resourcebase, change_dataset_style, change_dataset_data, change_resourcebase_metadata]``

source: *Manage:* allows to update, delete, change permissions, publish and unpublish the resource. ``[view_resourcebase, download_resourcebase, change_resourcebase, change_dataset_style, change_dataset_data, publish_resourcebase, delete_resourcebase, change_resourcebase_metadata, change_resourcebase_permissions]``
es: *Administrar:* permite actualizar, eliminar, cambiar permisos, publicar y anular la publicación del recurso. ``[view_resourcebase, download_resourcebase, change_resourcebase, change_dataset_style, change_dataset_data, publish_resourcebase, delete_resourcebase, change_resourcebase_metadata, change_resourcebase_permissions]``

source: Obtaining permissions on a resource
es: Obtención de permisos sobre un recurso

source: On listing the resources or on resource detail API, GeoNode includes perms attribute to each resource with a list of permissions a user making the request has on the respective resource.
es: Al enumerar los recursos o en la API de detalles de recursos, GeoNode incluye el atributo perms para cada recurso con una lista de permisos que tiene el usuario que realiza la solicitud sobre el recurso respectivo.

source: GeoNode also provides an API to get an overview of permissions set on a resource. The response contains users and groups with permissions set on them. However this API returns ``200`` if a requesting user has ``manage`` permissions on the resource otherwise it will return ``403 (Forbidden)``.
es: GeoNode también proporciona una API para obtener una descripción general de los permisos establecidos en un recurso. La respuesta contiene usuarios y grupos con permisos establecidos en ellos. Sin embargo, esta API devuelve "200" si un usuario solicitante tiene permisos de "administración" en el recurso; de lo contrario, devolverá "403 (Prohibido)".

source: Changing permissions on a resource
es: Cambiar los permisos de un recurso

source: Permissions are configured with a so called ``perms spec``, which is a JSON structured where permissions for single users and groups can be specified.
es: Los permisos se configuran con una denominada «especificación de permisos», que es una estructura JSON donde se pueden especificar permisos para usuarios individuales y grupos.

source: The example below shows a perm specification for following rules:
es: El siguiente ejemplo muestra una especificación de permiso para las siguientes reglas:

source: user1 can ``edit``
es: el user1 puede ``editar``

source: user2 can ``manage``
es: el user2 puede ``administrar``

source: group1 can ``edit``
es: el group1 puede ``editar``

source: anonymous users (public) can ``view``
es: los usuarios anónimos (públicos) pueden ``ver``

source: registered members can ``download``
es: los miembros registrados pueden ``descargar``

source: NOTE: The id of the “anonymous” and “registered members” groups can be obtained from the permissions of the resource. They are not listed inside the groups API, since these are spceial internal groups
es: NOTA: El id de los grupos “anónimos” y “miembros registrados” se puede obtener de los permisos del recurso. No se listan dentro de la API de grupos, ya que se trata de grupos internos especiales.

source: The perm spec is sent as JSON, with ``application/json Content-Type``, inside a ``PUT`` request.
es: La especificación permanente se envía como JSON, con el tipo de contenido ``application/json``, dentro de una solicitud ``PUT``.

source: This is an asynchrnous operation which returns a response similar to the following:
es: Esta es una operación asincrónica que devuelve una respuesta similar a la siguiente:

source: The ``status_url`` property returns the URL to track kthe progress of the request. Querying the URL a result similar to the following will be returned:
es: La propiedad ``status_url`` devuelve la URL para realizar un seguimiento del progreso de la solicitud. Al consultar la URL, se obtendrá un resultado similar al siguiente:

source: The operation will be completed once the ``status`` property is updated with the value ``finished``.
es: La operación se completará una vez que la propiedad ``status`` se actualice con el valor ``finished``.

source: Linked Resources Listing and Details
es: Listado y detalles de recursos vinculados

source: All available linked_resources can be listed with API ``GET /api/v2/resources/{pk}/linked_resources``. where pk Resource base id
es: Todos los recursos vinculados disponibles se pueden listar con la API mediante GET /api/v2/resources/{pk}/linked_resources. donde pk es el ID base del recurso.

source: List all resource links
es: Listar todos los enlaces de recursos
