Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_datasets/dataset_editing.po
Languages: es

source: Dataset Editing
es: Edición de conjuntos de datos

source: The :guilabel:`Edit` link in the menu of the *Dataset Page* opens a list of options like ones shown in the picture below.
es: El enlace :guilabel:`Edit` en el menú de la *Página del conjunto de datos* abre una lista de opciones como las que se muestran en la siguiente imagen.

source: *Dataset Editing Link*
es: *Enlace de edición del conjunto de datos*

source: In that options list, you can see three options listed as:
es: En esa lista de opciones, puedes ver tres opciones enumeradas como:

source: *Edit Data*
es: *Editar datos*

source: *Edit Styles*
es: *Editar estilos*

source: *Edit Metadata*
es: *Editar metadatos*

source: *Upload Style*
es: *Subir estilo*

source: *Upload Metadata*
es: *Subir metadatos*

source: In this section you will learn how to edit a *Dataset*, and its data. See :ref:`dataset-metadata` to learn how to explore the dataset *Metadata*, how to upload and edit them. The *Styles* will be covered in a dedicated section, see :ref:`dataset-style`.
es: En esta sección aprenderás cómo editar un *Conjunto de datos* y sus datos. Consulta :ref:`dataset-metadata` para aprender cómo explorar el conjunto de datos *Metadatos*, cómo cargarlos y editarlos. Los *Estilos* se cubrirán en una sección dedicada, consulte :ref:`dataset-style`.

source: Editing the Dataset Data
es: Editar los datos del conjunto de datos

source: The :guilabel:`Edit data` link of the *Dataset Editing* options opens the *Dataset* within a *Map*.
es: El enlace :guilabel:`Editar datos` de las opciones de *Edición de conjunto de datos* abre el *Conjunto de datos* dentro de un *Mapa*.

source: *Editing the Dataset Data*
es: *Edición de los datos del conjunto de datos*

source: The *Attribute Table* panel of the *Dataset* will automatically appear at the bottom of the *Map*. In that panel all the features are listed. For each feature you can zoom to its extent by clicking on the corresponding *magnifying glass* icon |magnifying_glass_icon| at the beginning of the row, you can also observe which values the feature assumes for each attribute.
es: El panel *Tabla de atributos* del *Conjunto de datos* aparecerá automáticamente en la parte inferior del *Mapa*. En ese panel se enumeran todas las características. Para cada característica, puedes hacer zoom en su extensión haciendo clic en el icono de *lupa* correspondiente |magnifying_glass_icon| Al principio de la fila, también puedes observar qué valores asume la característica para cada atributo.

source: Click the *Edit Mode* |edit_mode_button| button to start an editing session.
es: Haga clic en *Modo de edición* |edit_mode_button| para iniciar una sesión de edición.

source: Now you can:
es: Ahora podrás:

source: *Add new Features*
es: *Agregar nuevas características*

source: Through the *Add New Feature* button |add_new_feature_button| it is possible to set up a new feature for your dataset. Fill the attributes fields and click |save_changes_button| to save your change. Your new feature doesn't have a shape yet, click on |add_shape_to_geometry_button| to draw its shape directly on the *Map* then click on |save_changes_button| to save it.
es: A través del botón *Agregar nueva característica* |add_new_feature_button| es posible configurar una nueva función para su conjunto de datos. Completa los campos de atributos y haz clic en |save_changes_button| para guardar tu cambio. Tu nueva característica aún no tiene forma, haz clic en |add_shape_to_geometry_button| para dibujar su forma directamente en el *Mapa* y luego haz clic en |save_changes_button| para salvarlo.

source: When your new feature has a multi-vertex shape you have to double-click the last vertex to finish the drawing.
es: Cuando su nueva característica tiene una forma de múltiples vértices, debes hacer doble clic en el último vértice para finalizar el dibujo.

source: *Create New Feature*
es: *Crear nueva función*

source: *Delete Features*
es: *Eliminar funciones*

source: If you want to delete a feature you have to select it on the *Attribute Table* and click on |delete_feature_button|.
es: Si deseas eliminar una característica, debes seleccionarla en la *Tabla de atributos* y hacer clic en |delete_feature_button|.

source: *Change the Feature Shape*
es: *Cambiar la forma de la característica*

source: You can edit the shape of an existing geometry dragging its vertices with the mouse. A blue circle lets you know what vertex you are moving.
es: Puedes editar la forma de una geometría existente arrastrando sus vértices con el mouse. Un círculo azul te permite saber qué vértice estás moviendo.

source: Features can have *multipart shapes*. You can add parts to the shape when editing it.
es: Las entidades pueden tener *formas de varias partes*. Puedes agregar partes a la forma al editarla.

source: *Change the Feature Attributes*
es: *Cambiar los atributos de las funciones*

source: When you are in *Edit Mode* you can also edit the attributes values changing them directly in the corresponding text fields. You can achieve this by going into the edit mode and double click in the values.
es: Cuando estás en *Modo Edición* también puedes editar los valores de los atributos cambiándolos directamente en los campos de texto correspondientes. Puedes lograr esto ingresando al modo de edición y haciendo doble clic en los valores.

source: Once you have finished you can end the *Editing Session* by clicking on the |end_editing_session_button|.
es: Una vez que hayas terminado, puedes finalizar la *Sesión de edición* haciendo clic en el botón |end_editing_session_button|.

source: By default the GeoNode map viewer is `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ based, see the `MapStore Documentation <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/attributes-table/>`_ for further information.
es: De forma predeterminada, el visor de mapas GeoNode está basado en `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_; consulta la `Documentación de MapStore <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/attributes-table/>`_ para obtener más información.
