Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_datasets/dataset_styling.po
Languages: es

source: Dataset Styling
es: Estilo del conjunto de datos

source: Maps are helpful because they allow you gain a deeper understanding of your data by allowing you to visualize it in many different ways. So you can tell different stories depending on how the data is presented. For any given data or dataset, you should explore different styling options and choose the best style for that.
es: Los mapas son útiles porque le permiten obtener una comprensión más profunda de sus datos al permitirle visualizarlos de muchas maneras diferentes. De modo que puedes contar diferentes historias dependiendo de cómo se presenten los datos. Para cualquier dato o conjunto de datos determinado, debes explorar diferentes opciones de estilo y elegir el mejor estilo para ello.

source: In GeoNode each dataset has one style refered to as a *Default Style* which is determined by the nature of the data you're mapping. When uploading a new dataset (see :ref:`uploading-datasets`) a new default style will be associated to it.
es: En GeoNode, cada conjunto de datos tiene un estilo denominado *Estilo predeterminado* que está determinado por la naturaleza de los datos que está mapeando. Al cargar un nuevo conjunto de datos (ver :ref:`uploading-datasets`), se le asociará un nuevo estilo predeterminado.

source: Editing the Dataset Style
es: Editar el estilo del conjunto de datos

source: In order to edit a dataset style, open the *Dataset Page* (see :ref:`dataset-info`) and click on :guilabel:`Edit`. Then click the :guilabel:`Edit Style` link in the *options* (see the picture below).
es: Para editar un estilo de conjunto de datos, abre la *Página del conjunto de datos* (ver :ref:`dataset-info`) y haz clic en :guilabel:`Editar`. Luego haz clic en el enlace :guilabel:`Editar estilo` en las *opciones* (vea la imagen a continuación).

source: *Edit Styles button*
es: *Botón Editar estilos*

source: The *Dataset* will open in a new *Map*. The *Styles Panel* will show you all the default style for the dataset and some useful tools. By default, the style will be showm in a text editor form.
es: El *Conjunto de datos* se abrirá en un nuevo *Mapa*. El *Panel de estilos* te mostrará todos los estilos predeterminados para el conjunto de datos y algunas herramientas útiles. De forma predeterminada, el estilo se mostrará en un formulario de editor de texto.

source: *The Styles Panel in the Map*
es: *El Panel de Estilos en el Mapa*

source: You could continue to change the style with the text editor or switch to a visualized editor using the :guilabel:`Visual editor` above the text editor.
es: Puedes continuar cambiando el estilo con el editor de texto o cambiar a un editor visualizado usando :guilabel:`Editor visual` encima del editor de texto.

source: The visual editor looks like this
es: El editor visual se ve así

source: *Visual Styles Panel in the Map*
es: *Panel de estilos visuales en el mapa*

source: You can then edit the style by clicking on each attribute of the style.
es: Luego puedes editar el estilo haciendo clic en cada atributo del estilo.

source: Creating Style Rules
es: Crear reglas de estilo

source: In order to create a new rule, Three options are provided.
es: Para crear una nueva regla, se proporcionan tres opciones.

source: Mark rule
es: Regla de marca

source: Icon rule
es: Regla de icono

source: text rule
es: Regla de texto

source: Click on any of the buttons below to create a type of style you want.
es: Haz clic en cualquiera de los botones a continuación para crear el tipo de estilo que desee.

source: *Create new rule buttons*
es: *Crear nuevos botones de regla*

source: The rule you have chosen is now added on the top with default attributes which you can edit to your preference*.
es: La regla que ha elegido ahora se agrega en la parte superior con atributos predeterminados que puedes editar según tus preferencias*.

source: *New style*
es: *Nuevo estilo*

source: If the rule has errors, the following will be shown.
es: Si la regla tiene errores se mostrará lo siguiente.

source: *Rule Error*
es: *Error de regla*

source: You can switch the rule ordering by dragging it to the top or bottom depending on your preference.
es: Puedes cambiar el orden de las reglas arrastrándolas hacia la parte superior o inferior según sus preferencias.

source: It would be nice to change the style in order to decrease the opacity of the filling color as well as to reduce the lines width. The embedded `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ makes available a powerful *Style Editor* to accomplish that tasks. In the next paragraph we will explain how.
es: Sería bueno cambiar el estilo para disminuir la opacidad del color de relleno y reducir el ancho de las líneas. El `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ integrado pone a disposición un potente *Editor de estilos* para realizar esas tareas. En el siguiente párrafo explicaremos cómo.

source: Each rule has a delete icon on the top right which you can use to remove the rule on the style.
es: Cada regla tiene un ícono de eliminación en la parte superior derecha que puedes usar para eliminar la regla del estilo.

source: Click on :guilabel:`Save` on the top to save your changes.
es: Haz clic en :guilabel:`Guardar` en la parte superior para guardar los cambios.
