Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_datasets/dataset_metadata.po
Languages: es

source: Datasets Metadata
es: Metadatos de conjuntos de datos

source: In GeoNode special importance is given to *Metadata* and their standard formats.
es: En GeoNode se da especial importancia a los *Metadatos* y sus formatos estándar.

source: Editing Metadata
es: Edición de metadatos

source: Metadata contains all the information related to the dataset. They provide essential information for its identification and its comprehension. Metadata also make the dataset more easily retrievable through search by other users.
es: Los metadatos contienen toda la información relacionada con el conjunto de datos. Proporcionan información esencial para su identificación y su comprensión. Los metadatos también hacen que el conjunto de datos sea más fácil de recuperar mediante búsquedas por parte de otros usuarios.

source: The *Metadata* of a dataset can be changed through a *Edit Metadata* form which involves four steps, one for each type of metadata considered:
es: Los *Metadatos* de un conjunto de datos se pueden cambiar a través de un formulario de *Editar Metadatos* que involucra cuatro pasos, uno para cada tipo de metadatos considerado:

source: You can open the *Metadata* form of a *Dataset* by clicking the :guilabel:`Edit Metadata` link from the :guilabel:`Edit` options on the *Dataset Page*.
es: Puede abrir el formulario *Metadatos* de un *Conjunto de datos* haciendo clic en el enlace :guilabel:`Editar metadatos` desde las opciones :guilabel:`Editar` en la *Página del conjunto de datos*.

source: **Basic Metadata**
es: **Metadatos básicos**

source: The first two steps are mandatory (no datasets will be published if the required information are not provided) whereas the last two are optional.
es: Los dos primeros pasos son obligatorios (no se publicará ningún conjunto de datos si no se proporciona la información requerida), mientras que los dos últimos son opcionales.

source: *Basic Dataset Metadata*
es: *Metadatos del conjunto de datos básicos*

source: In the first step the system asks you to insert the following metadata:
es: En el primer paso el sistema le pide que inserte los siguientes metadatos:

source: *Thumbnail* of the dataset (click :guilabel:`Edit` to change it);
es: *Miniatura* del conjunto de datos (haga clic en :guilabel:`Editar` para cambiarlo);

source: *Title* of the dataset, which should be clear and understandable;
es: *Título* del conjunto de datos, que debe ser claro y comprensible;

source: *Abstract*; brief narrative summary of the content of the dataset
es: *Abstracto*; breve resumen narrativo del contenido del conjunto de datos

source: The *Abstract* panel allows you to insert HTML code through a *wysiwyg* text editor
es: El panel *Resumen* le permite insertar código HTML a través de un editor de texto *wysiwyg*

source: *Creation/Publication/Revision Dates* which define the time period that is covered by the dataset;
es: *Fechas de creación/publicación/revisión* que definen el período de tiempo que cubre el conjunto de datos;

source: *Keywords*, which should be chosen within the available list. The contributor search for available keywords by clicking on the searching bar, or on the folder logo representing, or by entering the first letters of the desired word;
es: *Palabras clave*, que se deben elegir dentro de la lista disponible. El colaborador busca palabras clave disponibles haciendo clic en la barra de búsqueda, o en el logotipo de la carpeta que representa, o ingresando las primeras letras de la palabra deseada;

source: *Category* which the dataset belongs to;
es: *Categoría* a la que pertenece el conjunto de datos;

source: *Group* which the dataset is linked to.
es: *Grupo* al que está vinculado el conjunto de datos.

source: **Location and Licenses**
es: **Ubicación y Licencias**

source: *Location and Licenses Metadata for Datasets*
es: *Metadatos de ubicación y licencias para conjuntos de datos*

source: The following list shows what kinds of metadata you are required to enter (see also the picture below):
es: La siguiente lista muestra qué tipos de metadatos debes ingresar (consulta también la imagen a continuación):

source: *Language* of the dataset;
es: *Idioma* del conjunto de datos;

source: *License* of the dataset;
es: *Licencia* del conjunto de datos;

source: *DOI* of the dataset; if available, this represents the `Digital Object Identifier <https://www.doi.org/>`_ of the resource
es: *DOI* del conjunto de datos; si está disponible, esto representa el `Identificador de objeto digital <https://www.doi.org/>`_ del recurso

source: *Attribution* of the dataset; authority or function assigned, as to a ruler, legislative assembly, delegate, or the like
es: *Atribución* del conjunto de datos; autoridad o función asignada, como gobernante, asamblea legislativa, delegado o similar

source: *Regions*, which informs on the spatial extent covered by the dataset. Proposed extents cover the following scales: global, continental, regional, national;
es: * Regiones *, que informa sobre la extensión espacial cubierta por el conjunto de datos. Los alcances propuestos cubren las siguientes escalas: global, continental, regional, nacional;

source: *Data Quality statement* (general explanation of the data producer's knowledge about the lineage of a dataset);
es: *Declaración de calidad de los datos* (explicación general del conocimiento del productor de datos sobre el linaje de un conjunto de datos);

source: Potential *Restrictions* on dataset sharing.
es: Posibles *Restricciones* al compartir conjuntos de datos.

source: The *Data Quality statement* and *Restrictions* panels allow you to insert HTML code through a *wysiwyg* text editor
es: Los paneles *Declaración de calidad de datos* y *Restricciones* te permiten insertar código HTML a través de un editor de texto *wysiwyg*

source: **Optional Metadata**
es: **Metadatos opcionales**

source: *Optional Dtaset Metadata*
es: *Metadatos de conjunto de datos opcionales*

source: Complementary information are:
es: La información complementaria es:

source: *Edition* to indicate the reference or the source of the dataset;
es: *Edición* para indicar la referencia o la fuente del conjunto de datos;

source: *Purpose* of the dataset and its objectives;
es: *Propósito* del conjunto de datos y sus objetivos;

source: *Supplemental information* that can provide a better understanding of the uploaded dataset;
es: *Información complementaria* que puede proporcionar una mejor comprensión del conjunto de datos cargado;

source: *Maintenance frequency* of the dataset;
es: *Frecuencia de mantenimiento* del conjunto de datos;

source: users who are *Responsible* for the dataset, its *Owner*, and the *Author* of its metadata;
es: usuarios que son *Responsables* del conjunto de datos, su *Propietario* y el *Autor* de sus metadatos;

source: *Spatial representation type* used.
es: *Tipo de representación espacial* utilizado.

source: *Related resources* to link one or multiple resources to the document. These will be visible inside the :ref:`dataset-info` panel
es: *Recursos relacionados* para vincular uno o varios recursos al documento. Estos serán visibles dentro del panel :ref:`dataset-info`

source: The *Purpose* and *Supplemental information* panels allow you to insert HTML code through a *wysiwyg* text editor
es: Los paneles *Propósito* e *Información complementaria* le permiten insertar código HTML a través de un editor de texto *wysiwyg*

source: **Dataset Attributes**
es: **Atributos del conjunto de datos**

source: *Dataset Attributes Metadata for Dataset*
es: *Metadatos de Atributos de Conjuntos de Datos para Conjuntos de Datos*

source: At this step you can enrich the dataset attributes with useful information like the following:
es: En este paso puedes enriquecer los atributos del conjunto de datos con información útil como la siguiente:

source: The *Label* displayed
es: La *Etiqueta* mostrada

source: A detailed *Description*
es: Una *Descripción detallada*

source: The *Display Order*
es: El *Orden de visualización*

source: The *Display Type*; the default value is *Label*, which means that the value of the attribute will be rendered as a plain text. There's the possibility to instruct GeoNode to threat the values as different media-types. As an instance, if the values of the selected attribute will contain image urls, by selecting the ``IMAGE`` *Display Type* you will allow GeoNode to render the image directly when querying the dataset from the maps. The same for ``VIDEO``, ``AUDIO`` or ``IFRAME`` mime types.
es: El *Tipo de visualización*; el valor predeterminado es *Etiqueta*, lo que significa que el valor del atributo se mostrará como texto plano. Existe la posibilidad de instruir a GeoNode para tratar los valores como diferentes tipos de medios. Por ejemplo, si los valores del atributo seleccionado contienen URLs de imágenes, al seleccionar el tipo de visualización ``IMAGEN``, permitirás que GeoNode muestre la imagen directamente al consultar el conjunto de datos desde los mapas. Lo mismo aplica para los tipos mime ``VIDEO``, ``AUDIO`` o ``IFRAME``.

source: The *Visibile* flag; allows you to instruct GeoNode wether or not hiding an attribute from the *Get Feature Type* outcomes
es: El indicador *Visible*; te permite instruir a GeoNode si ocultar o no un atributo en los resultados de *Obtener tipo de característica*

source: It is possible to define a completely custom ``HTML`` template for the *Get Feature Type* outcome. That is possible by enabling the *Use a custom template* flag as shown in the figure below.
es: Es posible definir una plantilla ``HTML`` completamente personalizada para el resultado *Obtener tipo de característica*. Esto es posible habilitando la opción *Usar una plantilla personalizada* como se muestra en la siguiente figura.

source: *Use a custom template*
es: *Utilice una plantilla personalizada*

source: By using the keywork ``${properties.<attribute_name>``, you can tell to GeoNode to render the actual value of the attribute on the map.
es: Al utilizar la función de clave ``${properties.<attribute_name>``, puedes indicarle a GeoNode que represente el valor real del atributo en el mapa.

source: As an instance, the example below
es: Por ejemplo, el siguiente ejemplo

source: *Use a custom template: HTML*
es: *Utilice una plantilla personalizada: HTML*

source: Will render an ``HTML Table`` along with values as shown here below
es: Representará una ``Tabla HTML`` junto con los valores como se muestra a continuación

source: *Use a custom template: Get Feature Info outcome*
es: *Utilice una plantilla personalizada: obtenga el resultado de información de funciones*

source: Use :guilabel:`next >>` or :guilabel:`<< back` to navigate through those steps. Once you have finished click on :guilabel:`Update`.
es: Utiliza :guilabel:`siguiente >>` o :guilabel:`<< atrás` para navegar por esos pasos. Una vez hayas terminado pulsa en :guilabel:`Actualizar`.

source: Some metadata are mandatory, if you miss any of that metadata the *Completeness* bar shows you a red message like the one in the picture below.
es: Algunos metadatos son obligatorios; si omites alguno de esos metadatos, la barra *Integridad* le muestra un mensaje rojo como el de la imagen a continuación.

source: *Completeness Progress Bar*
es: *Barra de progreso de integridad*

source: Metadata Advanced Editing
es: Edición avanzada de metadatos

source: In the *Edit Metadata* page the :guilabel:`Advanced Metadata` button is also available.
es: En la página *Editar Metadatos* también está disponible el botón :guilabel:`Metadatos Avanzados`.

source: *The Advanced Metadata button*
es: *El botón Metadatos avanzados*

source: Click on it to display the *Metadata Advanced Editing Page*. That page allows you to edit all the dataset metadata described in the previous paragraph. Once you have finished to edit them click on :guilabel:`Update` to save your changes.
es: Haz clic en él para mostrar la *Página de edición avanzada de metadatos*. Esa página te permite editar todos los metadatos del conjunto de datos descritos en el párrafo anterior. Una vez que hayas terminado de editarlos haz clic en :guilabel:`Actualizar` para guardar los cambios.
