Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_datasets/dataset_permissions.po
Languages: es

source: Share Options
es: Opciones para compartir

source: In order to modify the Dataset *Share options* settings, on the detail page of the dataset click the :guilabel:`Share` link in the :guilabel:`Resource` menu. By default only owners can edit and manage datasets, anyone can view them.
es: Para modificar la configuración de *Opciones para compartir* del conjunto de datos, en la página de detalles del conjunto de datos, haz clic en el enlace :guilabel:`Compartir` en el menú :guilabel:`Recursos`. De forma predeterminada, solo los propietarios pueden editar y administrar conjuntos de datos; cualquiera puede verlos.

source: *Change Dataset Share options*
es: *Cambiar opciones para compartir conjunto de datos*

source: Through the *Share options Settings Panel* you can add or remove options for users and groups. The picture below shows an example.
es: A través del *Panel de configuración de opciones para compartir* puedes agregar o eliminar opciones para usuarios y grupos. La siguiente imagen muestra un ejemplo.

source: *Dataset Share options settings for users and groups*
es: *Configuración de opciones de compartir conjunto de datos para usuarios y grupos*

source: You can set the following share options:
es: Puedes configurar las siguientes opciones para compartir:

source: *View* (allows to view the dataset).
es: *Ver* (permite ver el conjunto de datos).

source: *Download* (allows to view and download the dataset).
es: *Descargar* (permite ver y descargar el conjunto de datos).

source: *Edit* (allows to change the dataset metadata,change attributes and properties of the datasets features and change the dataset style).
es: *Editar* (permite cambiar los metadatos del conjunto de datos, cambiar los atributos y propiedades de las características del conjunto de datos y cambiar el estilo del conjunto de datos).

source: *Manage* (allows to update, delete, change share options, publish and unpublish the dataset).
es: *Administrar* (permite actualizar, eliminar, cambiar opciones para compartir, publicar y despublicar el conjunto de datos).

source: When assigning options to a group, all the group members will have those options. Be careful in case of editing them.
es: Al asignar opciones a un grupo, todos los miembros del grupo tendrán esas opciones. Ten cuidado en caso de editarlos.

source: Click on :guilabel:`Save` link in the menu to save these settings.
es: Haz clic en el enlace :guilabel:`Guardar` en el menú para guardar esta configuración.
