Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_datasets/new_dataset_from_scratch.po
Languages: es

source: Creating a Dataset from scratch
es: Creando un conjunto de datos desde cero

source: An interesting tool that GeoNode makes available to you is the *Create dataset*. It allows you to create a new vector dataset from scratch. The *Dataset Creation Form* is reachable through the :guilabel:`Create dataset` link shown in the picture below.
es: Una herramienta interesante que GeoNode pone a tu disposición es la de *Crear conjunto de datos*. Te permite crear un nuevo conjunto de datos vectoriales desde cero. Se puede acceder al *Formulario de creación de conjunto de datos* a través del enlace :guilabel:`Crear conjunto de datos` que se muestra en la siguiente imagen.

source: *Create dataset link*
es: *Crear enlace de conjunto de datos*

source: In order to create the new Dataset you have to fill out the required fields:
es: Para crear el nuevo conjunto de datos debes completar los campos obligatorios:

source: *Name*
es: *Nombre*

source: *Title*
es: *Título*

source: *Geometry type*
es: *Tipo de geometría*

source: *Geometry types*
es: *Tipos de geometría*

source: Usually the datasets features should have some *Attributes* that enrich the amount of information associated with each of them. Through the :guilabel:`Add Attribute` button you can add new attributes.
es: Normalmente las características de los conjuntos de datos deben tener algunos *Atributos* que enriquezcan la cantidad de información asociada a cada uno de ellos. A través del botón :guilabel:`Añadir Atributo` podrás añadir nuevos atributos.

source: *New Dataset creation from scratch*
es: *Creación de nuevo conjunto de datos desde cero*

source: Once the form has been filled out, click on :guilabel:`Create`. You will be redirected to the *Dataset Page* (see :ref:`dataset-info`). Now your Dataset is created but is still empty, no features have been added yet. See the :ref:`dataset-editing` section to learn how to add new features.
es: Una vez rellenado el formulario pulsa en :guilabel:`Crear`. Serás redirigido a la *Página del conjunto de datos* (ver :ref:`dataset-info`). Ahora tu conjunto de datos está creado pero aún está vacío, aún no se han agregado funciones. Consulta la sección :ref:`dataset-editing` para aprender cómo agregar nuevas funciones.
