Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_datasets/uploading_datasets.po
Languages: es

source: Datasets Uploading
es: Carga de conjuntos de datos

source: The most important resource type in GeoNode is the *Dataset*. A dataset represents spatial information so it can be displayed inside a map.
es: El tipo de recurso más importante en GeoNode es el *Conjunto de datos*. Un conjunto de datos representa información espacial para que pueda mostrarse dentro de un mapa.

source: To better understand what we are talking about lets upload your first dataset.
es: Para comprender mejor de qué estamos hablando, carguemos tu primer conjunto de datos.

source: It is possible to upload a *Datasets* in two ways:
es: Es posible cargar un *Conjunto de datos* de dos maneras:

source: From the :guilabel:`All Resources` page, by clicking *Add Resource* which displays a list including `Upload dataset` link:
es: Desde la página :guilabel:`Todos los recursos`, al hacer clic en *Agregar recurso*, se muestra una lista que incluye el enlace `Cargar conjunto de datos`:

source: *Dataset Upload from All Resources page*
es: *Carga de conjunto de datos desde la página Todos los recursos*

source: From the :guilabel:`Datasets` page, by clicking on *New* which displays a list including `Upload dataset` link:
es: Desde la página :guilabel:`Conjuntos de datos`, haciendo clic en *Nuevo* que muestra una lista que incluye el enlace `Cargar conjunto de datos`:

source: *Dataset Upload from Datasets page*
es: *Carga de conjunto de datos desde la página Conjuntos de datos*

source: The *Datasets Uploading* page looks like the one in the picture below.
es: La página *Carga de conjuntos de datos* se parece a la de la imagen siguiente.

source: *The Datasets Uploading page*
es: *La página de carga de conjuntos de datos*

source: Through the :guilabel:`Select files` button you can select files from your disk, make sure they are valid raster or vector spatial data, then you can click to :guilabel:`Upload` button.
es: A través del botón :guilabel:`Seleccionar archivos` puedes seleccionar archivos de tu disco, asegurarse de que sean datos espaciales rasterizados o vectoriales válidos, luego puedes hacer clic en el botón :guilabel:`Cargar`.

source: A progress bar shows the operation made during the dataset upload and alerts you when the process is over.
es: Una barra de progreso muestra la operación realizada durante la carga del conjunto de datos y te avisa cuando finaliza el proceso.

source: *Upload dataset*
es: *Subir conjunto de datos*

source: In this example the ``ne_10m_airports2`` ESRI Shapefile, with all its mandatory files (`.shp`, `.shx`, `.dbf` and `.prj`), has been chosen. When the process ends click on :guilabel:`View` button
es: En este ejemplo se ha elegido el ``ne_10m_airports2`` ESRI Shapefile, con todos sus archivos obligatorios (`.shp`, `.shx`, `.dbf` y `.prj`). Cuando finalice el proceso haz clic en el botón :guilabel:`Ver`

source: *Dataset uploading finished*
es: *Carga del conjunto de datos finalizada*

source: There are lot of free spatial dataset available in the Internet. In this example, an extract of the Berlin city center roads map from the `BBBike extracts OpenStreetMap <https://extract.bbbike.org>`_ dataset has been used.
es: Hay muchos conjuntos de datos espaciales gratuitos disponibles en Internet. En este ejemplo, se ha utilizado un extracto del mapa de carreteras del centro de la ciudad de Berlín del conjunto de datos `BBBike extracts OpenStreetMap <https://extract.bbbike.org>`_.

source: In the next paragraphs you will learn how to create a dataset from scratch, how to set share options, how to explore the dataset properties and how to edit them.
es: En los siguientes párrafos aprenderás cómo crear un conjunto de datos desde cero, cómo configurar opciones para compartir, cómo explorar las propiedades del conjunto de datos y cómo editarlas.

source: If you get the following error message:
es: Si recibes el siguiente mensaje de error:

source: ``Total upload size exceeds 100.0 MB. Please try again with smaller files.``
es: ``El tamaño total de carga supera los 100,0 MB. Inténtelo de nuevo con archivos más pequeños.``

source: This means that there is an upload size limit of 100 MB. An user with administrative access can change the upload size limits at the `admin panel for size limits <../../admin/upload-size-limits/index.html#upload-size-limits>`__.
es: Esto significa que hay un límite de tamaño de carga de 100 MB. Un usuario con acceso administrativo puede cambiar los límites de tamaño de carga en el `panel de administración para límites de tamaño <../../admin/upload-size-limits/index.html#upload-size-limits>`__.

source: Similarly, for the following error message:
es: De manera similar, para el siguiente mensaje de error:

source: ``The number of active parallel uploads exceeds 5. Wait for the pending ones to finish.``
es: ``El número de cargas paralelas activas supera las 5. Espere a que finalicen las pendientes.``

source: You can modify the upload parallelism limits at the `admin panel for parallelism limits <../../admin/upload-parallelism-limit/index.html#upload-parallelism-limits>`__.
es: Puede modificar los límites de paralelismo de carga en el `panel de administración para límites de paralelismo <../../admin/upload-parallelism-limit/index.html#upload-parallelism-limits>`__.
