Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/data/data_types.po
Languages: es

source: Data Types
es: Tipos de datos

source: GeoNode welcome page shows a variety of information about the current GeoNode instance.
es: La página de bienvenida de GeoNode muestra una variedad de información sobre la instancia actual de GeoNode.

source: You can explore the existing data using many search tools and filters (see :ref:`finding-data`) or through the links of the navigation bar at the top of the page.
es: Puedes explorar los datos existentes utilizando muchas herramientas de búsqueda y filtros (ver :ref:`finding-data`) o mediante los enlaces de la barra de navegación en la parte superior de la página.

source: There are five main types of resources that GeoNode can manage:
es: Hay cinco tipos principales de recursos que GeoNode puede gestionar:

source: Datasets
es: Conjuntos de datos

source: Maps
es: Mapas

source: Documents
es: Documentos

source: GeoStories
es: GeoHistorias

source: Dashboards
es: Paneles de control

source: Each resource type has its own menu and can be reached through :guilabel:`Datasets`, :guilabel:`Maps`, :guilabel:`Documents`, :guilabel:`GeoStories` and :guilabel:`Dashboards` buttons on the navigation bar
es: Cada tipo de recurso tiene su propio menú y se puede acceder a él a través de los botones :guilabel:`Datos`, :guilabel:`Mapas`, :guilabel:`Documentos`, :guilabel:`GeoStories` y :guilabel:`Dashboards` en la barra de navegación.

source: :guilabel:`GeoStories` and :guilabel:`Dashboards` In the screenshot below are GeoApp resouce types which are added by the client.
es: :guilabel:`GeoStories` y :guilabel:`Dashboards` en la captura de pantalla a continuación son tipos de recursos GeoApp que han sido añadidos por el cliente.

source: *Data menu*
es: *Menú de datos*

source: Datasets are a primary component of GeoNode.
es: Los conjuntos de datos son un componente principal de GeoNode.

source: Datasets are publishable resources representing a raster or vector spatial data source. Datasets also can be associated with metadata, ratings, and comments.
es: Los conjuntos de datos son recursos publicables que representan una fuente de datos espaciales vectoriales o ráster. Los conjuntos de datos también se pueden asociar con metadatos, calificaciones y comentarios.

source: By clicking the Datasets link you will get a list of all published datasets. If logged in as an administrator, you will also see the unpublished datasets in the same list.
es: Al hacer clic en el enlace Conjuntos de datos, obtendrá una lista de todos los conjuntos de datos publicados. Si inició sesión como administrador, también verá los conjuntos de datos no publicados en la misma lista.

source: GeoNode allows the user to upload vector and raster data in their original projections using a web form.
es: GeoNode permite al usuario cargar datos vectoriales y ráster en sus proyecciones originales mediante un formulario web.

source: Vector data can be uploaded in many different formats (ESRI Shapefile, KML and so on...). Satellite imagery and other kinds of raster data can be uploaded as GeoTIFFs.
es: Los datos vectoriales se pueden cargar en muchos formatos diferentes (ESRI Shapefile, KML, etc.). Las imágenes satelitales y otros tipos de datos ráster se pueden cargar como GeoTIFF.

source: Maps are a primary component of GeoNode.
es: Los mapas son un componente principal de GeoNode.

source: Maps are comprised of various datasets and their styles. Datasets can be both local datasets in GeoNode as well as remote datasets either served from other WMS servers or by web service datasets such as Google or MapQuest.
es: Los mapas se componen de varios conjuntos de datos y sus estilos. Los conjuntos de datos pueden ser tanto conjuntos de datos locales en GeoNode como conjuntos de datos remotos servidos desde otros servidores WMS o mediante conjuntos de datos de servicios web como Google o MapQuest.

source: GeoNode maps also contain other information such as map zoom and extent, dataset ordering, and style.
es: Los mapas de GeoNode también contienen otra información, como el zoom y la extensión del mapa, el orden y el estilo del conjunto de datos.

source: You can create a map based on uploaded datasets, combine them with some existing datasets and a remote web service dataset, share the resulting map for public viewing. Once the data has been uploaded, GeoNode lets the user search for it geographically or via keywords and create maps. All the datasets are automatically reprojected to web mercator for maps display, making it possible to use popular base maps such as `OpenStreetMap <https://www.openstreetmap.org>`_.
es: Puede crear un mapa basado en conjuntos de datos cargados, combinarlos con algunos conjuntos de datos existentes y un conjunto de datos de servicio web remoto y compartir el mapa resultante para que lo vea el público. Una vez cargados los datos, GeoNode permite al usuario buscarlos geográficamente o mediante palabras clave y crear mapas. Todos los conjuntos de datos se reproyectan automáticamente en web mercator para la visualización de mapas, lo que permite utilizar mapas base populares como `OpenStreetMap <https://www.openstreetmap.org>`_.

source: GeoNode allows to publish tabular and text data and to manage metadata and associated documents.
es: GeoNode permite publicar datos tabulares y textuales, así como gestionar metadatos y documentos asociados.

source: Documents can be uploaded directly from your disk (see :ref:`uploading-documents` for further information).
es: Los documentos se pueden cargar directamente desde su disco (consulte :ref:`uploading-documents` para obtener más información).

source: The following documents types are allowed: `txt, .log, .doc, .docx, .ods, .odt, .sld, .qml, .xls, .xlsx, .xml, .bm, .bmp, .dwg, .dxf, .fif, .gif, .jpg, .jpe, .jpeg, .png, .tif, .tiff, .pbm, .odp, .ppt, .pptx, .pdf, .tar, .tgz, .rar, .gz, .7z, .zip, .aif, .aifc, .aiff, .au, .mp3, .mpga, .wav, .afl, .avi, .avs, .fli, .mp2, .mp4, .mpg, .ogg, .webm, .3gp, .flv, .vdo, .glb, .pcd, .gltf`.
es: Se permiten los siguientes tipos de documentos: `txt, .log, .doc, .docx, .ods, .odt, .sld, .qml, .xls, .xlsx, .xml, .bm, .bmp, .dwg, . dxf, .fif, .gif, .jpg, .jpe, .jpeg, .png, .tif, .tiff, .pbm, .odp, .ppt, .pptx, .pdf, .tar, .tgz, .rar, .gz, .7z, .zip, .aif, .aifc, .aiff, .au, .mp3, .mpga, .wav, .afl, .avi, .avs, .fli, .mp2, .mp4, .mpg , .ogg, .webm, .3gp, .flv, .vdo, .glb, .pcd, .gltf`.

source: Through the document detailed page is possible to view, download and manage a document.
es: A través de la página detallada del documento es posible visualizar, descargar y gestionar un documento.

source: GeoStory is a MapStore tool integrated in GeoNode that provides the user a way to create inspiring and immersive stories by combining text, interactive maps, and other multimedia content like images and video or other third party contents. Through this tool you can simply tell your stories on the web and then publish and share them with different groups of GeoNode users or make them public to everyone around the world.
es: GeoStory es una herramienta de MapStore integrada en GeoNode que proporciona al usuario una forma de crear historias inspiradoras e inmersivas combinando texto, mapas interactivos y otros contenidos multimedia, como imágenes y videos, o contenidos de terceros. A través de esta herramienta, puedes contar tus historias en la web de manera sencilla y luego publicarlas y compartirlas con diferentes grupos de usuarios de GeoNode o hacerlas públicas para que todo el mundo las vea.

source: Dashboard is a MapStore tool integrated in GeoNode that provides the user with a space to add many Widgets, such as charts, maps, tables, texts and counters, and can create connections between them in order to:
es: Dashboard es una herramienta de MapStore integrada en GeoNode que proporciona al usuario un espacio para agregar muchos widgets, como gráficos, mapas, tablas, textos y contadores, y puede crear conexiones entre ellos para:

source: - Provide an overview to better visualize a specific data context
es: - Proporcionar una descripción general para visualizar mejor un contexto de datos específico.

source: - Interact spatially and analytically with the data by creating connections between widgets
es: - Interactuar espacial y analíticamente con los datos creando conexiones entre widgets

source: - Perform analysis on involved data/layers
es: - Realizar análisis de datos/capas involucradas.
