Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/data/finding_data.po
Languages: es

source: Finding Data
es: Encontrar datos

source: This section will guide you to navigate GeoNode to find datasets, maps and documents and other resource types by using different routes, filters and search functions.
es: Esta sección lo guiará para navegar por GeoNode para encontrar conjuntos de datos, mapas, documentos y otros tipos de recursos mediante el uso de diferentes rutas, filtros y funciones de búsqueda.

source: On every page you can find some quick search tool.
es: En cada página podrás encontrar alguna herramienta de búsqueda rápida.

source: The *Search* box in the navigation bar (see the picture below) let you type a text and find all the resource which have to deal with that text.
es: El cuadro *Buscar* en la barra de navegación (ver la imagen a continuación) te permite escribir un texto y encontrar todos los recursos que tienen que ver con ese texto.

source: *Search tool in GeoNode welcome page*
es: *Herramienta de búsqueda en la página de bienvenida de GeoNode*

source: When you trigger a search you are brought to the *Search* page which shows you the search result through all data types.
es: Cuando activas una búsqueda, accedes a la página *Buscar* que muestra el resultado de la búsqueda en todos los tipos de datos.

source: *The Search page*
es: *La página de búsqueda*

source: This page contains a wealth of options for customizing a search for various information on GeoNode. This search form allows for much more fine-tuned searches than the simple search box is available at the top of every page.
es: Esta página contiene una gran cantidad de opciones para personalizar la búsqueda de información diversa en GeoNode. Este formulario de búsqueda permite realizar búsquedas mucho más precisas que el simple cuadro de búsqueda disponible en la parte superior de cada página.

source: It is possible to search and filter data by Text, Types, Categories, Keywords, Owners, Regions, Group, Limitations on public access, Date and Extent.
es: Es posible buscar y filtrar datos por Texto, Tipos, Categorías, Palabras clave, Propietarios, Regiones, Grupo, Limitaciones de acceso público, Fecha y Extensión.

source: Try to set some filter and see how the resulting data list changes accordingly. An interesting type of filter is *EXTENT*: you can apply a spatial filter by moving or zooming a map within a box as shown in the picture below.
es: Intenta establecer algún filtro y ve cómo la lista de datos resultante cambia en consecuencia. Un tipo interesante de filtro es *EXTENSIÓN*: puedes aplicar un filtro espacial moviendo o haciendo zoom en un mapa dentro de un cuadro como se muestra en la imagen siguiente.

source: *Search filter by EXTENT*
es: *Filtro de búsqueda por EXTENSIÓN*

source: Data can be ordered by Most recent, Less recent, Name and Popularity.
es: Los datos se pueden ordenar por Más recientes, Menos recientes, Nombre y Popularidad.

source: *Ordering Link*
es: *Enlace de pedido*

source: *Ordering Data*
es: *Datos de pedido*

source: For *Users* see :ref:`user-info`.
es: Para *Usuarios* consulte :ref:`user-info`.
