Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/accounts_user_profile/updating_profile/index.po
Languages: es

source: Updating the Profile
es: Actualizando el perfil

source: Once having an account you can enrich your profile with useful information, you can also edit or delete the existing ones. You can connect the account with your social network, associate many e-mail addresses to it and manage many options such as preferences about notifications.
es: Una vez que tengas una cuenta podrás enriquecer tu perfil con información útil, también podrás editar o eliminar las existentes. Puedes conectar la cuenta con tu red social, asociarle muchas direcciones de correo electrónico y gestionar muchas opciones como las preferencias sobre notificaciones.

source: You can update these information anytime from your *Profile* page which is accessible from the user menu.
es: Puedes actualizar esta información en cualquier momento desde tu página de *Perfil*, accesible desde el menú de usuario.

source: So, click on your profile picture in the top right of the screen. A drop-down list will show. Click on :guilabel:`Profile` to enter the *Profile* settings page.
es: Entonces, haz clic en tu foto de perfil en la parte superior derecha de la pantalla. Se mostrará una lista desplegable. Haga clic en :guilabel:`Profile` para ingresar a la página de configuración de *Perfil*.

source: *Link to your profile*
es: *Enlace a su perfil*

source: The *Profile* page looks like the one shown in the picture below.
es: La página *Perfil* se parece a la que se muestra en la imagen siguiente.

source: *User profile page*
es: *Página de perfil de usuario*

source: Your personal information is shown under the username. At the bottom of the page are listed all the resources associated to your *Profile*, you can decide to view only datasets, maps ,documents, dashboard or geostory by clicking on the corresponding tab.
es: Su información personal se muestra debajo del nombre de usuario. En la parte inferior de la página se enumeran todos los recursos asociados a su *Perfil*, puede decidir ver solo conjuntos de datos, mapas, documentos, paneles o geohistorias haciendo clic en la pestaña correspondiente.

source: Through the link ``User datasets WMS GetCapabilities document`` you can retrieve an XML document with the list of the available datasets.
es: A través del enlace ``Documento WMS GetCapabilities de conjuntos de datos de usuario`` puedes obtener un documento XML con la lista de los conjuntos de datos disponibles.

source: On the right side of the page there are many useful links to edit personal information to update your *Profile* settings and to get in touch with other GeoNode users.
es: En el lado derecho de la página hay muchos enlaces útiles para editar información personal, actualizar la configuración de tu *Perfil* y ponerse en contacto con otros usuarios de GeoNode.

source: The :guilabel:`My Activities` link allows to see all your recent activities on GeoNode such as datasets uploading and maps creation.
es: El enlace :guilabel:`Mis actividades` permite ver todas tus actividades recientes en GeoNode, como la carga de conjuntos de datos y la creación de mapas.

source: *Recent activities*
es: *Actividades recientes*

source: All other links and their functionalities will be described in depth in the following sections.
es: Todos los demás enlaces y sus funcionalidades se describirán en profundidad en las siguientes secciones.
