Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/install/basic/index.po
Languages: es

source: GeoNode Basic Installation
es: Instalación básica de GeoNode

source: Overview
es: Descripción general

source: The followings are the easiest and recommended ways to deploy a full-stack GeoNode server on your host.
es: Las siguientes son las formas más fáciles y recomendadas para desplegar un servidor GeoNode full-stack en tu host.

source: **First Step**: Deploy :guilabel:`GeoNode on a local server`, running as ``http://localhost/`` service. :guilabel:`GeoServer` will be also available at ``http://localhost/geoserver/``
es: **Primer paso**: Implementar :guilabel:`GeoNode en un servidor local`, ejecutándolo como servicio ``http://localhost/``. :guilabel:`GeoServer` también estará disponible en ``http://localhost/geoserver/``

source: **Second Step**: Deploy :guilabel:`GeoNode on a production server`, running as ``https://my_geonode.geonode.org/`` service. :guilabel:`GeoServer` will be also available at ``https://my_geonode.geonode.org/geoserver/``
es: **Segundo paso**: Implementar :guilabel:`GeoNode en un servidor de producción`, ejecutándose como servicio ``https://my_geonode.geonode.org/``. :guilabel:`GeoServer` también estará disponible en ``https://my_geonode.geonode.org/geoserver/``

source: **Third Step**: Customize :guilabel:`.env` to match your needs
es: **Tercer paso**: Personaliza :guilabel:`.env` para que se ajuste a tus necesidades

source: **Fourth Step**: Secure your production deployment; change the :guilabel:`admin` passwords and :guilabel:`OAUth2` keys
es: **Cuarto paso**: Asegura tu implementación de producción; cambiar las contraseñas :guilabel:`admin` y las claves :guilabel:`OAUth2`

source: **Further Production Enhancements**
es: **Mejoras Adicionales para Producción**

source: First Step: Deploy GeoNode on a local server
es: Primer paso: implementar GeoNode en un servidor local

source: Docker Setup for Ubuntu (22.04)
es: Configuración de Docker para Ubuntu (22.04)

source: Create an instance of your ``geonode-project``
es: Crea una instancia de tu ``geonode-project``

source: Let's say your project is named :guilabel:`my_geonode` perform the following steps:
es: Digamos que tu proyecto se llama :guilabel:`my_geonode` realiza los siguientes pasos:

source: Prepare the .env file
es: Prepara el archivo .env

source: GeoNode uses an ``.env`` where the environment variables required by Docker and GeoNode itself must be configured. A simple way to generate a basic ``.env`` is using the ``create-envfile.py`` utility command. If run without arguments it will generate a valid ``.env`` for a local deployment.
es: GeoNode utiliza un ``.env`` donde se deben configurar las variables de entorno requeridas por Docker y el propio GeoNode. Una forma sencilla de generar un ``.env`` básico es usar el comando de utilidad ``create-envfile.py``. Si se ejecuta sin argumentos, generará un ``.env`` válido para una implementación local.

source: The command accepts the following arguments:
es: El comando acepta los siguientes argumentos:

source: `--https`: Enable SSL. It's disabled by default
es: `--https`: Enable SSL. Está deshabilitado por defecto.

source: When set to `prod` `DEBUG` is disabled and the creation of a valid `SSL` is requested to Letsencrypt's ACME server
es: Cuando se establece en `prod`, `DEBUG` está deshabilitado y se solicita la creación de un `SSL` válido al servidor ACME de Letsencrypt.

source: When set to `test` `DEBUG` is disabled and a test `SSL` certificate is generated for local testing
es: Cuando se establece en "test", "DEBUG" está deshabilitado y se genera un certificado de prueba "SSL" para pruebas locales.

source: When set to `dev` `DEBUG` is enabled and no `SSL` certificate is generated
es: Cuando se establece en `dev`, `DEBUG` está habilitado y no se genera ningún certificado `SSL`

source: `--hostname`: The URL that will serve GeoNode (`localhost` by default)
es: `--hostname`: La URL que servirá a GeoNode (`localhost` por defecto)

source: `--email`: The administrator's email. Notice that a real email and valid SMPT configurations are required if `--env_type` is set to `prod`. Letsencrypt uses email for issuing the SSL certificate
es: `--email`: El correo electrónico del administrador. Tenga en cuenta que se requiere un correo electrónico real y configuraciones SMPT válidas si `--env_type` está configurado en `prod`. Letsencrypt utiliza el correo electrónico para emitir el certificado SSL

source: `--geonodepwd`: GeoNode's administrator password. A random value is set if left empty
es: `--geonodepwd`: contraseña de administrador de GeoNode. Se establece un valor aleatorio si se deja vacío

source: `--geoserverpwd`: GeoNode's administrator password. A random value is set if left empty
es: `--geoserverpwd`: contraseña de administrador de GeoNode. Se establece un valor aleatorio si se deja vacío

source: `--pgpwd`: PostgreSQL's administrator password. A random value is set if left empty
es: `--pgpwd`: Contraseña de administrador de PostgreSQL. Se establece un valor aleatorio si se deja vacío

source: `--dbpwd`: GeoNode DB user role's password. A random value is set if left empty
es: `--dbpwd`: contraseña del rol de usuario de GeoNode DB. Se establece un valor aleatorio si se deja vacío

source: `--geodbpwd`: GeoNode data DB user role's password. A random value is set if left empty
es: `--geodbpwd`: Contraseña del rol de usuario de la base de datos de datos GeoNode. Se establece un valor aleatorio si se deja vacío

source: `--clientid`: Client id of Geoserver's GeoNode Oauth2 client. A random value is set if left empty
es: `--clientid`: ID del cliente GeoNode Oauth2 de Geoserver. Se establece un valor aleatorio si se deja vacío

source: `--clientsecret`: Client secret of Geoserver's GeoNode Oauth2 client. A random value is set if left empty
es: `--clientsecret`: Secreto del cliente OAuth2 de GeoNode en GeoServer. Se establece un valor aleatorio si se deja vacío

source: Build and run
es: Construir y ejecutar

source: You can follow the containers startup by running the following commands from ``my_geonode`` root folder:
es: Puedes seguir el inicio de los contenedores ejecutando los siguientes comandos desde la carpeta raíz ``my_geonode``:

source: If any error occurs, try to catch the error stacktrace by running the following commands from ``my_geonode`` root folder:
es: Si se produce algún error, intenta capturar la traza de la pila de errores ejecutando los siguientes comandos desde la carpeta raíz de ``my_geonode``:

source: Connect to :guilabel:`http://localhost/`
es: Conéctate a :guilabel:`http://localhost/`

source: The startup typically takes some time, so be patient…
es: El inicio suele tardar algún tiempo, así que ten paciencia...

source: If everything goes well, you should be able to see from the ``geonode startup logs`` a line similar to the following one:
es: Si todo va bien, deberías poder ver en los ``registros de inicio de GeoNode`` una línea similar a la siguiente:

source: The default credentials are:
es: Las credenciales predeterminadas son:

source: ``username: admin`` ``password: admin``
es: ``nombre de usuario: admin`` ``contraseña: admin``

source: ``username: admin`` ``password: geoserver``
es: ``nombre de usuario: admin`` ``contraseña: geoserver``

source: Second Step: Deploy GeoNode on a production server
es: Segundo paso: implementar GeoNode en un servidor de producción

source: In the case you would like to deploy to, let's say, :guilabel:`https://my_geonode.geonode.org/`, you will need to change ``.env`` as follows:
es: En el caso de que desees implementar en, digamos, :guilabel:`https://my_geonode.geonode.org/`, deberás cambiar ``.env`` de la siguiente manera:

source: These variables are automatically set by the ``create-envfile.py`` script if the ``--https`` and ``--hostname`` variables are used.
es: Estas variables son configuradas automáticamente por el script ``create-envfile.py`` si se utilizan las variables ``--https`` y ``--hostname``.

source: When ``LETSENCRYPT_MODE`` is set to ``production`` a valid email and email SMPT server are required to make the system generate a valid certificate.
es: Cuando ``LETSENCRYPT_MODE`` está configurado en ``production``, se requiere un correo electrónico válido y un servidor SMPT de correo electrónico para que el sistema genere un certificado válido.

source: Restart the containers
es: Reiniciar los contenedores

source: Whenever you change someting on :guilabel:`.env` file, you will need to rebuild the container
es: Siempre que cambie algo en el archivo :guilabel:`.env`, necesitarás reconstruir el contenedor

source: Notche that the following command drops any change you might have done manually inside the containers, except for the static volumes.
es: Observa que el siguiente comando descarta cualquier cambio que hayas realizado manualmente dentro de los contenedores, excepto los volúmenes estáticos.

source: Troubleshooting
es: Solución de problemas

source: If for some reason you are not able to reach the server on the :guilabel:`HTTPS` channel, please check the :guilabel:`NGINX` configuration files below:
es: Si por alguna razón no puedes acceder al servidor en el canal :guilabel:`HTTPS`, verifica los archivos de configuración :guilabel:`NGINX` a continuación:

source: Enter the :guilabel:`NGINX` container
es: Ingresar al contenedor :guilabel:`NGINX`

source: Install an editor if not present
es: Instalar un editor si no está presente

source: Double check that the ``nginx.https.enabled.conf`` link has been correctly created
es: Verificar que el enlace ``nginx.https.enabled.conf`` se haya creado correctamente

source: If the list does not match exactly the figure above, please run the following commands, and check again
es: Si la lista no coincide exactamente con la figura anterior, ejecuta los siguientes comandos y verifica nuevamente

source: Inspect the ``nginx.https.enabled.conf`` contents
es: Inspeccionar el contenido de ``nginx.https.enabled.conf``

source: Make sure the contents match the following
es: Asegúrate que el contenido coincida con lo siguiente

source: Change the :guilabel:`Hostname` accordingly. **This is only an example!**
es: Cambiar :guilabel:`Hostname` en consecuencia. **¡Esto es sólo un ejemplo!**

source: **Save the changes, if any, and exit!**
es: **¡Guarda los cambios, si los hay, y sal!**

source: Reload the NGINX configuration
es: Vuelva a cargar la configuración de NGINX

source: It may be helpful to disable https to isolate the source of errors. After reverting the HTTPS-related changes in the `.env` file, repeat the above steps and ensure that the ``nginx.http.enabled.conf`` link has been correctly created.
es: Puede resultar útil desactivar https para aislar el origen de los errores. Después de revertir los cambios relacionados con HTTPS en el archivo `.env`, repite los pasos anteriores y asegúrate que el enlace ``nginx.http.enabled.conf`` se haya creado correctamente.

source: Customize :guilabel:`.env` to match your needs
es: Personaliza :guilabel:`.env` para que se ajuste a tus necesidades

source: In the case you would like to modify the GeoNode behavior, always use the :guilabel:`.env` file in order to update the :guilabel:`settings`.
es: En el caso de que desees modificar el comportamiento de GeoNode, utiliza siempre el archivo :guilabel:`.env` para actualizar :guilabel:`settings`.

source: If you need to change a setting which does not exist in :guilabel:`.env`, you can force the values inside :guilabel:`my_geonode/settings.py`
es: Si necesitas cambiar una configuración que no existe en :guilabel:`.env`, puedes forzar los valores dentro de :guilabel:`my_geonode/settings.py`

source: Refer to the section: :ref:`settings`
es: Consulta la sección: :ref:`configuración`

source: You can add here any property referred as
es: Puedes agregar aquí cualquier propiedad referida como

source: Whenever you change someting on :guilabel:`.env` file, you will need to rebuild the containers.
es: Siempre que cambies algo en el archivo :guilabel:`.env`, necesitarás reconstruir los contenedores.

source: **Be careful!** The following command drops any change you might have done manually inside the containers, except for the static volumes.
es: **¡Ten cuidado!** El siguiente comando descarta cualquier cambio que hayas realizado manualmente dentro de los contenedores, excepto los volúmenes estáticos.

source: [Optional] Configure your SSL Certificates
es: [Opcional] Configura tus certificados SSL

source: In production deployment mode, GeoNode uses by default :guilabel:`Let's Encrypt` certificates
es: En el modo de implementación de producción, GeoNode utiliza por defecto los certificados :guilabel:`Let's Encrypt`

source: You may want to provide your own certificates to GeoNode
es: Es posible que desees proporcionar tus propios certificados a GeoNode
