Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_documents/document_info.po
Languages: es

source: Document Information
es: Información del Documento

source: From the *Documents Search Page* (see :ref:`finding-data`) you can select the document you are interested in and click on its name to see an overview about it.
es: Desde la *Página de búsqueda de documentos* (ver :ref:`finding-data`) puede seleccionar el documento que le interesa y hacer clic en su nombre para ver una descripción general del mismo.

source: The information panel reports:
es: El panel de información reporta:

source: The **Info** tab is active by default. This tab section shows some document metadata such as its title, the abstract, date of publication etc. The metadata also indicates the document owner, what are the topic categories the document belongs to and which regions are affected.
es: La pestaña **Información** está activa de forma predeterminada. Esta sección de pestaña muestra algunos metadatos del documento, como su título, resumen, fecha de publicación, etc. Los metadatos también indican el propietario del documento, cuáles son las categorías de temas a las que pertenece el documento y qué regiones se ven afectadas.

source: *Document Information tab*
es: *Pestaña Información del documento*

source: The **Location** tab shows the spacial extent of the document.
es: La pestaña **Ubicación** muestra la extensión espacial del documento.

source: *Document Location tab*
es: *Pestaña Ubicación del documento*

source: By clicking on the copy icons you have a copy of the current *Bounding Box* or the *Center* in the clipboard which once pasted will be a WKT text.
es: Al hacer clic en los iconos de copiar, tendrás una copia de la Caja Delimitadora actual o del Centro en el portapapeles, que una vez pegada será un texto en formato WKT.

source: *Bounding Box and Center*
es: *Caja Delimitadora y Centro*

source: From the :ref:`document-info` the *Location* tab is in read only mode, to edit it see the :ref:`document-editing`
es: Desde :ref:`document-info` la pestaña *Ubicación* está en modo de solo lectura, para editarla consulte :ref:`document-editing`

source: The *Linked Resources* tab shows the resources, that can be *Datasets*, *Maps*, *GeoStories* and *Dashboards*, linked to the document.
es: La pestaña *Recursos vinculados* muestra los recursos, que pueden ser *Conjuntos de datos*, *Mapas*, *GeoHistorias* y *Paneles (Dasboards)*, vinculados al documento.

source: *Document Linked Resources tab*
es: *Pestaña Recursos vinculados al documento*

source: When a resource is `linked from` the document the link is under the *Linked by* list while when a resource is `linked to` the document the link is under the *Used by* list
es: Cuando un recurso está "vinculado desde" el documento, el enlace se encuentra en la lista *Vinculado por*, mientras que cuando un recurso está `vinculado al` documento, el enlace se encuentra en la lista *Usado por*

source: From the :ref:`document-metadata` it is possible edit the document *Linked Resources*
es: Desde :ref:`document-metadata` es posible editar el documento *Recursos vinculados*

source: From the right toolbar on the **Info** panel it is possible:
es: Desde la barra de herramientas derecha en el panel **Información** es posible:

source: *Document Info toolbar*
es: *Barra de herramientas de información del documento*

source: Add document in your *Favorites* (see :ref:`editing-profile`), clicking on star icon.
es: Agregá el documento a tus *Favoritos* (ver :ref:`editing-profile`), haciendo clic en el icono de estrella.

source: Directly *Download* the document oh `ShapeFile` format
es: *Descargar* directamente el documento en formato `ShapeFile`

source: *Share* the document url
es: *Compartir* la URL del documento

source: Change the document *Title* by clicking on it
es: Cambia el documento *Título* haciendo clic en él

source: You can access the document details page by clicking on *View document* in the overview panel. That page looks like the one shown in the picture below.
es: Puedes acceder a la página de detalles del documento haciendo clic en *Ver documento* en el panel de descripción general. Esa página se parece a la que se muestra en la imagen a continuación.

source: *Document page*
es: *Página del documento*

source: On the page of a document, the resource is either directly displayed on the page or accessible by clicking on the link provided under the title.
es: En la página de un documento, el recurso se muestra directamente en la página o se puede acceder a él haciendo clic en el enlace proporcionado debajo del título.

source: Exploring the Document detail menu Sections
es: Explorando las secciones del menú de detalles del documento

source: As soon as a document is opened, the **Info** panel is shown. It reports the document metadata such as its title, abstract, date of publication etc. The metadata also indicates the user who is responsible for uploading and managing this content, as well as the group to which it is linked.
es: Tan pronto como se abre un documento, se muestra el panel **Información**. Informa los metadatos del documento, como su título, resumen, fecha de publicación, etc. Los metadatos también indican el usuario responsable de cargar y administrar este contenido, así como el grupo al que está vinculado.

source: *Document Info*
es: *Información del documento*

source: Selecting *View Metadata* from the :guilabel:`View` button it is possible to visualize the metadata of the document
es: Seleccionando *Ver Metadatos* desde el botón :guilabel:`Ver` es posible visualizar los metadatos del documento

source: *Document Metadata*
es: *Metadatos del documento*

source: Under the :guilabel:`Resource` button, it is possible to select the *Share* option to provides the document link to share.
es: Debajo del botón :guilabel:`Recurso`, es posible seleccionar la opción *Compartir* para proporcionar el enlace del documento para compartir.

source: *Document Sharing*
es: *Compartir documentos*

source: If you want to download the document, click on the :guilabel:`Download` button and the document will be downloaded automatically.
es: Si desea descargar el documento, haga clic en el botón :guilabel:`Descargar` y el documento se descargará automáticamente.

source: *Document Metadata download*
es: *Descarga de metadatos del documento*
