Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_documents/document_permissions.po
Languages: es

source: Share Options
es: Compartir opciones

source: GeoNode encourages to publicly, share and make available for download information uploaded on the platform. By default, anyone can see and download a document. However, the document responsible can choose to limit access to the document to some contributors and/or groups.
es: GeoNode alienta a publicar, compartir y poner a disposición para su descarga la información cargada en la plataforma. De forma predeterminada, cualquiera puede ver y descargar un documento. Sin embargo, el responsable del documento puede optar por limitar el acceso al documento a algunos contribuyentes y/o grupos.

source: Through the *Share* Link shown in the menu it is possible to manage the document share options. it opens a form where set up who can:
es: A través del enlace *Compartir* que se muestra en el menú es posible gestionar las opciones para compartir documentos. se abre un formulario donde se configura quién puede:

source: None (the document is not visible).
es: Ninguno (el documento no es visible).

source: View Metadata (allows to view the document).
es: Ver Metadatos (permite ver el documento).

source: View and Download (allows to view and download the document).
es: Ver y Descargar (permite ver y descargar el documento).

source: Edit (allows to change the document metadata and attributes).
es: Editar (permite cambiar los metadatos y atributos del documento).

source: Manage it (allows to update, delete, change share options, publish/unpublish).
es: Gestionarlo (permite actualizar, eliminar, cambiar opciones para compartir, publicar/despublicar).

source: See an example in the picture below.
es: Ve un ejemplo en la imagen a continuación.

source: After making changes, always save them with the *Save* Link in the menu
es: Después de realizar cambios, guárdalos siempre con el enlace *Guardar* en el menú

source: *Changing the Document share options*
es: *Cambiando las opciones para compartir documentos*

source: Usually those with options of editing metadata and the management of a document are in charge and responsible of the document, i.e. the contributor who uploaded it has those options by default.
es: Generalmente aquellos con opciones de edición de metadatos y la gestión de un documento están a cargo y son responsables del documento, es decir, el colaborador que lo subió tiene esas opciones por defecto.

source: Once the share options are set, click :guilabel:`Save` link in the menu to save them.
es: Una vez configuradas las opciones para compartir, haz clic en el enlace :guilabel:`Guardar` en el menú para guardarlas.
