Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_documents/document_editing.po
Languages: es

source: Document Editing
es: Edición de documentos

source: The :ref:`document-info` page makes available useful menu for document editing. Click on the :guilabel:`Edit` link then :guilabel:`Edit Metadata` to see editing forms.
es: La página :ref:`document-info` pone a disposición un menú para la edición de documentos. Haga clic en el enlace :guilabel:`Editar` y luego en :guilabel:`Editar metadatos` para ver los formularios de edición.

source: Setting the Document Thumbnail
es: Configuración de la miniatura del documento

source: From the *Metadata Form*, it is possible to *Set the Thumbnail* of the document. Click on :guilabel:`Choose file` to open the *Thumbnail Uploading* page and chose the image that will illustrate your document. Once this is done, click on the ok button and save. If the thumbnail has been successfully uploaded you can see it by coming back to the document list.
es: Desde el *Formulario de Metadatos*, es posible *Establecer la Miniatura* del documento. Haga clic en :guilabel:`Elegir archivo` para abrir la página *Carga de miniaturas* y elija la imagen que ilustrará su documento. Una vez hecho esto, haga clic en el botón Aceptar y guarde. Si la miniatura se ha cargado correctamente, podrá verla volviendo a la lista de documentos.

source: *Upload Document's Thumbnail*
es: *Subir miniatura del documento*

source: If no errors occur, the new selected thumbnail will be shown.
es: Si no se producen errores, se mostrará la nueva miniatura seleccionada.

source: *Uploading success*
es: *Subida exitosa*

source: Editing the Document Metadata
es: Edición de los metadatos del documento

source: You can edit the metadata of your document as described in the :ref:`document-metadata` section or by using THe *Advanced Metadata* option below.
es: Puede editar los metadatos de su documento como se describe en la sección :ref:`document-metadata` o utilizando la opción *Metadatos avanzados* a continuación.

source: The :guilabel:`Advanced Metadata` button takes you to a big form where all the available metadata of the document can be edited.
es: El botón :guilabel:`Metadatos Avanzados` te lleva a un formulario grande donde se pueden editar todos los metadatos disponibles del documento.

source: Some information are mandatory such as the *Title* or the *Category* the document belongs to, some others are optional.
es: Algunas informaciones son obligatorias como el *Título* o la *Categoría* a la que pertenece el documento, otras son opcionales.

source: *Editing Metadata*
es: *Edición de metadatos*

source: In the example shown in the picture above, the information inside the red rectangles have been changed. To save the changes click on :guilabel:`Update`, you will be redirected to the document page.
es: En el ejemplo que se muestra en la imagen de arriba, se ha cambiado la información dentro de los rectángulos rojos. Para guardar los cambios haga clic en :guilabel:`Actualizar`, será redirigido a la página del documento.

source: Editing the Document Info
es: Editar la información del documento

source: You can edit the information of your document by clicking on the :guilabel:`Info` button.
es: Puedes editar la información de tu documento haciendo clic en el botón :guilabel:`Info`.

source: From the Info panel, it is possible to upload the **Thumbnail** of the document.
es: Desde el panel de Información, es posible cargar la **Miniatura** del documento.

source: *Upload Thumbnail*
es: *Subir miniatura*

source: If you want this document in your **Favorites** (see :ref:`editing-profile`), click on the start icon.
es: Si desea este documento en sus **Favoritos** (ver :ref:`editing-profile`), haga clic en el icono de inicio.

source: *Favorite document*
es: *Documento favorito*

source: You can directly **Download** the document and **Share** the document url by clicking the buttons on the top-right of the panel.
es: Puede **Descargar** directamente el documento y **Compartir** la URL del documento haciendo clic en los botones en la parte superior derecha del panel.

source: *Share and Download document*
es: *Compartir y descargar documento*

source: By clicking the document **Title**, you can change it.
es: Al hacer clic en el documento **Título**, puede cambiarlo.

source: *Document Title*
es: *Titulo del documento*

source: From the :guilabel:`Locations` tab, you can manage the spacial extent of the document.
es: Desde la pestaña :guilabel:`Ubicaciones`, puedes gestionar la extensión espacial del documento.

source: Here numerical fields and a map show the spatial extent (WGS 84) for the document and you can edit it by Shift+click and drag to draw the new extent on the map and change its location by clicking the marker and drag.
es: Aquí, los campos numéricos y un mapa muestran la extensión espacial (WGS 84) del documento, y puedes editarla manteniendo presionada la tecla Shift mientras haces clic y arrastras para dibujar la nueva extensión en el mapa y cambiar su ubicación haciendo clic en el marcador y arrastrándolo.

source: The *Location* tab is also available for :ref:`dashboard` and :ref:`geostory`
es: La pestaña *Ubicación* también está disponible para :ref:`dashboard` y :ref:`geostory`
