Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_documents/document_metadata.po
Languages: es

source: Filling the Document Metadata
es: Llenar los metadatos del documento

source: You can open the Metadata form by clicking on the *Edit* link in the document details menu and then *Edit Metatadata* Link.
es: Puedes abrir el formulario de Metadatos haciendo clic en el enlace *Editar* en el menú de detalles del documento y luego en el enlace *Editar Metadatos*.

source: *Edit Metadata Link*
es: *Editar enlace de metadatos*

source: Metadata contains all the information related to the document: they are its ID card. They provide essential information for its identification and its comprehension. Metadata also make the document more easily retrievable through search by other users.
es: Los metadatos contienen toda la información relacionada con el documento: son su documento de identidad. Proporcionan información esencial para su identificación y su comprensión. Los metadatos también hacen que el documento sea más fácilmente recuperable mediante búsquedas por parte de otros usuarios.

source: Editing a document's metadata is done in three steps (*Basic Metadata*, *Location and Licenses*, *Optional Metadata*). The first two steps are mandatory (no documents will be published if the required information are not provided) whereas the last one is optional.
es: La edición de los metadatos de un documento se realiza en tres pasos (*Metadatos básicos*, *Ubicación y licencias*, *Metadatos opcionales*). Los dos primeros pasos son obligatorios (no se publicará ningún documento si no se proporciona la información requerida) mientras que el último es opcional.

source: On the **Basic Metadata** page, the essential information that has to be filled is:
es: En la página **Metadatos básicos**, la información esencial que se debe completar es:

source: *Title* of the document, which should be clear and understandable;
es: *Título* del documento, que debe ser claro y comprensible;

source: *Abstract* of the document;
es: *Resumen* del documento;

source: *Creation/Publication/Revision* dates which define the time period that is covered by the document;
es: *Fechas de creación/publicación/revisión* que definen el período de tiempo que cubre el documento;

source: *Keywords*, which should be chosen within the available list. The contributor search for available keywords by clicking on the searching bar, or on the folder logo representing, or by entering the first letters of the desired word. Key-words should be relevant to the imported document;
es: *Palabras clave*, que se deben elegir dentro de la lista disponible. El colaborador busca palabras clave disponibles haciendo clic en la barra de búsqueda, en el logotipo de la carpeta que representa, o ingresando las primeras letras de la palabra deseada. Las palabras clave deben ser relevantes para el documento importado;

source: *Category* in which the document belongs;
es: *Categoría* a la que pertenece el documento;

source: *Group* to which the document is linked.
es: *Grupo* al que está vinculado el documento.

source: *Document Basic Metadata*
es: *Metadatos básicos del documento*

source: Once all the fields are filled, click on the blue button :guilabel:`Next >>` in the bottom right corner of the page.
es: Una vez que todos los campos estén llenos, haz clic en el botón :guilabel:`Siguiente >>` en la esquina inferior derecha de la página.

source: On the **Location and Licenses** page, the following information should be filled:
es: En la página **Ubicación y licencias**, se debe completar la siguiente información:

source: *Language* of the document;
es: *Idioma* del documento;

source: *Regions*, which informs on the spatial extent covered by the document. Proposed extents cover the following scales: global, continental, regional, national;
es: * Regiones *, que informa sobre la extensión espacial que abarca el documento. Los alcances propuestos cubren las siguientes escalas: global, continental, regional, nacional;

source: *Data Quality statement* (general explanation of the data producer's knowledge about the lineage of a dataset);
es: *Declaración de calidad de datos* (explicación general del conocimiento del productor de datos sobre el linaje de un conjunto de datos);

source: Potential *Restrictions* to sharing the document should be provided in the Restrictions box.
es: Las posibles *Restricciones* para compartir el documento deben indicarse en el cuadro Restricciones.

source: *Document Location and Licenses*
es: *Ubicación del documento y licencias*

source: Click on the blue button :guilabel:`Next >>` to go ahead to the next step.
es: Haga clic en el botón :guilabel:`Siguiente >>` para avanzar al siguiente paso.

source: On the **Optional Metadata** page, complementary information can be added:
es: En la página **Metadatos Opcionales** se puede añadir información complementaria:

source: *Edition* to indicate the reference or the source of the document;
es: *Edición* para indicar la referencia o la fuente del documento;

source: *Purpose* of the document and its objectives;
es: *Propósito* del documento y sus objetivos;

source: *Supplemental information* that can provide a better understanding of the uploaded document;
es: *Información complementaria* que puede proporcionar una mejor comprensión del documento cargado;

source: *Maintenance frequency* of the document;
es: *Frecuencia de mantenimiento* del documento;

source: *Spatial representation type* used.
es: *Tipo de representación espacial* utilizado.

source: *Related resources* to link one or multiple resources to the document. These will be visible inside the :ref:`document-info` panel
es: *Recursos relacionados* para vincular uno o varios recursos al documento. Estos serán visibles dentro del panel :ref:`document-info`

source: *Responsible Parties*, *Owner* and *Share options* are listed on the right side of the page, you can edit them.
es: *Las Partes responsables*, el *Propietario* y las *opciones para compartir* se enumeran en el lado derecho de la página; puede editarlas.

source: *Document Optional Metadata*
es: *Documento Metadatos Opcionales*

source: If all the mandatory information is filled out the document can be published, if not the ``Completeness`` progress bar warns you that something is missing.
es: Si se completa toda la información obligatoria, el documento se puede publicar; de lo contrario, la barra de progreso ``Integridad`` le advierte que falta algo.

source: Click on the blue button :guilabel:`Update` to save information on the system.
es: Haga clic en el botón :guilabel:`Actualizar` para guardar información del sistema.
