Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_documents/uploading_documents.po
Languages: es

source: Upload/Add Documents
es: Cargar/Agregar documentos

source: GeoNode allows to share reports, conceptual notes, posters, spreadsheets, etc. A wide range of documents files can be hosted on the platform, including text files (.doc, .docx, .txt, .odt), spreadsheets (.xls, .xlsx, .ods), presentations (.ppt, .pptx, .odp), images (.gif, .jpg, .png, .tif, .tiff), PDF, zip files (.rar, .zip, .gz), SLD, XML, QML files or as External URL.
es: GeoNode permite compartir informes, notas conceptuales, carteles, hojas de cálculo, etc. Se puede alojar una amplia gama de archivos de documentos en la plataforma, incluidos archivos de texto (.doc, .docx, .txt, .odt), hojas de cálculo (.xls, .xlsx, .ods), presentaciones (.ppt, .pptx, .odp), imágenes (.gif, .jpg, .png, .tif, .tiff), PDF, archivos zip (.rar, .zip, .gz ), archivos SLD, XML, QML o como URL externa.

source: Only authenticated users can upload data into GeoNode.
es: Sólo los usuarios autenticados pueden cargar datos en GeoNode.

source: It is possible to upload a *Documents* in two ways:
es: Es posible subir un *Documento* de dos maneras:

source: From the :guilabel:`All Resources` page, by clicking *Add Resource* which displays a list including `Upload document` link:
es: Desde la página :guilabel:`Todos los recursos`, al hacer clic en *Agregar recurso* que muestra una lista que incluye el enlace `Cargar documento`:

source: *Document Upload from All Resources page*
es: *Carga de documentos desde la página Todos los recursos*

source: From the :guilabel:`Documents` page, by clicking on *New* button.
es: Desde la página :guilabel:`Documentos`, pulsando en el botón *Nuevo*.

source: *Document Upload from Documents page*
es: *Carga de documentos desde la página Documentos*

source: The *Document Upload* page looks like the one shown in the picture below.
es: La página *Carga de documentos* se parece a la que se muestra en la imagen siguiente.

source: *Document Upload page*
es: *Página de carga de documentos*

source: On *GeoNode* documents can be:
es: En *GeoNode* los documentos pueden ser:

source: Upload from the **Local file**
es: Cargados desde un **archivo local**

source: Created with reference to **External URL**
es: Creados con referencia a una **URL externa**

source: In order to upload a document from the **Local file**, you need to:
es: Para cargar un documento desde un **archivo local**, necesitas:

source: Click on :guilabel:`Select files` button
es: Haga clic en :guilabel:botón `Seleccionar archivos`

source: Select a file from your disk.
es: Seleccionar un archivo de tu disco.

source: Click the :guilabel:`Upload` button
es: Hacer clic en el botón :guilabel:`Subir`

source: *Upload document from the select files option*
es: *Subir documento desde la opción de seleccionar archivos*

source: A document may refer to a remote document, without making a local copy of the remote resource.
es: Un documento puede referirse a un documento remoto, sin hacer una copia local del recurso remoto.

source: To add a document that references an **External URL** you need to:
es: Para agregar un documento que haga referencia a una **URL externa**, debes:

source: Click on :guilabel:`Add URL` button
es: Hacer clic en el botón :guilabel:`Agregar URL`

source: Select an URL
es: Seleccionar una URL

source: Select an extension from the drop-down menu
es: Seleccionar una extensión del menú desplegable

source: *Add document from the add URL option*
es: *Agregar documento desde la opción agregar URL*

source: At the end of the uploading process, by clicking on the View button, you will be driven to the document page with the Info panel open. Here it is possible to view more info, edit metadata, share, download, and delete the document. See the next section to know more about Metatadata.
es: Al final del proceso de carga, al hacer clic en el botón Ver, accederás a la página del documento con el panel de información abierto. Aquí es posible ver más información, editar metadatos, compartir, descargar y eliminar el documento. Consulta la siguiente sección para saber más sobre los metadatos.

source: If you get the following error message:
es: Si recibes el siguiente mensaje de error:

source: ``Total upload size exceeds 100.0 MB. Please try again with smaller files.``
es: ``El tamaño total de carga supera los 100,0 MB. Inténtelo de nuevo con archivos más pequeños.``

source: This means that there is an upload size limit of 100 MB. An user with administrative access can change the upload limits at the `admin panel <../../admin/upload-size-limits/index.html#upload-size-limits>`__.
es: Esto significa que hay un límite de tamaño de carga de 100 MB. Un usuario con acceso administrativo puede cambiar los límites de carga en el `panel de administración <../../admin/upload-size-limits/index.html#upload-size-limits>`__.
