Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/default_lang/index.po
Languages: es

source: Changing the Default Language
es: Cambiar el idioma predeterminado

source: GeoNode's default language is English, but GeoNode users can change the interface language with the pulldown menu at the top-right of most GeoNode pages. Once a user selects a language GeoNode remembers that language for subsequent pages.
es: El idioma predeterminado de GeoNode es el inglés, pero los usuarios de GeoNode pueden cambiar el idioma de la interfaz con el menú desplegable que se encuentra en la parte superior derecha de la mayoría de las páginas de GeoNode. Una vez que un usuario selecciona un idioma, GeoNode lo recuerda para las páginas siguientes.

source: GeoNode Configuration
es: Configuración de GeoNode

source: As root edit the geonode config file :file:`/home/geonode/geonode/geonode/settings.py` (or :file:`/etc/geonode/settings.py` if GeoNode has been installed using **apt-get**) and change ``LANGUAGE_CODE`` to the desired default language.
es: Como root, edite el archivo de configuración de geonode :file:`/home/geonode/geonode/geonode/settings.py` (o :file:`/etc/geonode/settings.py` si GeoNode se ha instalado usando **apt-get**) y cambie ``LANGUAGE_CODE`` al idioma predeterminado deseado.

source: A list of language codes can be found in the global django config file :file:`/usr/local/lib/python2.7/dist-packages/django/conf/global_settings.py` (or :file:`/var/lib/geonode/lib/python2.7/site-packages/django/conf/global_settings.py` if GeoNode has been installed using **apt-get**).
es: Se puede encontrar una lista de códigos de idioma en el archivo de configuración global de Django :file:`/usr/local/lib/python2.7/dist-packages/django/conf/global_settings.py` (o :file:`/var/lib/geonode/lib/python2.7/site-packages/django/conf/global_settings.py` si GeoNode se ha instalado usando **apt-get**).

source: For example, to make French the default language use::
es: Por ejemplo, para que el francés sea el idioma predeterminado, utilice:

source: Unfortunately Django overrides this setting, giving the language setting of a user's browser priority. For example, if ``LANGUAGE_CODE`` is set to French, but the user has configured their operating system for Spanish they may see the Spanish version when they first visit GeoNode.
es: Lamentablemente, Django anula esta configuración y le da prioridad a la configuración de idioma del navegador del usuario. Por ejemplo, si ``LANGUAGE_CODE`` está configurado en francés, pero el usuario ha configurado su sistema operativo para español, es posible que vea la versión en español cuando visite GeoNode por primera vez.

source: Additional Steps
es: Pasos adicionales

source: If this is not the desired behaviour, and all users should initially see the default ``LANGUAGE_CODE``, regardless of their browser's settings, do the following steps to ensure Django ignores the browser language settings. (Users can always use the pulldown language menu to change the language at any time.)
es: Si este no es el comportamiento deseado y todos los usuarios deberían ver inicialmente el ``LANGUAGE_CODE`` predeterminado, independientemente de la configuración de su navegador, realice los siguientes pasos para asegurarse de que Django ignore la configuración de idioma del navegador. (Los usuarios siempre pueden usar el menú desplegable de idioma para cambiar el idioma en cualquier momento).

source: As **root** create a new directory within GeoNode's site packages
es: Como **root** crea un nuevo directorio dentro de los paquetes del sitio de GeoNode

source: or
es: o

source: if GeoNode has been installed using **apt-get**.
es: si GeoNode se ha instalado mediante **apt-get**.

source: As root create and edit a new file :file:`/usr/lib/python2.7/dist-packages/setmydefaultlanguage/__init__.py` and add the following lines
es: Como root, cree y edite un nuevo archivo :file:`/usr/lib/python2.7/dist-packages/setmydefaultlanguage/__init__.py` y agregue las siguientes líneas

source: At the end of the GeoNode configuration file :file:`/home/geonode/geonode/geonode/settings.py` (or :file:`/etc/geonode/settings.py` if GeoNode has been installed using **apt-get**) add the following lines to ensure the above class is executed
es: Al final del archivo de configuración de GeoNode :file:`/home/geonode/geonode/geonode/settings.py` (o :file:`/etc/geonode/settings.py` si GeoNode se ha instalado usando **apt-get**) agregue las siguientes líneas para garantizar que se ejecute la clase anterior

source: Restart
es: Reiniciar

source: You will need to restart GeoNode accordingly to the installation method you have choosen.
es: Necesitará reiniciar GeoNode según el método de instalación que haya elegido.

source: As an instance in case you are using `NGINX` with `UWSGI`, as root you will need to run the following commands
es: Por ejemplo, en caso de que estés usando `NGINX` con `UWSGI`, como root necesitarás ejecutar los siguientes comandos

source: Please refer to Translating GeoNode for information on editing GeoNode pages in different languages and create new GeoNode Translations.
es: Consulte Traducción de GeoNode para obtener información sobre cómo editar páginas de GeoNode en diferentes idiomas y crear nuevas traducciones de GeoNode.
