Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/start/quick/index.po
Languages: es

source: Introduction
es: Introducción

source: The following is a quick guide to get started with GeoNode in most common operating systems.
es: La siguiente es una guía rápida para comenzar a utilizar GeoNode en los sistemas operativos más comunes.

source: For a full setup and deployment, please refer to the :doc:`complete installation guides </install/index>`
es: Para una configuración e implementación completas, consulte la :doc:`guía de instalación completa </install/index>`

source: This is meant to be run on a fresh machine with no previously installed packages or GeoNode versions.
es: Esto debe ejecutarse en una máquina nueva sin paquetes instalados previamente ni versiones de GeoNode.

source: The methods presented here are meant to be used for a limited internal demo only. Before exposing your GeoNode instance to a public server, please read carefully the :doc:`hardening guide </advanced/hardening/index>`
es: Los métodos presentados aquí están destinados a ser utilizados solo para una demostración interna limitada. Antes de exponer su instancia de GeoNode a un servidor público, por favor lee atentamente la :doc:guía de fortalecimiento </advanced/hardening/index>`

source: Recommended Minimum System Requirements
es: Requisitos mínimos recomendados del sistema

source: A definite specification of technical requirements is difficult to recommend. Accepted performance is highly subjective. Furthermore, the performance depends on factors such as concurrent users, records in the database or the network connectivity of your infrastructure.
es: Es difícil recomendar una especificación definitiva de los requisitos técnicos. El desempeño aceptado es altamente subjetivo. Además, el rendimiento depende de factores como usuarios concurrentes, registros en la base de datos o la conectividad de red de su infraestructura.

source: For deployment of GeoNode on a single server, the following are the *bare minimum* system requirements:
es: Para la implementación de GeoNode en un solo servidor, los siguientes son los requisitos del sistema *mínimos*:

source: 8GB of RAM (16GB or more preferred for a production deployment).
es: 8 GB de RAM (16 GB o más son recomendados para una implementación en producción).

source: 2.2GHz processor with 4 cores. (Additional processing power may be required for multiple concurrent styling renderings)
es: Procesador de 2,2GHz con 4 núcleos. (Es posible que se requiera potencia de procesamiento adicional para múltiples renderizados de estilos simultáneos)

source: 30 GB software disk usage (Reserved to OS and source code only).
es: Uso de disco de software de 30 GB (Reservado solo para el sistema operativo y el código fuente).

source: Additional disk space for any data hosted with GeoNode, data stored on the DataBase and tiles cached with GeoWebCache. For db, spatial data, cached tiles, and "scratch space" useful for administration, a decent baseline size for GeoNode deployments is between 50GB and 100GB.
es: Espacio en disco adicional para cualquier dato alojado con GeoNode, datos almacenados en la base de datos y mosaicos almacenados en caché con GeoWebCache. Para bases de datos, datos espaciales, mosaicos en caché y "espacio temporal" útiles para la administración, un tamaño de referencia decente para implementaciones de GeoNode es entre 50 GB y 100 GB.

source: 64-bit hardware **strongly** recommended.
es: Se recomienda **encarecidamente** hardware de 64 bits.

source: Install via Docker
es: Instalación a través de Docker

source: `Docker <https://www.docker.com/>`_ is a free software platform used for packaging software into standardized units for development, shipment and deployment.
es: `Docker <https://www.docker.com/>`_ es una plataforma de software libre que se utiliza para empaquetar software en unidades estandarizadas para su desarrollo, envío e implementación.

source: credits to Docker
es: créditos a Docker

source: A container image is a lightweight, stand-alone, executable package of a piece of software that includes everything needed to run it: code, runtime, system tools, system libraries, settings.
es: Una imagen de contenedor es un paquete ejecutable, liviano e independiente de una pieza de software que incluye todo lo necesario para ejecutarlo: código, tiempo de ejecución, herramientas del sistema, bibliotecas del sistema y configuraciones.

source: Docker containers running on a single machine share that machine's operating system kernel; they start instantly and use less compute and RAM.
es: Los contenedores Docker que se ejecutan en una sola máquina comparten el kernel del sistema operativo de esa máquina; se inician instantáneamente y utilizan menos computación y RAM.

source: Containers can share a single kernel, and the only information that needs to be in a container image is the executable and its package dependencies, which never need to be installed on the host system.
es: Los contenedores pueden compartir un único kernel y la única información que debe estar en una imagen de contenedor es el ejecutable y sus dependencias de paquetes, que nunca necesitan instalarse en el sistema host.

source: Multiple containers can run on the same machine and share the OS kernel with other containers, each running as isolated processes in user space.
es: Se pueden ejecutar varios contenedores en la misma máquina y compartir el kernel del sistema operativo con otros contenedores, cada uno de los cuales se ejecuta como procesos aislados en el espacio del usuario.

source: This documentation will refer to the usage of Docker on a Ubuntu host, but you can of course run Docker also on other Linux distributions, Windows and Mac.
es: Esta documentación se referirá al uso de Docker en un host de Ubuntu, pero, por supuesto, también puede ejecutar Docker en otras distribuciones de Linux, Windows y Mac.

source: For the steps to setup Docker on Ubuntu you can jump ahead to :ref:`Ubuntu 22.04 <Ubuntu (22.04) Basic Setup>`
es: Para conocer los pasos para configurar Docker en Ubuntu, puede ir a :ref:`Ubuntu 22.04 <Ubuntu (22.04) Basic Setup>`
