Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/advanced/social/index.po
Languages: es

source: GeoNode Social Accounts
es: Cuentas sociales en GeoNode

source: Contents
es: Contenido

source: Allow GeoNode to Login throguh Social Accounts (OIDC)
es: Permitir que GeoNode inicie sesión a través de cuentas sociales (OIDC)

source: Introduction
es: Introducción

source: Through the so-called "social accounts," GeoNode allows authentication through external providers that support the OIDC (OpenID Connect) protocol, such as Google and Microsoft Azure.
es: A través de las llamadas “cuentas sociales”, GeoNode permite la autenticación a través de proveedores externos que soportan el protocolo OIDC (OpenID Connect), como Google y Microsoft Azure.

source: How does it work? Once the authentication provider is configured, GeoNode's sign-on will display a new login button that redirects the user to the external authentication page. After successfully authenticating with the external provider and accepting privacy consents, the browser will redirect the user back to the GeoNode page, prompting them to enter any missing information the first time and automatically authenticating them on subsequent occasions.
es: ¿Cómo funciona? Una vez que el proveedor de autenticación está configurado, la página de inicio de sesión de GeoNode mostrará un nuevo botón de acceso que redirige al usuario a la página de autenticación externa. Después de autenticarse exitosamente con el proveedor externo y aceptar los consentimientos de privacidad, el navegador redirigirá al usuario de vuelta a la página de GeoNode, solicitándole que ingrese cualquier información faltante la primera vez y autenticándolo automáticamente en ocasiones posteriores.

source: Usage
es: Uso

source: Once the provider has been correctly configured (see below), GeoNode will allow the user to login through it.
es: Una vez que el proveedor ha sido configurado correctamente (ver más abajo), GeoNode permitirá que el usuario inicie sesión a través de él.

source: The first time you login you will probably need to confirm you `e-mail` and other fields of the `profile`.
es: La primera vez que inicies sesión, probablemente necesitarás confirmar tu `e-mail` y otros campos del `perfil`.

source: If you want a user to be automatically signed as a member of a group, you will need to:
es: Si deseas que un usuario se registre automáticamente como miembro de un grupo, deberás:

source: Create the `GroupProfile` in GeoNode
es: Crear el `GroupProfile` en GeoNode.

source: Provide the `groups` or `roles` the user belongs to throguh the `id_token` or `user_info` metadata from the `OIDC` provider itself.
es: Proporcionar los `groups` o `roles` a los que pertenece el usuario a través del `id_token` o `user_info` metadata del propio proveedor `OIDC`.

source: Notice that, in the case you would like to benefit from this functionality:
es: Ten en cuenta que, si deseas beneficiarte de esta funcionalidad:

source: Every time the user sing-in again, the groups will be automatically re-assigned by GeoNode, and therefore it won't be possible to assign them manually anymore.
es: Cada vez que el usuario vuelva a iniciar sesión, los grupos se reasignarán automáticamente por GeoNode, por lo que no será posible asignarlos manualmente.

source: If you need a user to be recognized as a `manager` of the `groups` declared from the provider, you will need to send a claim `is_manager: True` on the user info metadata.
es: Si necesitas que un usuario sea reconocido como `manager` de los `groups` declarados por el proveedor, deberás enviar una reclamación `is_manager: True` en los metadatos de información del usuario.

source: Quick Configuration
es: Configuración rápida

source: Currently GeoNode comes with two predefined configurations that you can use to enable either Google or Microsoft Azure.
es: Actualmente, GeoNode viene con dos configuraciones predefinidas que puedes usar para habilitar Google o Microsoft Azure.

source: Add to your `.env` the following settings
es: Añade a tu `.env` las siguientes configuraciones

source: Login into GeoNode as an `admin`, go to the `Social Account` settings, create a new `geonode_openid_connect` provider and insert the
es: Inicia sesión en GeoNode como `admin`, ve a la configuración de `Social Account`, crea un nuevo proveedor `geonode_openid_connect` e inserta el

source: Advanced Configuration
es: Configuración avanzada

source: In the case you need to change the default behavior of GeoNode or add a new/custom OIDC provider, you will need to update the `settings` manually as follows.
es: En caso de que necesites cambiar el comportamiento predeterminado de GeoNode o agregar un proveedor OIDC nuevo/personalizado, deberás actualizar la `configuración` manualmente de la siguiente manera.

source: If you specify the "ID_TOKEN_ISSUER" this will take precedence trying to fetch the user info metadata from the `id_token`.
es: Si especificas "ID_TOKEN_ISSUER", esto tendrá prioridad al intentar obtener los metadatos de información del usuario del `id_token`.

source: If the `id_token` won't be available, it will try to fallback to the "PROFILE_URL" uri.
es: Si el `id_token` no está disponible, intentará volver a la URI "PROFILE_URL".

source: In the case you will need to customzie how the `Adapter` works and manages the `Groups` registration, you can inject a new class throguh the settings:
es: En caso de que necesites personalizar cómo funciona el `Adapter` y cómo gestiona el registro de `Groups`, puedes inyectar una nueva clase a través de la configuración:
