Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/contribute/translation/index.po
Languages: es

source: Contribute to Translations
es: Contribuir a las traducciones

source: Behind the scenes, GeoNode is using a software called GNU gettext further text-based translation files (django.po and djangojs.po) for translating content. If you'd like to know more about how all of this works you'll find a full description at the `Django Docs <https://docs.djangoproject.com/en/3.2/topics/i18n/translation/>`_. Following will concentrate on what is needed for edit existing or contribute a new translation.
es: Tras bastidores, GeoNode utiliza un software llamado GNU gettext y otros archivos de traducción basados en texto (django.po y djangojs.po) para traducir el contenido. Si deseas saber más sobre cómo funciona todo esto, encontrarás una descripción completa en la `Django Docs <https://docs.djangoproject.com/en/3.2/topics/i18n/translation/>`_. A continuación, nos concentraremos en lo que se necesita para editar una traducción existente o contribuir con una nueva.

source: Download the translation File
es: Descargar el archivo de traducción

source: All language files live in a specific subfolder called after their `iso code <https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes/>`_ within the `locale folder <https://github.com/GeoNode/geonode/tree/master/geonode/locale/>`_. For example, for French, the main translation file called django.po can be downloaded from `here <https://github.com/GeoNode/geonode/blob/master/geonode/locale/fr/LC_MESSAGES/django.po/>`_.
es: Todos los archivos de idioma se encuentran en una subcarpeta específica llamada según su código ISO <https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes/>`_ dentro de la carpeta de configuración regional <https://github.com/GeoNode/geonode/tree/master/geonode/locale/>`_. Por ejemplo, para francés, el archivo de traducción principal llamado django.po se puede descargar desde aquí <https://github.com/GeoNode/geonode/blob/master/geonode/locale/fr/LC_MESSAGES/django.po/>`_.

source: Next, to download the language file, we need to install an OpenSource Editor called "poedit" for editing from: https://poedit.net/download
es: A continuación, para descargar el archivo de idioma, necesitamos instalar un editor de Código Abierto llamado "poedit" para editar desde: https://poedit.net/download

source: Translation process
es: Proceso de traducción

source: Make a copy of the file before starting the translation so that you can revert in case of errors.
es: Haz una copia del archivo antes de comenzar la traducción para que pueda volver atrás en caso de errores.

source: After installing 'poedit', you should be able to double click on the '.po' file to open it. Poedit’s interface should look similar to the one shown in the picture below:
es: Después de instalar 'poedit', deberías poder hacer doble clic en el archivo '.po' para abrirlo. La interfaz de Poedit debería ser similar a la que se muestra en la siguiente imagen:

source: Poedit interface
es: Interfaz de Poedit

source: Identifying translation issues
es: Identificación de problemas de traducción

source: From the 'poedit' menu 'View', make sure that 'Entries with Errors first' is checked:
es: Desde el menú 'Ver' de 'poedit', asegúrate de que la opción 'Entradas con errores primero' esté marcada:

source: Validate translation
es: Validar traducción

source: Next click on 'Validate Translations' from the 'Catalogue' menu:
es: A continuación, haz clic en “Validar traducciones” en el menú “Catálogo”:

source: 'Poedit' will place translations which may require additional consideration on top of the list. A warning mark means that the interpretation might be not entirely consistent with the original phrase. This is not necessarily an error, just a warning asking the user to double check.
es: 'Poedit' colocará las traducciones que requieran una consideración adicional en la parte superior de la lista. Una marca de advertencia significa que la interpretación podría no ser totalmente coherente con la frase original. Esto no es necesariamente un error, solo una advertencia que solicita al usuario que vuelva a verificar.

source: Poedit warning
es: Advertencia de Poedit

source: Following to marked phrases, 'Poedit' will show untranslated sentences. When clicking on one, it can be translated through the bottom panel.
es: A continuación de las frases marcadas, 'Poedit' mostrará las frases sin traducir. Al hacer clic en una, se puede traducir a través del panel inferior.

source: During translation pay special attention to the button saying 'needs work'. In case this button is checked, the phrase will be marked as 'fuzzy' and ignored in GeoNode.
es: Durante la traducción, presta especial atención al botón que dice "necesita trabajo". Si este botón está marcado, la frase se marcará como "difusa" y se ignorará en GeoNode.

source: phrase needs work
es: La frase necesita trabajo

source: Saving translations
es: Guardar traducciones

source: As soon as the translation is complete, it must be saved and compiled. Saving is straightforward. All you have to do is clicking the 'Save' button from the top menu.
es: Una vez finalizada la traducción, hay que guardarla y compilarla. Guardar es muy sencillo: solo hay que hacer clic en el botón "Guardar" del menú superior.

source: As a last step we compile the file. Compiling the translation means to create a binary ".mo" file out of the edited ".po" file. To do so, click on "Compile to MO"
es: Como último paso, compilamos el archivo. Compilar la traducción significa crear un archivo binario ".mo" a partir del archivo ".po" editado. Para ello, haga clic en "Compilar en MO"

source: save and compile
es: guardar y compilar

source: Poedit will ask where to write the ".mo" file to, by default, this is the same folder as the edited '.po' resides in. The '.mo' file can be overwritten if necessary.
es: Poedit le preguntará dónde escribir el archivo ".mo". De manera predeterminada, es la misma carpeta en la que se encuentra el archivo ".po" editado. El archivo ".mo" se puede sobrescribir si es necesario.

source: Push translations to the repository
es: Enviar traducciones al repositorio

source: For sharing our updates, we must upload the files to GeoNode’s GitHub repository. Go to the correct file position which, in case for French is: https://github.com/GeoNode/geonode/tree/master/geonode/locale/fr/LC_MESSAGES
es: Para compartir nuestras actualizaciones, debemos subir los archivos al repositorio de GitHub de GeoNode. Vaya a la posición correcta del archivo que, en el caso del francés, es: https://github.com/GeoNode/geonode/tree/master/geonode/locale/fr/LC_MESSAGES

source: Click on "Upload Files"
es: Haga clic en "Subir archivos"

source: upload files
es: subir archivos

source: Drag the updated files into the Upload form, and write a title/description of the changes
es: Arrastra los archivos actualizados al formulario de carga y escribe un título/descripción de los cambios.

source: drag files
es: arrastrar archivos

source: Click on "Create a new branch for this commit…" and then click on the green button.
es: Haz clic en “Create a new branch for this commit…” y luego haz clic en el botón verde.

source: The last step will create a `PULL REQUEST` which can be reviewed and then approved by a developer.
es: El último paso creará una «PULL REQUEST» que puede ser revisada y luego aprobada por un desarrollador.

source: Activate updated translation at your server
es: Activar la traducción actualizada en su servidor

source: Once the files have been pushed to GitHub, it will be necessary to update your server to respect changed files.
es: Una vez que los archivos se hayan subido a GitHub, será necesario actualizar tu servidor para reflejar los archivos cambiados.

source: At this time, this can be done only by an administrator. From the server 'shell' following commands need to be executed:
es: En este momento, esto solo lo puede hacer un administrador. Desde el 'shell' del servidor se deben ejecutar los siguientes comandos:

source: Texts not listed in .po files
es: Textos no listados en archivos .po

source: In case you find a template output without corresponding translation you can add it as follows:
es: En caso de encontrar una plantilla de salida sin traducción correspondiente, puede agregarla de la siguiente manera:

source: Identify the corresponding template file which is responsible for outputting the text. Add a ``{% trans "TEXT" %}`` tag. Save the template file and run the following:
es: Identifique el archivo de plantilla correspondiente que es responsable de generar el texto. Agregue una etiqueta ``{% trans "TEXT" %}``. Guarde el archivo de plantilla y ejecute lo siguiente:

source: This will update the english .po file. also to update the language which should be edited by settings the ``-l fr`` parameter. Continue with updating the .po file as described above.
es: Esto actualizará el archivo .po en inglés. También se actualizará el idioma, que se debe editar configurando el parámetro ``-l fr``. Continúe con la actualización del archivo .po como se describe anteriormente.
