Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/install/advanced/production_enhancements/index.po
Languages: es

source: Further Production Enhancements
es: Mejoras Adicionales para Producción

source: GeoServer Production Settings
es: Configuración de producción de GeoServer

source: JVM Settings: Memory And GeoServer Options
es: Configuración de JVM: opciones de memoria y GeoServer

source: The :guilabel:`.env` file provides a way to customize GeoServer JVM Options.
es: El archivo :guilabel:`.env` proporciona una manera de personalizar las opciones de GeoServer JVM.

source: The variable ``GEOSERVER_JAVA_OPTS`` allows you to tune-up the GeoServer container and to enable specific GeoServer options.
es: La variable ``GEOSERVER_JAVA_OPTS`` le permite ajustar el contenedor GeoServer y habilitar opciones específicas de GeoServer.

source: Work with graphics-based applications in Java without an actual display, keyboard, or mouse A typical use case of UI components running in a headless environment could be an image converter app. Though it needs graphics data for image processing, a display is not really necessary. The app could be run on a server and converted files saved or sent over the network to another machine for display.
es: Trabajar con aplicaciones gráficas en Java sin necesidad de una pantalla, teclado o mouse físicos. Un caso de uso típico para componentes de interfaz de usuario en un entorno sin interfaz gráfica podría ser una aplicación de conversión de imágenes. Aunque requiere datos gráficos para procesar las imágenes, no necesita una pantalla. La aplicación podría ejecutarse en un servidor, y los archivos convertidos guardarse o enviarse a través de la red a otra máquina para su visualización.

source: This means that your JVM will be started with Xms amount of memory and will be able to use a maximum of Xmx amount of memory. Above will start a JVM like with 2 GB of memory and will allow the process to use up to 4 GB of memory. You need to adjust this value depening on your availabnle RAM.
es: Esto significa que tu JVM se iniciará con una cantidad de memoria especificada por Xms y podrá utilizar un máximo de memoria especificado por Xmx. Lo anterior iniciará una JVM con 2 GB de memoria y permitirá que el proceso use hasta 4 GB de memoria. Necesitas ajustar este valor dependiendo de tu RAM disponible.

source: The GeoServer web admin employs a CSRF (Cross-Site Request Forgery) protection filter that will block any form submissions that didn’t appear to originate from GeoServer. This can sometimes cause problems for certain proxy configurations. You can disable the CSRF filter by setting the GEOSERVER_CSRF_DISABLED property to true. https://docs.geoserver.org/stable/en/user/security/webadmin/csrf.html
es: El administrador web de GeoServer emplea un filtro de protección CSRF (falsificación de solicitudes entre sitios) que bloqueará cualquier envío de formulario que no parezca originarse en GeoServer. En ocasiones, esto puede causar problemas con determinadas configuraciones de proxy. Puedes deshabilitar el filtro CSRF configurando la propiedad GEOSERVER_CSRF_DISABLED en TRUE. https://docs.geoserver.org/stable/en/user/security/webadmin/csrf.html

source: Whenever you need to change one or more of the JVM options, you will need to restart the GeoServer Docker container.
es: Cada vez que necesites cambiar una o más opciones de la JVM, tendrás que reiniciar el contenedor Docker de GeoServer.

source: This command will **preserve** all the GeoServer configuration and data, since the ``GEOSERVER_DATA_DIR`` is stored on a Docker static volume.
es: Este comando **preservará** toda la configuración y los datos de GeoServer, ya que ``GEOSERVER_DATA_DIR`` se almacena en un volumen estático de Docker.

source: Nevertheless, any change you have made manually to the container, e.g. added a new plugin to GeoServer or updated some JARs into the ``WEB-INF/lib`` library folder, will be lost.
es: Sin embargo, cualquier cambio que hayas hecho manualmente en el contenedor, como agregar un nuevo plugin a GeoServer o actualizar algunos JARs en la carpeta de la biblioteca ``WEB-INF/lib``, se perderá.

source: You will need to add the JARs again and restart GeoServer *softly*
es: Deberás agregar los JAR nuevamente y reiniciar GeoServer *suavemente*

source: Global And Services Settings
es: Configuración global y de servicios

source: Check the GeoServer Memory usage and status; ensure the ``GEOSERVER_DATA_DIR`` path points to the static volume
es: Verifica el uso y el estado de la memoria del GeoServer; asegúrate que la ruta ``GEOSERVER_DATA_DIR`` apunte al volumen estático

source: *GeoServer Status*
es: *Estado de GeoServer*

source: GeoServer :guilabel:`Global Settings`; make sure the ``Proxy Base Url`` points to the publlc URL and the ``LOGGING`` levels are set to :guilabel:`Production Mode`
es: GeoServer :guilabel:`Global Settings`; asegúrese de que ``Proxy Base Url`` apunte a la URL pública y que los niveles de ``LOGGING`` estén configurados en :guilabel:`Production Mode`

source: *Global Settings*
es: *Ajustes globales*

source: GeoServer :guilabel:`Image Processing Settings`; unless you are using some specific renderer or GeoServer plugin, use the following recommended options
es: GeoServer :guilabel:`JAI`; a menos que esté utilizando algún renderizador específico o complemento de GeoServer, use las siguientes opciones recomendadas

source: Further details at https://docs.geoserver.org/stable/en/user/configuration/image_processing/index.html#image-processing
es: Más detalles en https://docs.geoserver.org/stable/en/user/configuration/image_processing/index.html#image-processing

source: *Image Processing Settings*
es: *Configuración de procesamiento de imágenes*

source: Tune up :guilabel:`GeoServer Services Configuration`; :guilabel:`WCS`, :guilabel:`WFS`, :guilabel:`WMS` and :guilabel:`WPS`;
es: Puesta a punto :guilabel:`Configuración de Servicios GeoServer`; :guilabel:`WCS`, :guilabel:`WFS`, :guilabel:`WMS` y :guilabel:`WPS`;

source: **WCS**: Update the limits accordingly to your needs. Do not use very high values, this will set GeoServer prone to DoS Attacks.
es: **WCS**: Actualiza los límites según tus necesidades. No utilices valores muy altos, esto hará que GeoServer sea propenso a ataques DoS.

source: *WCS Resource Consuption Limits*
es: *Límites de consumo de recursos de WCS*

source: **WMS**: Specify here the SRS List you are going to use. Empty means all the ones supported by GeoServer, but be carefull since the ``GetCapabilities`` output will become huge.
es: **WMS**: Especifica aquí la Lista SRS que vas a utilizar. Vacío significa todos los soportados por GeoServer, pero tenga cuidado ya que la salida ``GetCapabilities`` será enorme.

source: *WMS Supported SRS List*
es: *Lista de SRS compatibles con WMS*

source: **WMS**: :guilabel:`Raster Rendering Options` allows you to tune up the WMS output for better performance or quality. Best Performance: ``Nearest Neighbour`` - Best Quality: ``Bicubic``
es: **WMS**: :guilabel:`Opciones de renderizado raster` Te permite ajustar la salida WMS para un mejor rendimiento o calidad. Mejor rendimiento: ``Vecino más cercano`` - Mejor calidad: ``Bicúbica``

source: Raster Images should be always optimized before ingested into GeoNode. The general recommendation is to **never** upload a non-processed GeoTIFF image to GeoNode.
es: Las imágenes raster siempre deben ser optimizadas antes de ser ingresadas en GeoNode. La recomendación general es **nunca** subir una imagen GeoTIFF no procesada a GeoNode.

source: Further details at:
es: Más detalles en:

source: *WMS Raster Rendering Options*
es: *Opciones de renderizado ráster WMS*

source: **WMS**: Update the limits accordingly to your needs. Do not use very high values, this will set GeoServer prone to DoS Attacks.
es: **WMS**: Actualiza los límites según tus necesidades. No utilices valores muy altos, esto hará que GeoServer sea propenso a ataques DoS.

source: *WMS Resource Consuption Limits*
es: *Límites de consumo de recursos WMS*

source: GeoWebCache DiskQuota On Postgis
es: GeoWebCache DiskQuota en Postgis

source: By default GeoWebCache DiskQuota is disabled. That means that the layers cache might potentially grow up indefinitely.
es: De forma predeterminada, GeoWebCache DiskQuota está deshabilitado. Eso significa que la caché de capas podría crecer indefinidamente.

source: GeoWebCache DiskQuota should be always enabled on a production system. In the case it is enabled, this **must** be configured to make use of a DB engine like Postgis to store its indexes.
es: GeoWebCache DiskQuota siempre debe estar habilitado en un sistema de producción. En el caso de que esté habilitado, esto **debe** configurarse para utilizar un motor de base de datos como Postgis para almacenar sus índices.

source: First of all ensure :guilabel:`Tile Caching` is enabled on all available layers
es: En primer lugar, asegúrese de que :guilabel:`Tile Caching` esté habilitado en todas las capas disponibles.

source: GeoNode tipically does this automatically for you. It is worth to double check anyway.
es: GeoNode normalmente hace esto automáticamente por ti. Vale la pena volver a comprobarlo de todos modos.

source: *Tile Caching: Tiled Datasets*
es: *Almacenamiento en Caché de Teselas: Conjuntos de Datos Teselados*

source: Configure :guilabel:`Disk Quota` by providing the connection string to the DB Docker Container as specified in the :guilabel:`.env` file
es: Configure :guilabel:`Cuota de disco` proporcionando la cadena de conexión al DB Docker Container como se especifica en el archivo :guilabel:`.env`

source: *Tile Caching: Disk Quota Configuration*
es: *Almacenamiento en caché de mosaicos: configuración de cuota de disco*

source: GeoFence Security Rules On Postgis
es: Reglas de seguridad de GeoFence en Postgis

source: By default GeoFence stores the security rules on an :guilabel:`H2` db.
es: Por defecto, GeoFence almacena las reglas de seguridad en una base de datos :guilabel:`H2`.

source: On a production system, this is not really recommended. You will need to update the GeoServer Docker container in order to enable GeoFence storing the rules into the DB Docker Container instead.
es: En un sistema de producción, esto no es realmente recomendable. Tendrás que actualizar el contenedor Docker de GeoServer para habilitar que GeoFence almacene las reglas en el contenedor de base de datos Docker en su lugar.

source: In order to do that, follow the procedure below:
es: Para hacer eso, sigue el procedimiento a continuación:

source: Make sure to provide the same connection parameters specified in the :guilabel:`.env` file
es: Asegúrate de proporcionar los mismos parámetros de conexión especificados en el archivo :guilabel:`.env`

source: The container is ready to be restarted now.
es: El contenedor está listo para reiniciarse ahora.

source: Remember to do a **soft restart** otherwise the WEB-INF/lib JARs will be reset to the original state
es: Recuerda realizar un **reinicio suave**; de lo contrario, los archivos JAR WEB-INF/lib se restablecerán al estado original.

source: **IMPORTANT**: The first time you perform this procedure, GeoFence won't be able to retrieve the old security rules anymore.
es: **IMPORTANTE**: La primera vez que realices este procedimiento, GeoFence ya no podrá recuperar las reglas de seguridad antiguas.

source: You will need to :ref:`fixup_geonode_layers_permissions` in order to regenerate the security rules.
es: Necesitará :ref:`fixup_geonode_layers_permissions` para poder regenerar las reglas de seguridad.

source: Fixup GeoNode Datasets Permissions
es: Corregir los permisos de los conjuntos de datos de GeoNode

source: The list of the GeoFence Security Rules is available from the :guilabel:`GeoFence Data Rules` section.
es: La lista de reglas de seguridad de GeoFence está disponible en la sección :guilabel:`GeoFence Data Rules`.

source: Always double check the list is accessible and the data rules are there. If empty, no layer will be accessible by standard users other than admin.
es: Siempre verifica que la lista sea accesible y que las reglas de datos estén presentes. Si está vacía, ningún usuario estándar, aparte del administrador, podrá acceder a ninguna capa.

source: *GeoFence Data Rules*
es: *Reglas de datos de GeoFence*

source: In order to re-sync the GeoFence security rules, follow the procedure below:
es: Para volver a sincronizar las reglas de seguridad de GeoFence, sigue el procedimiento a continuación:

source: Regenerate GeoNode Datasets Thumbnails
es: Regenerar las miniaturas de los conjuntos de datos de GeoNode

source: The following procedure allows you to *batch* regenerate all Datasets Thumbnails:
es: El siguiente procedimiento te permite *regenerar en lotes* todas las miniaturas de los conjuntos de datos:

source: Regenerate GeoNode Datasets BBOXES
es: Regenerar los BBOXES de los conjuntos de datos de GeoNode

source: The following procedure allows you to *batch* regenerate all Datasets BBOXES:
es: El siguiente procedimiento permite *re-generar en lote* todos los BBOXES de los conjuntos de datos:

source: Fixup GeoNode Datasets Metadata And Download Links
es: Corregir Metadatos y Enlaces de Descarga de los Conjuntos de Datos de GeoNode

source: The following procedure allows you to fix-up broken or incorrect Metadata Links:
es: El siguiente procedimiento te permite reparar enlaces de metadatos rotos o incorrectos:

source: It is also possible to *force* purging the links before regenerating:
es: También es posible *forzar* la eliminación de los enlaces antes de regenerarlos:

source: Migrate GeoNode To A New Hostname
es: Migrar GeoNode a un nuevo nombre de host

source: In the case you will need to move your instance to another domain, as an example from ``https://my_geonode.geonode.org/`` to ``https://prod_geonode.geonode.org/``, follow the procedure below:
es: En el caso de que necesite mover su instancia a otro dominio, como por ejemplo de ``https://my_geonode.geonode.org/`` a ``https://prod_geonode.geonode.org/``, siga las instrucciones procedimiento a continuación:

source: Update the :guilabel:`.env` file by specifyig the new name accordingly.
es: Actualice el archivo :guilabel:`.env` especificando el nuevo nombre en consecuencia.

source: Restart the GeoNode Docker Container.
es: Reiniciar el Contenedor Docker de GeoNode.

source: Run the following management commands from inside the GeoNode Docker Container.
es: Ejecuta los siguientes comandos de gestión desde dentro del Contenedor Docker de GeoNode.

source: Add Huge Or DB Datasets To Your Instance
es: Añadir conjuntos de datos grandes o de base de datos a tu instancia

source: Uploaing huge datasets, or DB tables, to GeoNode from the :guilabel:`Web Upload Interface` is not really possible sometimes.
es: A veces, no es posible subir conjuntos de datos grandes o tablas de bases de datos a GeoNode desde la :guilabel:`Interfaz de Carga Web`.

source: The suggested procedure in such cases is the following one:
es: El procedimiento sugerido en tales casos es el siguiente:

source: Add the dataset to :guilabel:`GeoServer` first directly.
es: Primero, añade el conjunto de datos directamente a :guilabel:`GeoServer`.

source: You must upload the data into the GeoServer Docker Container Static Volume first and then adding manually the layer throught the :guilabel:`GeoServer Admin GUI`.
es: Debes subir los datos al volumen estático del contenedor Docker de GeoServer y luego añadir manualmente la capa a través de la :guilabel:`GeoServer Admin GUI`.

source: Once the dataset is correctly configured on GeoServer, run the following management command from inside the GeoNode Docker Container
es: Una vez que el conjunto de datos esté correctamente configurado en GeoServer, ejecuta el siguiente comando de gestión desde dentro del contenedor Docker de GeoNode
