Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/async/index.po
Languages: es

source: Supervisord and Systemd
es: Supervisord y Systemd

source: Rabbitmq and Redis
es: Rabbitmq y Redis

source: How to: Async Upload via API
es: Cómo realizar una subida asíncrona a través de la API

source: In geonode is possible to upload resources via API in async/sync way.
es: En GeoNode es posible subir recursos a través de la API de manera asíncrona o sincrónica.

source: Here is available a full example of upload via API https://github.com/GeoNode/geonode/blob/582d6efda74adb8042d1d897004bbf764e6e0285/geonode/upload/api/tests.py#L416
es: Aquí está disponible un ejemplo completo de carga a través de API https://github.com/GeoNode/geonode/blob/582d6efda74adb8042d1d897004bbf764e6e0285/geonode/upload/api/tests.py#L416

source: Step 1
es: Paso 1

source: Create a common client session, this is foundamental due the fact that geonode will check the request session. For example with requests we will do something like:
es: Crear una sesión de cliente común, esto es fundamental debido a que geonode verificará la sesión de solicitud. Por ejemplo, con las solicitudes haremos algo como:

source: Note: in Django this part is already managed
es: Nota: en Django esta parte ya está gestionada

source: Step 2
es: Paso 2

source: Call the `api/v2/uploads/upload` endpoint in PUT (is a form-data endpoint) by specifing in files a dictionary with the names and the files that we want to uploads and a data payload with the required informations. For example:
es: Llama al endpoint `api/v2/uploads/upload` con el método PUT (es un endpoint de tipo form-data), especificando en files un diccionario con los nombres y los archivos que deseas subir, y un payload de datos con la información requerida. Por ejemplo:

source: Step 3
es: Paso 3

source: Call in the final upload page in order to trigger the actual import. If correclty set, Geoserver will manage the upload asyncronously.
es: Llamar a la página de carga final para activar la importación real. Si se configura correctamente, Geoserver gestionará la carga de forma asincrónica.

source: The `import_id` is returned from the previous step
es: El `import_id` se devuelve del paso anterior

source: Step 4
es: Paso 4

source: The upload as been completed on GeoNode, we should check utill Geoserver has complete his part. To do so, is enougth to call the detailed information about the upload that we are performing
es: La carga se ha completado en GeoNode, debemos comprobar que Geoserver ha completado su parte. Para ello, basta con llamar a la información detallada sobre la carga que estamos realizando

source: When the status is `PROCESSED` and the completion is `100%` we are able to see the resource in geonode and geoserver
es: Cuando el estado es `PROCESSED` y la finalización es `100%` podemos ver el recurso en geonode y geoserver
