Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/geostory/index.po
Languages: es

source: GeoStory
es: GeoHistorias

source: GeoStory is a MapStore tool integrated in GeoNode that provides the user a way to create inspiring and immersive stories by combining text, interactive maps, and other multimedia content like images and video or other third party contents. Through this tool you can simply tell your stories on the web and then publish and share them with different groups of GeoNode users or make them public to everyone around the world.
es: GeoStory es una herramienta MapStore integrada en GeoNode que proporciona al usuario una forma de crear historias inspiradoras e inmersivas combinando texto, mapas interactivos y otro contenido multimedia como imágenes y videos u otros contenidos de terceros. A través de esta herramienta puedes simplemente contar tus historias en la web y luego publicarlas y compartirlas con diferentes grupos de usuarios de GeoNode o hacerlas públicas para todos en todo el mundo.

source: To build a new GeoStory go to :guilabel:`Add Resource` option on the *All Resources* page and choose option *Create geostory* or select :guilabel:`New` option on the *Geostories* page
es: Para crear una nueva GeoHistory, vaya a la opción :guilabel:`Agregar recurso` en la página *Todos los recursos* y elija la opción *Crear GeoHistory* o seleccione la opción :guilabel:`Nuevo` en la página *Geostories*

source: *Create geostory from All Resources page*
es: *Crear geohistory desde la página Todos los recursos*

source: *Create geostory from Geostories page*
es: *Crear geohistory desde la página Geostories*

source: Now you landed on the GeoStory edition page that is composed of the following sections:
es: Ahora has llegado a la página de la edición GeoStory que se compone de las siguientes secciones:

source: *New GeoStory Apps option*
es: *Nueva opción de aplicaciones GeoStory*

source: The GeoStory content is organized in Sections, that can be added with the |add_section| button in the *Container* area. In particular, the user can add to the story the following kind of sections:
es: El contenido de GeoStory está organizado en Secciones, que se pueden agregar con |add_section| en el área *Contenedor*. En particular, el usuario puede añadir a la historia el siguiente tipo de secciones:

source: *GeoStory Sections Types*
es: *Tipos de secciones de GeoStory*

source: For more information on these specific section please follow the official MapStore documentation:
es: Para obtener más información sobre esta sección específica, siga la documentación oficial de MapStore:

source: `Title Section <https://mapstore.readthedocs.io/en/latest/user-guide/title-section/>`_
es: `Sección de título <https://mapstore.readthedocs.io/en/latest/user-guide/title-section/>`_

source: `Banner Section <https://mapstore.readthedocs.io/en/latest/user-guide/banner-section/>`_
es: `Sección de banner <https://mapstore.readthedocs.io/en/latest/user-guide/banner-section/>`_

source: `Paragraph Section <https://mapstore.readthedocs.io/en/latest/user-guide/paragraph-section/>`_
es: `Sección de párrafo <https://mapstore.readthedocs.io/en/latest/user-guide/paragraph-section/>`_

source: `Immersive Section <https://mapstore.readthedocs.io/en/latest/user-guide/immersive-section/>`_
es: `Sección inmersiva <https://mapstore.readthedocs.io/en/latest/user-guide/immersive-section/>`_

source: `Media Section <https://mapstore.readthedocs.io/en/latest/user-guide/media-section/>`_
es: `Sección de medios <https://mapstore.readthedocs.io/en/latest/user-guide/media-section/>`_

source: `Web Page Section <https://mapstore.readthedocs.io/en/latest/user-guide/web-section/>`_
es: `Sección de página web <https://mapstore.readthedocs.io/en/latest/user-guide/web-section/>`_

source: Add GeoNode content to GeoStory
es: Agregar contenido de GeoNode a GeoStory

source: With GeoNode you can add content to your GeoStory using internal GeoNode documents and maps as well external sources. This ability to add internal GeoNode content makes the GeoStory creation a very usefull feature.
es: Con GeoNode puedes agregar contenido a tu GeoStory utilizando documentos y mapas internos de GeoNode, así como fuentes externas. Esta capacidad de agregar contenido interno de GeoNode hace que la creación de GeoStory sea una característica muy útil.

source: To add GeoNode content to your GeoStory use the |edit_mode| button on top of your GeoStory section.
es: Para agregar contenido de GeoNode a su GeoStory usa el botón |edit_mode| en la parte superior de la sección GeoStory.

source: From here you can add :guilabel:`Images`, :guilabel:`Videos` and :guilabel:`Maps`. To enable GeoNode internal catalog, on :guilabel:`Services` dropdown choose :guilabel:`GeoNode` as shown in picture down. On the left you get a list of media documents available with a complementary text filter feature on top.
es: Desde aquí puedes añadir :guilabel:`Imágenes`, :guilabel:`Vídeos` y :guilabel:`Mapas`. Para habilitar el catálogo interno de GeoNode, en el menú desplegable :guilabel:`Servicios` elije :guilabel:`GeoNode` como se muestra en la imagen de abajo. A la izquierda aparece una lista de documentos multimedia disponibles con una función de filtro de texto complementaria en la parte superior.

source: *Add Media to GeoStory*
es: *Agregar medios a GeoStory*

source: To save your GeoStory, on the top your Geostory content choose :guilabel:`Save` and then :guilabel:`Save as...`
es: Para guardar tu GeoStory, en la parte superior del contenido de tu Geostory elije :guilabel:`Guardar` y luego :guilabel:`Guardar como...`

source: Now your GeoStory can be shared with everyone!
es: ¡Ahora tu GeoStory se puede compartir con todos!

source: Further Reading
es: Otras lecturas

source: Follow the link below to get more detailed information about the usage of GeoStory.
es: Sigue el enlace a continuación para obtener información más detallada sobre el uso de GeoStory.

source: `GeoStory Documentation <https://mapstore.readthedocs.io/en/latest/user-guide/exploring-stories>`_
es: `Documentación de GeoStory <https://mapstore.readthedocs.io/en/latest/user-guide/exploring-stories>`_
