Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/thesaurus/index.po
Languages: es

source: Introduction
es: Introducción

source: GeoNode can import a thesaurus (or multiple thesauri) in order to index resources against subject terms or keywords. Thesauri can be managed manually in the admin panel, or imported as `SKOS RDF <https://www.w3.org/2004/02/skos/>`_ using either the admin panel or the command-line:
es: GeoNode puede importar un tesauro (o varios) para indexar recursos en función de términos temáticos o palabras clave. Los tesauros se pueden gestionar manualmente en el panel de administración o se pueden importar como `SKOS RDF <https://www.w3.org/2004/02/skos/>`_ mediante el panel de administración o la línea de comandos:

source: Upload via the Admin panel
es: Subir a través del panel de administración

source: Navigate to the thesaurus page in the admin panel ``http://<your_geonode_host>/admin/base/thesaurus``. On the top-right of the page a button named :guilabel:`Upload thesaurus` will be available:
es: Ve a la página del tesauro en el panel de administración ``http://<your_geonode_host>/admin/base/thesaurus``. En la parte superior derecha de la página, estará disponible un botón llamado :guilabel:`Upload thesaurus`:

source: After clicking on it, a simple form for the upload will be shown which will allow you to select your desired RDF file:
es: Después de hacer clic en él, se mostrará un formulario simple para la carga que le permitirá seleccionar el archivo RDF deseado:

source: By clicking on `Upload RDF`, the system will load the thesaurus and assign it a "slugified" name based on the file name. The name can be easily change later in the edit page.
es: Al hacer clic en "Upload RDF", el sistema cargará el diccionario de sinónimos y le asignará un nombre "slugified" basado en el nombre del archivo. El nombre se puede cambiar fácilmente más adelante en la página de edición.

source: If everything goes fine, a success message will be shown:
es: Si todo va bien, se mostrará un mensaje de éxito:

source: Otherwise the UI will show the error message:
es: De lo contrario, la interfaz de usuario mostrará el mensaje de error:

source: Import via the ``load_thesaurus`` command
es: Importar mediante el comando ``load_thesaurus``

source: A thesaurus can also be loaded into GeoNode by using the ``load_thesaurus`` management command:
es: También se puede cargar un tesauro en GeoNode utilizando el comando de administración ``load_thesaurus``:

source: For example, in order add the `INSPIRE Spatial Data Themes <https://www.eionet.europa.eu/gemet/en/inspire-themes/>`_ thesaurus into a GeoNode instance, download it as file ``inspire-theme.rdf`` with the command:
es: Por ejemplo, para agregar el tesauro `INSPIRE Spatial Data Themes <https://www.eionet.europa.eu/gemet/en/inspire-themes/>`_ a una instancia de GeoNode, descárgalo como archivo ``inspire-theme.rdf`` con el comando:

source: and then issue the command:
es: y luego emita el comando:

source: The ``name`` is the identifier you'll use to refer to this thesaurus in your GeoNode instance.
es: El «nombre» es el identificador que utilizará para hacer referencia a este tesauro en su instancia de GeoNode.

source: If you only want to make sure that a thesaurus file will be properly parsed, give the ``--dry-run`` parameter, so that nothing will be added to the DB.
es: Si solo deseas asegurarte que un archivo de diccionario de sinónimos se analizará correctamente, proporciona el parámetro ``--dry-run``, para que no se agregue nada a la base de datos.

source: *Note*: if the ``name`` starts with the string ``fake``, the file will not be accessed at all, and some test keywords will be added to a fake new thesaurus. In this case the ``dry-run`` param will not be used.
es: *Nota*: si el ``nombre`` comienza con la cadena ``fake``, no se accederá al archivo y se agregarán algunas palabras clave de prueba a un nuevo tesauro falso. En este caso, no se utilizará el parámetro ``dry-run``.

source: Configure a thesaurus in GeoNode
es: Configurar un tesauro en GeoNode

source: Configuration from `Admin`
es: Configuración desde `Admin`

source: After you loaded a thesaurus into GeoNode, it should be configured in the :guilabel:`Admin` panel.
es: Después de cargar un tesauro en GeoNode, debe configurarse en el panel de administración.

source: The panel can be reached from :guilabel:`Admin` link of the *User Menu* in the navigation bar or through this URL: ``http://<your_geonode_host>/admin/base/thesaurus``.
es: Se puede acceder al panel desde el enlace :guilabel:`Admin` del *User Menu* en la barra de navegación o a través de esta URL: ``http://<your_geonode_host>/admin/base/thesaurus``.

source: Once you are on the Thesaurus lists, select one thesaurus to open the Edit page
es: Una vez que esté en las listas de tesauros, selecciona un tesauro para abrir la página Editar

source: *The GeoNode Thesaurus edit Interface*
es: *La interfaz de edición del tesauro GeoNode*

source: ``identifier``: (mandatory string) the identifier you used in the ``load_thesaurus`` commands.
es: ``identifier``: (cadena obligatoria) el identificador que utilizó en los comandos ``load_thesaurus``.

source: ``title``: (mandatory string) The title of the thesaurus, set initially by the ``load_thesaurus`` command.
es: ``title``: (cadena obligatoria) El título del tesauro, establecido inicialmente por el comando ``load_thesaurus``.

source: ``date``: (mandatory date) The Date of the thesaurus, set initially by the ``load_thesaurus`` command.
es: ``date``: (fecha obligatoria) La fecha del tesauro, establecida inicialmente por el comando ``load_thesaurus``.

source: ``description``: (mandatory string) The description of the thesaurus, set initially by the ``load_thesaurus`` command.
es: ``description``: (cadena obligatoria) La descripción del tesauro, establecida inicialmente por el comando ``load_thesaurus``.

source: ``slug``: (mandatory string) The slug of the thesaurus, set initially by the ``load_thesaurus`` command.
es: ``slug``: (cadena obligatoria) El slug del tesauro, establecido inicialmente por el comando ``load_thesaurus``.

source: ``about``: (optional string) The about of the thesaurus, set initially by the ``load_thesaurus`` command.
es: ``about``: (cadena opcional) La información acerca del tesauro, establecida inicialmente por el comando ``load_thesaurus``.

source: ``card min``: (optional integer) The minimum cardinality, default = 0
es: ``card min``: (entero opcional) La cardinalidad mínima, predeterminado = 0

source: ``card max``: (optional integer) The maximum cardinality, default = -1
es: ``card max``: (entero opcional) La cardinalidad máxima, predeterminado = -1

source: ``facet``: (boolean) Decide if the thesaurus will be shown in the facet list, default: True
es: ``facet``: (booleano) Decide si el tesauro se mostrará en la lista de facetas, valor predeterminado: True

source: ``order``: (integer) Decide the listing order of the thesaurus in the facet list and in the metadata editor, default: 0, asc order from 0 to N
es: ``order``: (entero) Decide el orden de listado del tesauro en la lista de facetas y en el editor de metadatos, predeterminado: 0, orden ascendente de 0 a N

source: Cardinality:
es: Cardinalidad:

source: `card_max=0` --> Disabled, The Thesaurus will not appear in the GUI
es: `card_max=0` --> Deshabilitado, el tesauro no aparecerá en la GUI

source: `card_max=1` & `card_min = 0` --> Single choice, optional.
es: `card_max=1` & `card_min = 0` --> Opción única, opcional.

source: `card_max=1` & `card_min = 1` --> Single choice, required
es: `card_max=1` & `card_min = 1` --> Opción única, obligatoria

source: `card_max=-1` & `card_min = 0` --> [0..N] Multiple choices, optional
es: `card_max=-1` & `card_min = 0` --> [0..N] Opciones múltiples, opcional

source: `card_max=-1` & `card_min = 1` --> [1..N] Multiple choices, required
es: `card_max=-1` & `card_min = 1` --> [1..N] Opciones múltiples, obligatorias

source: After the setup, in `Editing Tools -> Metadata -> Wizard` the thesaurus block will be shown like the following image:
es: Después de la configuración, en `Editing Tools -> Metadata -> Wizard` el bloque de tesauro se mostrará como en la siguiente imagen:

source: *The metadata interface with the Thesaurus enabled*
es: *La interfaz de metadatos con el Tesauro habilitado*

source: Configuration via `settings.py`
es: Configuración a través de `settings.py`

source: *Deprecated* The Thesaurus configuration via settings is deprecated, will be removed in the future.
es: *Obsoleto* La configuración del Tesauro a través de los ajustes está obsoleta y será eliminada en el futuro.

source: After you loaded a thesaurus into GeoNode, it should be configured in the ``settings.py`` file (or in the ``local_settings``) in this way:
es: Después de cargar un tesauro en GeoNode, debe configurarse en el archivo ``settings.py`` (o en ``local_settings``) de esta manera:

source: ``name``: (mandatory string) the identifier you used in the ``load_thesaurus`` commands.
es: ``name``: (cadena obligatoria) el identificador que utilizó en los comandos ``load_thesaurus``.

source: ``required``: (optional boolean) if ``True``, a keyword of this thesaurus is mandatory to complete the metadata. *Currently not implemented.*
es: ``required``: (booleano opcional) si es ``True``, una palabra clave de este tesauro es obligatoria para completar los metadatos. *Actualmente no implementado.*

source: ``filter``: (optional boolean) if ``True``, a faceted list of keywords of this thesaurus will be presented on the search page.
es: ``filter``: (booleano opcional) si es ``True``, se presentará una lista por facetas de palabras clave de este tesauro en la página de búsqueda.

source: So, in order to set up the INSPIRE themes thesaurus you may set the THESAURUS value as:
es: Entonces, para configurar el tesauro de temas de INSPIRE, puede establecer el valor de TESAURO como:

source: Apply a thesaurus to a resource
es: Aplicar un tesauro a un recurso

source: After you've finished the setup you should find a new input widget in each resource metadata wizard allowing you to choose a thesaurus for your resource.
es: Una vez que haya terminado la configuración, deberías encontrar un nuevo widget de entrada en cada asistente de metadatos de recursos que le permitirá elegir un tesauro para su recurso.

source: After applying a thesaurus to resources those should be listed in the filter section in GeoNode's resource list views:
es: Después de aplicar un tesauro a los recursos, estos deberían aparecer en la sección de filtro en las vistas de lista de recursos de GeoNode:

source: thesauarus
es: tesauro

source: Exporting a thesaurus as RDF via the ``dump_thesaurus`` command
es: Exportar un tesauro como RDF mediante el comando ``dump_thesaurus``

source: GeoNode thesauri can be exported as RDF using the ``dump_thesaurus`` command:
es: Los tesauros de GeoNode se pueden exportar como RDF utilizando el comando ``dump_thesaurus``:

source: The ``-n|--name`` argument refers, like the ``load_thesaurus`` command, to the thesaurus's identifier in GeoNode, as opposed to its title. If uploaded via the admin interface this is derived automatically from its file name. Information about thesauri can be shown on the command-line using ``dump_thesaurus`` with just the ``-l|--list`` option.
es: El argumento ``-n|--name`` se refiere, al igual que el comando ``load_thesaurus``, al identificador del tesauro en GeoNode, en lugar de a su título. Si se carga a través de la interfaz de administración, esto se deriva automáticamente de su nombre de archivo. La información sobre los tesauros se puede mostrar en la línea de comandos utilizando ``dump_thesaurus`` con solo la opción ``-l|--list``.
