Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/start/index.po
Languages: es

source: GeoNode Basics
es: Conceptos básicos de Geonode

source: is a platform for the management and publication of geospatial data. It brings together mature open-source software projects under an easy to use interface.
es: es una plataforma para la gestión y publicación de datos geoespaciales. Reúne proyectos maduros de software de código abierto en una interfaz fácil de usar.

source: *GeoNode simplified architecture*
es: *Arquitectura simplificada de GeoNode*

source: *With GeoNode, non-specialized users can share data and create interactive maps.*
es: *Con GeoNode, los usuarios no especializados pueden compartir datos y crear mapas interactivos.*

source: Geospatial data storage
es: Almacenamiento de datos geoespaciales

source: GeoNode allows users to upload vector data (currently shapefiles, json, csv, kml and kmz) and raster data in their original projections using a web form.
es: GeoNode permite a los usuarios cargar datos vectoriales (actualmente archivos de forma, json, csv, kml y kmz) y datos ráster en sus proyecciones originales mediante un formulario web.

source: Vector data is converted into geospatial tables on a DB, satellite imagery and other kinds of raster data are retained as GeoTIFFs.
es: Los datos vectoriales se convierten en tablas geoespaciales en una base de datos, las imágenes de satélite y otros tipos de datos ráster se conservan como GeoTIFF.

source: Special importance is given to standard metadata formats like ISO 19139:2007 / ISO 19115 metadata standards.
es: Se da especial importancia a los formatos de metadatos estándar como los estándares de metadatos ISO 19139:2007 / ISO 19115.

source: As soon as the upload is finished, the user can fill the resource metadata in order to make it suddenly available through the `CSW`_ (OGC Catalogue Service) endpoints and APIs.
es: Tan pronto como se complete la carga, el usuario puede completar los metadatos del recurso para hacerlo disponible de inmediato a través de los endpoints y APIs del `CSW`_ (Servicio de Catálogo OGC).

source: Users may also upload a metadata XML document (ISO, FGDC, and Dublin Core format) to fill key GeoNode metadata elements automatically.
es: Los usuarios también pueden cargar un documento XML de metadatos (formato ISO, FGDC y Dublin Core) para completar automáticamente los elementos clave de metadatos de GeoNode.

source: Similarly, GeoNode provides a web based styler that lets the users to change the data portrayals and preview the changes at real time.
es: De manera similar, GeoNode proporciona un estilizador basado en web que permite a los usuarios cambiar las representaciones de datos y obtener una vista previa de los cambios en tiempo real.

source: Data mixing, maps creation
es: Mezcla de datos, creación de mapas.

source: Once the data has been uploaded, GeoNode lets the user search for it geographically or via keywords in order to create fancy maps.
es: Una vez cargados los datos, GeoNode permite al usuario buscarlos geográficamente o mediante palabras clave para crear mapas sofisticados.

source: All the datasets are automatically re-projected to web Mercator for maps display, making it possible to use different popular base datasets, like Open Street Map, Google Satellite or Bing datasets.
es: Todos los conjuntos de datos se reproyectan automáticamente a Web Mercator para la visualización en mapas, lo que permite utilizar diferentes conjuntos de datos base populares, como OpenStreetMap, Google Satellite o Bing.

source: Once the maps are saved, it is possible to embed them in any web page or get a PDF version for printing.
es: Una vez guardados los mapas, es posible incrustarlos en cualquier página web u obtener una versión PDF para imprimir.

source: GeoNode as a building block
es: GeoNode como bloque de construcción

source: A handful of other Open Source projects extend GeoNode's functionality by tapping into the re-usability of Django applications.
es: Un puñado de otros proyectos de código abierto amplían la funcionalidad de GeoNode aprovechando la reutilización de las aplicaciones Django.

source: Visit our gallery to see how the community uses GeoNode: `GeoNode Projects <http://geonode.org/gallery/>`_.
es: Visite nuestra galería para ver cómo la comunidad usa GeoNode: `GeoNode Projects <http://geonode.org/gallery/>`_.

source: The development community is very supportive of new projects and contributes ideas and guidance for newcomers.
es: La comunidad de desarrollo apoya mucho los nuevos proyectos y aporta ideas y orientación para los recién llegados.

source: Convinced! Where do I sign?
es: ¡Convencido! ¿Dónde firmo?

source: The next steps are:
es: Los siguientes pasos son:

source: Make a ride on the :ref:`online_demo`
es: Haz un paseo en :ref:`online_demo`

source: Follow the :ref:`quick_setup_guide` in order to play with your own local instance and access all the admin functionalities
es: Siga la :ref:`quick_setup_guide` para jugar con su propia instancia local y acceder a todas las funcionalidades de administración

source: Read the documentation starting from the :doc:`user guide </usage/index>` to the :doc:`admin guide </admin/index>`
es: Lea la documentación desde la :doc:`guía del usuario </usage/index>` hasta la :doc:`guía de administración </admin/index>`

source: Subscribe to the `geonode-users`_ and/or `geonode-devel`_ mailing lists to join the community. See also the section :ref:`get_in_touch` for more info.
es: Suscríbase a las listas de correo `geonode-users`_ y/o `geonode-devel`_ para unirse a la comunidad. Consulte también la sección :ref:`get_in_touch` para obtener más información.

source: Thanks for your interest!
es: ¡Gracias por tu interés!

source: Supported Browsers
es: Navegadores compatibles

source: GeoNode is known to be working on all modern web browsers.
es: Se sabe que GeoNode funciona en todos los navegadores web modernos.

source: This list includes (but is not limited to):
es: Esta lista incluye (pero no se limita a):

source: The vast majority of GeoNode developers prefer using Google Chrome.
es: La gran mayoría de los desarrolladores de GeoNode prefieren utilizar Google Chrome.

source: Online Demo
es: Demostración en línea

source: **Disclaimer** we do not guarantee for any data published on this Demo Site. Publish the data at your own risk. Every dataset will be removed automatically every Sunday. If you find some dataset that shouldn't be there, please write suddenly to developers and maintainers.
es: **Descargo de responsabilidad** No garantizamos la precisión de los datos publicados en este sitio de demostración. Publica los datos bajo tu propio riesgo. Cada conjunto de datos se eliminará automáticamente cada domingo. Si encuentras algún conjunto de datos que no debería estar allí, por favor, comunícalo de inmediato a los desarrolladores y mantenedores.

source: See the section :ref:`get_in_touch` for details.
es: Consulte la sección :ref:`get_in_touch` para obtener más detalles.

source: A live demo of the latest stable build is available at https://demo.geonode.org/.
es: Una demostración en vivo de la última versión estable está disponible en https://demo.geonode.org/.

source: *Online Demo @ demo.geonode.org*
es: *Demostración en línea @ demo.geonode.org*

source: Anyone may sign up for a user account, upload and style data, create and share maps, and change permissions.
es: Cualquiera puede registrarse para obtener una cuenta de usuario, cargar y diseñar datos, crear y compartir mapas y cambiar permisos.

source: Since it is a demo site, every sunday all the datasets will be wiped out. Users, passwords and groups will be preserved.
es: Dado que es un sitio de demostración, todos los domingos se eliminarán todos los conjuntos de datos. Se conservarán los usuarios, contraseñas y grupos.

source: It should hopefully allow you to easily and quickly make a tour of the main capabilities of GeoNode.
es: Con suerte, debería permitirle realizar un recorrido fácil y rápido por las principales capacidades de GeoNode.

source: This GeoNode instance is configured with standards settings and a very low security level. This is a demo only not to be considered a really production ready system. For a complete list of settings, refer to the section: :ref:`settings`
es: Esta instancia de GeoNode está configurada con configuraciones estándar y un nivel de seguridad muy bajo. Esta es una demostración, pero no debe considerarse un sistema realmente listo para producción. Para obtener una lista completa de configuraciones, consulte la sección: :ref:`settings`

source: Quick Installation Guide
es: Guía de Instalación Rápida
