Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/contribute/frontend-development/index.po
Languages: es

source: Frontend development
es: Desarrollo de frontend

source: Knowledge of handling node/npm is required.
es: Se requieren conocimientos de manejo de node/npm.

source: The GeoNode frontend dependencies can be found in ./geonode/static. To manage dependencies, we recommend the use of yarn package manager (https://yarnpkg.com/lang/en).
es: Las dependencias del frontend de GeoNode se pueden encontrar en ./geonode/static. Para administrar las dependencias, recomendamos utilizar el administrador de paquetes yarn (https://yarnpkg.com/lang/en).

source: First steps:
es: Primeros pasos:

source: Installs the required libraries to ./node_modules
es: Instala las bibliotecas necesarias en ./node_modules

source: Installs a package with a defined version. Using ``–dev`` installs a dependency that is only available for the build process (see: package.json devDependencies).
es: Instala un paquete con una versión definida. El uso de ``–dev`` instala una dependencia que solo está disponible para el proceso de compilación (consulte: package.json devDependencies).

source: Removes a package.
es: Elimina un paquete.

source: Shows version information.
es: Muestra información de la versión.

source: Get information on why this package was installed.
es: Obten información sobre por qué se instaló este paquete.

source: **For further information on how to install or use please visit the official yarn documentation.**
es: **Para obtener más información sobre cómo instalar o usar Yarn, visita la documentación oficial.**

source: File/Folder overview:
es: Descripción general de archivos/carpetas:

source: includes all dependencies associated with each file. For example all files which should be minified to assets.min.js are named as values. All files that should be copied to lib folder (for DEBUG_STATIC) are values of key `other_dependencies` and so on. Before you can use a dependency it has to be added to package.json by use of yarn.
es: incluye todas las dependencias asociadas con cada archivo. Por ejemplo, todos los archivos que se deben minimizar a assets.min.js se nombran como valores. Todos los archivos que se deben copiar a la carpeta lib (para DEBUG_STATIC) son valores de la clave `other_dependencies` y así sucesivamente. Antes de poder usar una dependencia, se debe agregar a package.json mediante el uso de yarn.

source: reads the dependencies from static_dependencies.json and contains all workflows.
es: Lee las dependencias desde static_dependencies.json y contiene todos los flujos de trabajo.

source: The ./geonode folder contains GeoNode’s stylesheets and javascript files. The CSS files are generated via less. CSS files should therefore never be changed directly but it’s corresponding less file. Further this folder should never be deleted!
es: La carpeta ./geonode contiene las hojas de estilo y los archivos javascript de GeoNode. Los archivos CSS se generan mediante less. Por lo tanto, los archivos CSS nunca deben modificarse directamente, sino el archivo less correspondiente. Además, ¡esta carpeta nunca debe eliminarse!

source: The ./lib folder contains all the third-party files. This folder can be deleted as it will be fully generated by use of grunt ``development|production``
es: La carpeta ./lib contiene todos los archivos de terceros. Esta carpeta se puede eliminar, ya que se generará completamente mediante el uso de grunt ``development|production``

source: Example 1 – Change styling:
es: Ejemplo 1 – Cambiar estilo:

source: In your settings set ``DEBUG_STATIC=True``. This will load unminified assets in your template.
es: En la configuración, configura ``DEBUG_STATIC=True``. Esto cargará los activos no minimizados en tu plantilla.

source: Start the development server with ``paver start``.
es: Inicia el servidor de desarrollo con ``paver start``.

source: Use ``grunt watch`` to watch all less files for change.
es: Utiliza ``grunt watch`` para vigilar todos los archivos less en busca de cambios.

source: Change styling in ./geonode/static/geonode/less
es: Cambia el estilo en ./geonode/static/geonode/less

source: If our changes are as expected create a new build with ``grunt development`` (files are not minimized) or ``grunt production`` (files are minimized)
es: Si nuestros cambios son los esperados, crea una nueva compilación con ``grunt development`` (los archivos no se minimizan) o ``grunt production`` (los archivos se minimizan)

source: Example 2 – add/update a new library:
es: Ejemplo 2: agregar/actualizar una nueva biblioteca:

source: ``vim static_dependencies.json`` Edit the file and add your dependency to its fitting destination. For example, assets.min.js
es: ``vim static_dependencies.json`` Edita el archivo y agrega su dependencia al destino correspondiente. Por ejemplo, assets.min.js

source: Check if some Django template (for example, base.html) includes the file and add it or adjust the version
es: Comprueba si alguna plantilla de Django (por ejemplo, base.html) incluye el archivo y agrégalo o ajusta la versión

source: use `grunt production` to build the package
es: Utiliza `grunt production` para construir el paquete

source: **For further tasks have a look at gruntfile.js or ask for help in the development mailing list**
es: **Para más tareas, consulte gruntfile.js o solicite ayuda en la lista de correo de desarrollo**

source: Please make maintainers work easier and add a message to your commit why a library has been added. (For example, commit -m 'select2 added for permissions form on layer detail page')
es: Facilita el trabajo de los encargados del mantenimiento y agrega un mensaje a tu confirmación indicando por qué se agregó una biblioteca. (Por ejemplo, commit -m 'select2 added for permissions form on layer detail page')
