Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/intermediate/modes/index.po
Languages: es

source: Read-Only and Maintenance Modes
es: Modos de solo lectura y mantenimiento

source: Overview
es: Descripción general

source: GeoNode gives an option to operate in different modes, according to the needs and demands of the certain application system.
es: GeoNode ofrece la opción de operar en diferentes modos, según las necesidades y demandas de cada sistema de aplicación.

source: Changing the currently used mode can be done in the admin panel by the user with super-user privileges, by modifying ``Configuration`` singleton model in the ``BASE`` application:
es: El cambio del modo actualmente utilizado se puede realizar en el panel de administración por un usuario con privilegios de superusuario, modificando el modelo singleton de ``Configuración`` en la aplicación ``BASE``:

source: *Configuration change in the admin panel*
es: *Cambio de configuración en el panel de administración*

source: Read-Only Mode
es: Modo de solo lectura

source: Activating the Read-Only Mode (by setting ``Read only`` True in the ``Configuration``) activates a middleware rejecting all modifying requests (POST/PUT/DELETE), with an exception for:
es: Al activar el modo de solo lectura (estableciendo ``Read only`` como True en ``Configuración``) se activa un middleware que rechaza todas las solicitudes de modificación (POST/PUT/DELETE), con una excepción para:

source: POST to login view
es: POST para ver el inicio de sesión

source: POST to logout view
es: POST para ver el cierre de sesión

source: POST to admin login view
es: POST en la vista de inicio de sesión de administrador

source: POST to admin logout view
es: POST en la vista de cierre de sesión del administrador

source: all requests to OWS endpoint
es: todas las solicitudes al punto de acceso OWS

source: all requests ordered by a super-user
es: todas las solicitudes ordenadas por un superusuario

source: Additionally, all UI elements allowing modifying GeoNode's content are hidden, so e.g. the button "Upload Layer" is not rendered in the templates.
es: Además, todos los elementos de la interfaz de usuario que permiten modificar el contenido de GeoNode están ocultos, por ejemplo, el botón "Cargar capa" no se muestra en las plantillas.

source: In case a user tries to perform a forbidden request, they will be presented with a static HTML page informing them, the GeoNode is in the Read-Only mode and this action is currently forbidden.
es: En caso que un usuario intente realizar una solicitud prohibida, se le presentará una página HTML estática informándole que GeoNode está en modo de solo lectura y que esta acción está actualmente prohibida.

source: Maintenance Mode
es: Modo de mantenimiento

source: Activating the Maintenance Mode (by setting ``Maintenance`` True in the ``Configuration``) activates the highest level middleware (the one executed as the first) rejecting all requests to the GeoNode instance, with an exception for:
es: Al activar el modo de mantenimiento (estableciendo ``Maintenance`` como True en ``Configuración``) se activa el middleware de nivel más alto (el que se ejecuta como primero) y rechaza todas las solicitudes a la instancia de GeoNode, con una excepción para:

source: In case a user tries to perform any request against the GeoNode (including GET requests), they will be presented with a static HTML page informing them, the maintenance actions are taken on the GeoNode instance, and asking them to try again soon.
es: En caso que un usuario intente realizar cualquier solicitud contra GeoNode (incluidas las solicitudes GET), se le presentará una página HTML estática informándole que se tomaron acciones de mantenimiento en la instancia del GeoNode y solicitándole que lo intente nuevamente pronto.

source: The maintenance mode was implemented with a thought of the backup and restore procedures without a necessity to put down the instance, but at the same time with a restriction of any outer interference.
es: El modo de mantenimiento se implementó pensando en los procedimientos de backup y restauración sin necesidad de apagar la instancia, pero al mismo tiempo con una restricción de cualquier interferencia externa.
