Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/advanced/components/index.po
Languages: es

source: ``Enable Redirect Authentication EntryPoint``; It is recommended to put this to ``False``, otherwise GeoServer won't allow you to connect to its Admin GUI through the ``Form`` but only through GeoNode
es: ``Enable Redirect Authentication EntryPoint``; se recomienda poner esto en ``False``, de lo contrario GeoServer no le permitirá conectarse a su GUI de administración a través del ``Formulario`` sino solo a través de GeoNode

source: ``Login Authentication EndPoint``; Unless you have specific needs, keep the default value ``/j_spring_oauth2_geonode_login``
es: ``Login Authentication EndPoint``; a menos que tengas necesidades específicas, manten el valor predeterminado ``/j_spring_oauth2_geonode_login``

source: ``Logout Authentication EndPoint``; Unless you have specific needs, keep the default value ``/j_spring_oauth2_geonode_logout``
es: ``Logout Authentication EndPoint``; a menos que tengas necesidades específicas, manten el valor predeterminado ``/j_spring_oauth2_geonode_logout``

source: ``Force Access Token URI HTTPS Secured Protocol``; This must be ``False`` unless you enabled a ``Secured Connection`` on GeoNode. In that case you will need to trust the GeoNode ``Certificate`` on the GeoServer JVM Keystore. Please see details below
es: ``Force Access Token URI HTTPS Secured Protocol``; debe ser ``False`` a menos que hayas habilitado una ``Conexión segura`` en GeoNode. En ese caso, deberás confiar en el ``Certificado`` de GeoNode en el almacén de claves JVM de GeoServer. Consulta los detalles a continuación

source: ``Access Token URI``; Set this to ``http://<geonode_host_base_url>/o/token/``
es: ``Access Token URI``; Establece esto en ``http://<geonode_host_base_url>/o/token/``

source: ``Force User Authorization URI HTTPS Secured Protocol``; This must be ``False`` unless you enabled a ``Secured Connection`` on GeoNode. In that case you will need to trust the GeoNode ``Certificate`` on the GeoServer JVM Keystore. Please see details below
es: ``Force User Authorization URI HTTPS Secured Protocol``; debe ser ``False`` a menos que hayas habilitado una ``Conexión segura`` en GeoNode. En ese caso, deberás confiar en el ``Certificado`` de GeoNode en el almacén de claves JVM de GeoServer. Consulta los detalles a continuación

source: ``User Authorization URI``; Set this to ``http://<geonode_host_base_url>/o/authorize/``
es: ``User Authorization URI``; Establece esto en ``http://<geonode_host_base_url>/o/authorize/``

source: ``Redirect URI``; Set this to ``http://<geoserver_host>/geoserver``. This address **must** be present on the ``Redirect uris`` of GeoNode ``OAuth2`` > ``Applications`` > ``GeoServer`` (see above)
es: ``Redirect URI``; establece esta opción en ``http://<geoserver_host>/geoserver``. Esta dirección **debe** estar presente en ``Redirect uris`` of GeoNode ``OAuth2`` > ``Applications`` > ``GeoServer`` (consulte más arriba)

source: ``Check Token Endpoint URL``; Set this to ``http://<geonode_host_base_url>/api/o/v4/tokeninfo/``
es: ``Check Token Endpoint URL``; Establece esto en ``http://<geonode_host_base_url>/api/o/v4/tokeninfo/``

source: ``Logout URI``; Set this to ``http://<geonode_host_base_url>/account/logout/``
es: ``Logout URI``; Establece esto en ``http://<geonode_host_base_url>/account/logout/``

source: ``Scopes``; Unless you have specific needs, keep the default value ``read,write,groups``
es: ``Scopes``; A menos que tengas necesidades específicas, manten el valor predeterminado ``read,write,groups``

source: ``Client ID``; The ``Client id`` alphanumeric key generated by the GeoNode ``OAuth2`` > ``Applications`` > ``GeoServer`` (see above)
es: ``Client ID``; La clave alfanumérica ``ID de cliente`` generada por el GeoNode ``OAuth2`` > ``Aplicaciones`` > ``GeoServer`` (ver arriba)

source: ``Client Secret``; The ``Client secret`` alphanumeric key generated by the GeoNode ``OAuth2`` > ``Applications`` > ``GeoServer`` (see above)
es: ``Client Secret``; La clave alfanumérica ``Secreto del cliente`` generada por el GeoNode ``OAuth2`` > ``Applications`` > ``GeoServer`` (ver arriba)

source: ``Role source``; In order to authorize the user against GeoNode, choose ``Role service`` > ``geonode REST role service``
es: ``Role source``; Para autorizar al usuario en GeoNode, seleccione ``Role service`` > ``geonode REST role service``

source: The following steps ensure GeoServer can adopt more Authentication methods. As stated above, it is possible to Authenticate to GeoServer using different protocols.
es: Los siguientes pasos garantizan que GeoServer pueda adoptar más métodos de autenticación. Como se indicó anteriormente, es posible autenticarse en GeoServer mediante diferentes protocolos.

source: GeoServer scans the authentication filters chain associated to the specified path and tries them one by one sequentially. The first one matching the protocol and able to grant access to the user, breaks the cycle by creating a ``User Principal`` and injecting it into the GeoServer ``SecurityContext``. The Authentication process, then, ends here and the control goes to the Authorization one, which will try to retrieve the authenticated user's Roles through the available GeoServer Role Services associated to the Authentication Filter that granted the access.
es: GeoServer escanea la cadena de filtros de autenticación asociados a la ruta especificada y los prueba uno por uno secuencialmente. El primero que coincida con el protocolo y sea capaz de otorgar acceso al usuario, rompe el ciclo creando un ``User Principal`` e inyectándolo en el ``SecurityContext`` de GeoServer. El proceso de Autenticación, entonces, termina aquí y el control pasa al de Autorización, que intentará recuperar los Roles del usuario autenticado a través de los Servicios de Roles de GeoServer disponibles asociados al Filtro de Autenticación que otorgó el acceso.

source: The ``geonode-oauth2 - Authentication using a GeoNode OAuth2`` Authentication Filter and the ``geonode REST role service`` have been correctly configured
es: El filtro de autenticación ``geonode-oauth2 - Authentication using a GeoNode OAuth2`` y el ``geonode REST role service`` se han configurado correctamente

source: Setup of the GeoServer Filter Chains
es: Configuración de las cadenas de filtros de GeoServer

source: Identify the section ``Filter Chains``
es: Identifica la sección ``Cadenas de filtros``

source: Make sure the ``web`` Filter Chain is configured as shown below
es: Asegúrate de que la cadena de filtros «web» esté configurada como se muestra a continuación

source: Every time you modify a Filter Chain, **don't forget to save** the ``Authentication`` settings. This **must** be done for **each** change.
es: Cada vez que modifiques una cadena de filtros, **no olvides guardar** la configuración de ``Autenticación``. Esto **debes** realizarlo para **cada** cambio.

source: Make sure the ``rest`` Filter Chain is configured as shown below
es: Asegúrate que la cadena de filtros ``rest`` esté configurada como se muestra a continuación

source: Make sure the ``gwc`` Filter Chain is configured as shown below
es: Asegúrate que la cadena de filtros ``gwc`` esté configurada como se muestra a continuación

source: Make sure the ``default`` Filter Chain is configured as shown below
es: Asegúrate que la cadena de filtros «predeterminada» esté configurada como se muestra a continuación

source: Add the ``GeoNode Login Endpoints`` to the comma-delimited list of the ``webLogin`` Filter Chain
es: Agrega los «Puntos finales de inicio de sesión de GeoNode» a la lista delimitada por comas de la cadena de filtros «webLogin»

source: Add the ``GeoNode Logout Endpoints`` to the comma-delimited list of the ``webLogout`` Filter Chain
es: Agrega los ``Puntos finales de cierre de sesión de GeoNode`` a la lista delimitada por comas de la cadena de filtros ``webLogout``

source: Add the ``GeoNode Logout Endpoints`` to the comma-delimited list of the ``formLogoutChain`` XML node in ``<GEOSERVER_DATA_DIR>/security/filter/formLogout/config.xml``
es: Agregue los ``Puntos finales de cierre de sesión de GeoNode`` a la lista delimitada por comas del nodo XML ``formLogoutChain`` en ``<GEOSERVER_DATA_DIR>/security/filter/formLogout/config.xml``

source: You will need a text editor to modify the file.
es: Necesitarás un editor de texto para modificar el archivo.

source: If the ``<formLogoutChain>`` XML node does not exist at all, create a **new one** as specified below
es: Si el nodo XML ``<formLogoutChain>`` no existe en absoluto, crea uno **nuevo** como se especifica a continuación

source: The value ``j_spring_oauth2_geonode_logout`` **must** be the same specified as ``Logout Authentication EndPoint`` in the ``geonode-oauth2 - Authentication using a GeoNode OAuth2`` above.
es: El valor ``j_spring_oauth2_geonode_logout`` **debe** ser el mismo especificado como ``Logout Authentication EndPoint`` en ``geonode-oauth2 - Authentication using a GeoNode OAuth2`` anterior.

source: In order to work correctly, GeoServer needs the `GeoFence Embedded Server <http://docs.geoserver.org/latest/en/user/community/geofence-server/index.html>`_ plugin to be installed and configured on the system.
es: Para funcionar correctamente, GeoServer necesita que el complemento `GeoFence Embedded Server <http://docs.geoserver.org/latest/en/user/community/geofence-server/index.html>`_ esté instalado y configurado en el sistema.

source: The GeoServer configuration provided for GeoNode, has the plugin already installed with a default configuration. In that case double check that the plugin works correctly and the default rules have been setup by following the next steps.
es: La configuración de GeoServer proporcionada para GeoNode ya tiene el complemento instalado con una configuración predeterminada. En ese caso, verifica que el complemento funcione correctamente y que se hayan configurado las reglas predeterminadas siguiendo los pasos siguientes.

source: The `GeoFence Embedded Server <http://docs.geoserver.org/latest/en/user/community/geofence-server/index.html>`_ plugin has been installed on GeoServer
es: El complemento `GeoFence Embedded Server <http://docs.geoserver.org/latest/en/user/community/geofence-server/index.html>`_ se ha instalado en GeoServer

source: Identify the section ``Authentication Providers`` and make sure the ``geofence`` Authentication Provider is present
es: Identifique la sección ``Proveedores de autenticación`` y asegúrate que el proveedor de autenticación ``geofence`` esté presente

source: Make sure the ``Provider Chain`` is configured as shown below
es: Asegúrate que la «Cadena de proveedores» esté configurada como se muestra a continuación

source: Every time you modify an Authentication Providers, **don't forget to save** the ``Authentication`` settings. This **must** be done for **each** change.
es: Cada vez que modifiques un proveedor de autenticación, **no olvides guardar** la configuración de ``Autenticación``. Esto **debe** hacerse para **cada** cambio.

source: Setup of the GeoFence Server and Rules
es: Configuración del servidor GeoFence y reglas

source: Make sure GeoFence server works and the default settings are correctly configured
es: Asegúrate que el servidor GeoFence funcione y que la configuración predeterminada esté configurada correctamente

source: Access the ``Security`` > ``GeoFence`` section
es: Acceda a la sección ``Seguridad`` > ``GeoFence``

source: Make sure the ``Options`` are configured as follows and the server works well when performing a ``Test Connection``
es: Asegúrate que las ``Opciones`` estén configuradas de la siguiente manera y que el servidor funcione bien al realizar una ``Conexión de prueba``

source: ``Allow remote and inline layers in SLD``; Set it to ``True``
es: ``Allow remote and inline layers in SLD``; Configúralo en ``True``

source: ``Allow SLD and SLD_BODY parameters in requests``; Set it to ``True``
es: ``Allow SLD and SLD_BODY parameters in requests``; configúralo en ``True``

source: ``Authenticated users can write``; Set it to ``True``
es: ``Authenticated users can write``; configúralo en ``True``

source: ``Use GeoServer roles to get authorizations``; Set it to ``False``
es: ``Use GeoServer roles to get authorizations``; configúralo en ``False``

source: Check the GeoFence default Rules
es: Comprueba las reglas predeterminadas de GeoFence

source: Access the ``Security`` > ``GeoFence Data Rules`` section
es: Acceda a la sección ``Seguridad`` > ``Reglas de datos de GeoFence``

source: Make sure the ``DENY ALL`` Rule is present by default, otherwise your data will be accessible to everyone
es: Asegúrate que la regla ``DENY ALL`` esté presente de forma predeterminada, de lo contrario, sus datos serán accesibles para todos.

source: This rule is **always** the last one
es: Esta regla es **siempre** la última

source: If that rule does not exists **at the very bottom** (this rule is **always** the last one), add it manually.
es: Si esa regla no existe **en la parte inferior** (esta regla es **siempre** la última), agrégala manualmente.

source: Access the ``Security`` > ``GeoFence Admin Rules`` section
es: Acceda a la sección ``Seguridad`` > ``Reglas de administración de GeoFence``

source: No Rules needed here
es: Aquí no se necesitan reglas

source: Troubleshooting and Advanced Features
es: Solución de problemas y funciones avanzadas

source: GeoServer/GeoNode OAuth2 does not authenticate as Administrator even using GeoNode ``admin`` users
es: GeoServer/GeoNode OAuth2 no se autentica como administrador, incluso utilizando los usuarios ``admin`` de GeoNode

source: **Symptoms**
es: **Síntomas**

source: When trying to authenticate with an ``admin`` user using OAuth2, the process correctly redirects to GeoServer page but I'm not a GeoServer Administrator.
es: Al intentar autenticarme con un usuario ``admin`` usando OAuth2, el proceso redirecciona correctamente a la página de GeoServer, pero no soy administrador de GeoServer.

source: **Cause**
es: **Causa**

source: That means that somehow GeoServer could not successfully complete the Authorization and Authentication process.
es: Esto significa que, de alguna manera, GeoServer no pudo completar con éxito el proceso de autorización y autenticación.

source: The possible causes of the problem may be the following ones:
es: Las posibles causas del problema pueden ser las siguientes:

source: The OAuth2 Authentication fails on GeoServer side
es: La autenticación OAuth2 falla en el lado de GeoServer

source: This is usually due to an exception while trying to complete the Authentication process.
es: Generalmente, esto se debe a una excepción al intentar completar el proceso de autenticación.

source: A typical cause is that GeoServer tries to use HTTPS connections but the GeoNode certificate is not trusted;
es: Una causa típica es que GeoServer intenta utilizar conexiones HTTPS pero el certificado de GeoNode no es confiable;

source: In that case please refer to the section below. Also take a look at the logs (in particular the GeoServer one) as explained in :ref:`debug_geonode`. The GeoServer logs should contain a detailed Exception explaining the cause of the problem. If no exception is listed here (even after raised the log level to *DEBUG*), try to check for the GeoNode Role Service as explained below.
es: En ese caso, consulta la sección siguiente. También echa un vistazo a los registros (en particular, el de GeoServer) como se explica en :ref:`debug_geonode`. Los registros de GeoServer deben contener una excepción detallada que explique la causa del problema. Si no se incluye ninguna excepción aquí (incluso después de haber elevado el nivel de registro a *DEBUG*), intenta verificar el servicio de rol de GeoNode como se explica a continuación.

source: Another possible issue is that somehow the OAuth2 handshake cannot complete successfully;
es: Otro posible problema es que, de alguna manera, el protocolo de enlace OAuth2 no pueda completarse con éxito;

source: Login into GeoServer as administrator through its WEB login form.
es: Inicia sesión en GeoServer como administrador a través de su formulario de inicio de sesión WEB.

source: Double check that all the ``geonode-oauth2 - Authentication using a GeoNode OAuth2`` parameters are correct. If everything is ok, take a look at the logs (in particular the GeoServer one) as explained in :ref:`debug_geonode`. The GeoServer logs should contain a detailed Exception explaining the cause of the problem. If no exception is listed here (even after raised the log level to *DEBUG*), try to check for the GeoNode Role Service as explained below.
es: Verifica nuevamente que todos los parámetros de ``geonode-oauth2 - Authentication using a GeoNode OAuth2`` sean correctos. Si todo está bien, echa un vistazo a los registros (en particular, el de GeoServer) como se explica en :ref:`debug_geonode`. Los registros de GeoServer deben contener una excepción detallada que explique la causa del problema. Si no se incluye ninguna excepción aquí (incluso después de haber elevado el nivel de registro a *DEBUG*), intenta verificar el servicio de rol de GeoNode como se explica a continuación.

source: GeoServer is not able to retrieve the user Role from a Role Service
es: GeoServer no puede recuperar el rol del usuario desde un servicio de rol

source: Always double check both HTTP Server and GeoServer log as specified in section :ref:`debug_geonode`. This might directly guide you to the cause of the problem.
es: Verifica siempre el registro del servidor HTTP y del GeoServer como se especifica en la sección :ref:`debug_geonode`. Esto podría guiarte directamente a la causa del problema.

source: Check that the GeoServer host is granted to access GeoNode Role Service REST APIs in the ``AUTH_IP_WHITELIST`` of the ``settings.py``
es: Verifica que el host GeoServer tenga permiso para acceder a las API REST del servicio de rol GeoNode en ``AUTH_IP_WHITELIST`` de ``settings.py``

source: Check that the ``geonode REST role service`` is the default Role service and that the GeoServer OAuth2 Plugin has been configured to use it by default
es: Verifica que el ``geonode REST role service`` sea el servicio de rol predeterminado y que el complemento GeoServer OAuth2 se haya configurado para usarlo de manera predeterminada

source: Check that the GeoNode REST Role Service APIs are functional and produce correct JSON.
es: Verifica que las API del servicio de rol REST de GeoNode funcionen y produzcan JSON correcto.

source: This is possible by using simple ``cUrl`` GET calls like
es: Esto es posible utilizando simples llamadas GET con ``cUrl``, como:

source: In a production system it is a good practice to encrypt the connection between GeoServer and GeoNode. That would be possible by enabling HTTPS Protocol on the GeoNode REST Role Service APIs and OAuth2 Endpoints.
es: En un sistema de producción, es una buena práctica cifrar la conexión entre GeoServer y GeoNode. Esto sería posible habilitando el protocolo HTTPS en las API de servicio de rol REST de GeoNode y los puntos finales de OAuth2.

source: Most of the times you will rely on a self-signed HTTPS connection using a generated certificate. That makes the connection *untrusted* and you will need to tell to the GeoServer Java Virtual Machine to trust it.
es: La mayoría de las veces, dependerá de una conexión HTTPS autofirmada que utilice un certificado generado. Eso hace que la conexión no sea confiable y deberás indicarle a la máquina virtual Java de GeoServer que confíe en ella.

source: This can be done by following the steps below.
es: Esto puede hacerse siguiendo los pasos a continuación.

source: For any issue take a look at the logs (in particular the GeoServer one) as explained in :ref:`debug_geonode`. The GeoServer logs should contain a detailed Exception explaining the cause of the problem.
es: Si surge algún problema, consulta los registros (en particular, los de GeoServer) como se explica en :ref:`debug_geonode`. Los registros de GeoServer deberían contener una excepción detallada que explique la causa del problema.

source: SSL Trusted Certificates
es: Certificados de confianza SSL

source: When using a custom ``Keystore`` or trying to access a non-trusted or self-signed SSL-protected OAuth2 Provider from a non-SSH connection, you will need to add the certificates to the JVM ``Keystore``.
es: Al utilizar un ``Almacén de claves`` personalizado o intentar acceder a un proveedor OAuth2 protegido por SSL no confiable o autofirmado desde una conexión que no sea SSH, deberás agregar los certificados al ``Almacén de claves`` de JVM.

source: In order to do this you can follow the next steps:
es: Para ello puedes seguir los siguientes pasos:

source: In this example we are going to
es: En este ejemplo vamos a

source: Retrieve SSL Certificate from GeoNode domain:
es: Recuperar el certificado SSL del dominio GeoNode:

source: "Access Token URI" = https://<geonode_host_base_url>/o/token/ therefore we need to trust ``https://<geonode_host_base_url>`` or (``<geonode_host_base_url>:443``)
es: "URI del token de acceso" = https://<geonode_host_base_url>/o/token/ por lo tanto, debemos confiar en ``https://<geonode_host_base_url>`` o (``<geonode_host_base_url>:443``)

source: You will need to get and trust certificates from every different HTTPS URL used on OAuth2 Endpoints.
es: Necesitarás obtener y confiar en los certificados de cada URL HTTPS diferente utilizada en los puntos finales de OAuth2.

source: Store SSL Certificates on local hard-disk
es: Almacenar certificados SSL en el disco duro local

source: Add SSL Certificates to the Java Keystore
es: Agregar certificados SSL al almacén de claves de Java

source: Enable the JVM to check for SSL Certificates from the Keystore
es: Habilita la JVM para verificar los certificados SSL desde el almacén de claves

source: Retrieve the SSL Certificate from GeoNode domain
es: Recuperar el certificado SSL del dominio GeoNode

source: Use the ``openssl`` command in order to dump the certificate
es: Utiliza el comando ``openssl`` para volcar el certificado

source: For ``https://<geonode_host_base_url>``
es: Para ``https://<geonode_host_base_url>``

source: Store SSL Certificate on local hard-disk
es: Almacenar el certificado SSL en el disco duro local

source: Copy-and-paste the section ``-BEGIN CERTIFICATE-``, ``-END CERTIFICATE-`` and save it into a ``.cert`` file
es: Copia y pega la sección ``-BEGIN CERTIFICATE-``, ``-END CERTIFICATE-`` y guárdala en un archivo ``.cert``

source: ``.cert`` file are plain text files containing the ASCII characters included on the ``-BEGIN CERTIFICATE-``, ``-END CERTIFICATE-`` sections
es: Los archivos ``.cert`` son archivos de texto simple que contienen los caracteres ASCII incluidos en las secciones ``-BEGIN CERTIFICATE-``, ``-END CERTIFICATE-``

source: ``geonode.cert`` (or whatever name you want with ``.cert`` extension)
es: ``geonode.cert`` (o cualquier nombre que desee con la extensión ``.cert``)

source: You can use the Java command ``keytool`` like this
es: Puedes usar el comando Java ``keytool`` de esta manera

source: or, alternatively, you can use some graphic tool which helps you managing the SSL Certificates and Keystores, like `Portecle <http://portecle.sourceforge.net/>`_
es: o, alternativamente, puedes utilizar alguna herramienta gráfica que te ayude a administrar los certificados SSL y los almacenes de claves, como `Portecle <http://portecle.sourceforge.net/>`_

source: In order to do this, you need to pass a ``JAVA_OPTION`` to your JVM:
es: Para hacer esto, necesitas pasar una ``JAVA_OPTION`` a tu JVM:

source: Restart your server
es: Reinicia tu servidor
