Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/advanced/components/index.po
Languages: es

source: OAuth2 Security: Authentication and Authorization
es: Seguridad OAuth2: autenticación y autorización

source: GeoNode interacts with GeoServer through an advanced security mechanism based on OAuth2 Protocol and GeoFence. This section is a walk through of the configuration and setup of GeoNode and GeoServer Advanced Security.
es: GeoNode interactúa con GeoServer a través de un mecanismo de seguridad avanzado basado en el protocolo OAuth2 y GeoFence. Esta sección es un recorrido por la configuración y la instalación de la seguridad avanzada de GeoNode y GeoServer.

source: What we will see in this section is:
es: Lo que veremos en esta sección es:

source: **Introduction**
es: **Introducción**

source: **GeoNode** (Security Backend):
es: **GeoNode** (Backend de seguridad):

source: Django Authentication
es: Autenticación de Django

source: Django OAuth Toolkit Setup and Configuration
es: Configuración y configuración del kit de herramientas OAuth de Django

source: Details on ``settings.py`` Security Settings
es: Detalles sobre la configuración de seguridad de ``settings.py``

source: **GeoServer** (Security Backend):
es: **GeoServer** (Backend de seguridad):

source: GeoServer Security Subsystem
es: Subsistema de seguridad GeoServer

source: Introduction to the GeoServer OAuth2 Security Plugin
es: Introducción al complemento de seguridad OAuth2 de GeoServer

source: Configuration of the ``GeoNode REST Role Service``
es: Configuración del ``Servicio de rol REST de GeoNode``

source: Configuration of the ``GeoNode OAuth2 Authentication Filter``
es: Configuración del ``Filtro de autenticación OAuth2 de GeoNode``

source: The GeoServer Authentication Filter Chains
es: Las Cadenas de Filtros de Autenticación de GeoServer

source: Introduction to GeoFence Plugin, the Advanced Security Framework for GeoServer
es: Introducción al complemento GeoFence, el marco de seguridad avanzado para GeoServer

source: **Troubleshooting and Advanced Features**:
es: **Solución de problemas y funciones avanzadas**:

source: Common Issues and Fixes
es: Problemas comunes y soluciones

source: How to setup ``HTTPS`` secured endpoints
es: Cómo configurar puntos finales protegidos con ``HTTPS``

source: GeoFence Advanced Features
es: Funciones avanzadas de GeoFence

source: Introduction
es: Introducción

source: GeoServer, i.e. the geospatial backend server of GeoNode, is a spatial server which needs authenticated users in order to access protected resources or administration functions.
es: GeoServer, es decir, el servidor backend geoespacial de GeoNode, es un servidor espacial que necesita usuarios autenticados para acceder a recursos protegidos o funciones de administración.

source: GeoServer supports several kind of Authentication and Authorization mechanisms. Those systems are pluggable and GeoServer can use them at the same time by the use of a ``Filter Chain``. Briefly this mechanism allows GeoServer to check for different A&A protocols one by one. The first one matching is used by GeoServer to authorize the users.
es: GeoServer admite varios tipos de mecanismos de autenticación y autorización. Estos sistemas se pueden conectar entre sí y GeoServer puede usarlos al mismo tiempo mediante el uso de una ``cadena de filtros``. En pocas palabras, este mecanismo permite a GeoServer verificar los diferentes protocolos de autenticación y autorización uno por uno. GeoServer utiliza el primero que coincide para autorizar a los usuarios.

source: GeoNode Authentication is based by default on Django Security Subsystem. Django authentication allows GeoNode to manage its internal users, groups, roles and sessions.
es: La autenticación de GeoNode se basa de manera predeterminada en el subsistema de seguridad de Django. La autenticación de Django permite a GeoNode administrar sus usuarios, grupos, roles y sesiones internos.

source: GeoNode has some external components, like GeoServer or QGis Server, which are pluggable and stand-alone services, devoted to the management of geospatial data. Those external services have their own authentication and authorization mechanisms which must be synchronized somehow with the GeoNode one. Also, those external services maintain, in most of the cases and unless specific configuration does not disable this, alternative security access which for instance allow GeoNode to modify the geospatial catalog under the hood, or a system administrator to have independent and privileged access to the servers.
es: GeoNode tiene algunos componentes externos, como GeoServer o QGis Server, que son servicios enchufables e independientes, dedicados a la gestión de datos geoespaciales. Estos servicios externos tienen sus propios mecanismos de autenticación y autorización, los cuales deben ser sincronizados de alguna manera con los de GeoNode. Además, en la mayoría de los casos, y a menos que se configure específicamente para deshabilitarlo, estos servicios externos mantienen un acceso de seguridad alternativo que, por ejemplo, permite a GeoNode modificar el catálogo geoespacial de manera interna, o a un administrador del sistema tener acceso independiente y privilegiado a los servidores.

source: Before going deeply on how GeoServer/GeoNode A&A works and how it can be configured in order to work correctly with GeoNode, let's quickly clarify the difference between the ``Authentication`` and ``Authorization`` concepts.
es: Antes de profundizar en cómo funcionan la Autenticación y Autorización (A&A) de GeoServer/GeoNode y cómo se pueden configurar para que funcionen correctamente con GeoNode, aclaremos rápidamente la diferencia entre los conceptos de ``Autenticación`` y ``Autorización``.

source: Authentication
es: Autenticación

source: Authentication is the process of verifying the identity of someone through the use of some sort of credentials and a handshake protocol. If the credentials are valid, the authorization process starts. Authentication process always proceeds to Authorization process (although they may often seem to be combined). The two terms are often used synonymously but they are two different processes.
es: La autenticación es el proceso de verificar la identidad de alguien mediante el uso de algún tipo de credenciales y un protocolo de enlace. Si las credenciales son válidas, comienza el proceso de autorización. El proceso de autenticación siempre pasa al proceso de autorización (aunque a menudo parezca que están combinados). Los dos términos se suelen utilizar como sinónimos, pero son dos procesos diferentes.

source: For more details and explanation about the authentication concepts, take a look `here <http://searchsecurity.techtarget.com/definition/authentication>`__.
es: Para obtener más detalles y explicaciones sobre los conceptos de autenticación, eche un vistazo `aquí <http://searchsecurity.techtarget.com/definition/authentication>`__.

source: Authorization
es: Autorización

source: Authorization is the process of allowing authenticated users to access protected resources by checking its roles and rights against some sort of security rules mechanism or protocol. In other words it allows to control access rights by granting or denying specific permissions to specific authorized users.
es: La autorización es el proceso de permitir a los usuarios autenticados acceder a recursos protegidos verificando sus roles y derechos con algún tipo de mecanismo o protocolo de reglas de seguridad. En otras palabras, permite controlar los derechos de acceso otorgando o denegando permisos específicos a usuarios autorizados específicos.

source: GeoNode Security Backend
es: Backend de seguridad de GeoNode

source: DJango Authentication
es: Autenticación de DJango

source: The Django authentication system handles both authentication and authorization.
es: El sistema de autenticación de Django maneja tanto la autenticación como la autorización.

source: The auth system consists of:
es: El sistema de autenticación consta de:

source: Users
es: Usuarios

source: Permissions: Binary (yes/no) flags designating whether a user may perform a certain task.
es: Permisos: Indicadores binarios (sí/no) que designan si un usuario puede realizar una determinada tarea.

source: Groups: A generic way of applying labels and permissions to more than one user.
es: Grupos: una forma genérica de aplicar etiquetas y permisos a más de un usuario.

source: A configurable password hashing system
es: Un sistema de hash de contraseñas configurable

source: Forms and view tools for logging in users, or restricting content
es: Formularios y herramientas de visualización para iniciar sesión de usuarios o restringir contenido

source: A pluggable backend system
es: Un sistema backend conectable

source: The authentication system in Django aims to be very generic and doesn’t provide some features commonly found in web authentication systems. Solutions for some of these common problems have been implemented in third-party packages:
es: El sistema de autenticación de Django pretende ser muy genérico y no ofrece algunas funciones que se encuentran comúnmente en los sistemas de autenticación web. Se han implementado soluciones para algunos de estos problemas comunes en paquetes de terceros:

source: Password strength checking
es: Comprobación de la solidez de la contraseña

source: Throttling of login attempts
es: Limitación de los intentos de inicio de sesión

source: Authentication against third-parties (OAuth, for example)
es: Autenticación frente a terceros (OAuth, por ejemplo)

source: For more details on installation and configuration of Django authentication system, please refer to the official guide https://docs.djangoproject.com/en/5.0/topics/auth/.
es: Para obtener más detalles sobre la instalación y configuración del sistema de autenticación de Django, consulte la guía oficial https://docs.djangoproject.com/en/5.0/topics/auth/.

source: GeoNode communicates with GeoServer through Basic Authentication under the hood, in order to configure the data and the GeoServer catalog.
es: GeoNode se comunica con GeoServer a través de autenticación básica, para configurar los datos y el catálogo de GeoServer.

source: In order to do this, you must be sure that GeoNode knows the **internal** admin user and password of GeoServer.
es: Para hacer esto, debe asegurarse de que GeoNode conozca el usuario administrador **interno** y la contraseña de GeoServer.

source: This must be an internal GeoServer user with admin rights, not a GeoNode one.
es: Este debe ser un usuario interno de GeoServer con derechos de administrador, no uno de GeoNode.

source: Make sure the credentials are correctly configured into the file ``settings.py``
es: Asegúrese de que las credenciales estén configuradas correctamente en el archivo ``settings.py``

source: Ensure that the ``OGC_SERVER`` settings are correctly configured.
es: Asegúrese de que la configuración de ``OGC_SERVER`` esté configurada correctamente.

source: Notice that the two properties ``LOGIN_ENDPOINT`` and ``LOGOUT_ENDPOINT`` must specify the GeoServer OAuth2 Endpoints (see details below). The default values ``'j_spring_oauth2_geonode_login'`` and ``'j_spring_oauth2_geonode_logout'`` work in most of the cases, unless you need some specific endpoints different from the later. In any case those values **must** be coherent with the GeoServer OAuth2 Plugin configuration.
es: Tenga en cuenta que las dos propiedades ``LOGIN_ENDPOINT`` y ``LOGOUT_ENDPOINT`` deben especificar los puntos finales de GeoServer OAuth2 (consulte los detalles a continuación). Los valores predeterminados ``'j_spring_oauth2_geonode_login'`` y ``'j_spring_oauth2_geonode_logout'`` funcionan en la mayoría de los casos, a menos que necesite algunos puntos finales específicos diferentes de los últimos. En cualquier caso, esos valores **deben** ser coherentes con la configuración del complemento GeoServer OAuth2.

source: If in doubt, please use the default values here below.
es: En caso de duda, utilice los valores predeterminados que aparecen a continuación.

source: Default values are:
es: Los valores predeterminados son:

source: GeoNode and GeoServer A&A Interaction
es: Interacción A&A entre GeoNode y GeoServer

source: The GeoServer instance used by GeoNode, has a particular setup that allows the two frameworks to correctly interact and exchange informations on users credentials and permissions.
es: La instancia GeoServer utilizada por GeoNode, tiene una configuración particular que permite que los dos marcos interactúen correctamente e intercambien información sobre las credenciales y permisos de los usuarios.

source: In particular GeoServer is configured with a ``Filter Chain`` for Authorization that makes use of the two following protocols:
es: En particular, GeoServer está configurado con una «Cadena de filtros» para autorización que utiliza los dos protocolos siguientes:

source: **Basic Authentication**; this is the default GeoServer Authentication mechanism. This makes use of `rfc2617 - Basic and Digest Access Authentication <https://tools.ietf.org/html/rfc2617>`_ in order to check for user's credentials.
es: **Autenticación básica**: este es el mecanismo de autenticación de GeoServer predeterminado. Utiliza `rfc2617 - Autenticación de acceso básica y resumida <https://tools.ietf.org/html/rfc2617>`_ para verificar las credenciales del usuario.

source: In other words, GeoServer takes a ``username`` and a ``password`` encoded `Base64 <https://tools.ietf.org/html/rfc4648>`_ on the HTTP Request Headers and compare them against its internal database (which by default is an encrypted XML file on the GeoServer Data Dir). If the user's credentials match, then GeoServer checks for Authorization through its ``Role Services`` (we will see those services in details on the *GeoServer (Security Backend)* section below).
es: En otras palabras, GeoServer toma un ``nombre de usuario`` y una ``contraseña`` codificada en ``Base64 <https://tools.ietf.org/html/rfc4648>`_ en los encabezados de solicitud HTTP y los compara con su base de datos interna (que, por defecto, es un archivo XML cifrado en el directorio de datos de GeoServer). Si las credenciales del usuario coinciden, GeoServer verifica la autorización a través de sus ``Servicios de rol`` (veremos esos servicios en detalle en la sección *GeoServer (Backend de seguridad)* a continuación).

source: GeoServer ships by default with ``admin`` and ``geoserver`` as the default administrator user name and password. Before putting the GeoServer on-line it is imperative to change at least the administrator password.
es: GeoServer viene por defecto con ``admin`` y ``geoserver`` como el nombre de usuario y la contraseña de administrador predeterminados. Antes de poner GeoServer en línea, es imperativo cambiar al menos la contraseña del administrador.

source: **OAuth2 Authentication**; this module allows GeoServer to authenticate against the `OAuth2 Protocol <https://tools.ietf.org/html/rfc6749>`_. If the Basic Authentication fails, GeoServer falls back to this by using GeoNode as OAuth2 Provider by default.
es: **Autenticación OAuth2**: este módulo permite a GeoServer autenticarse con el protocolo `OAuth2 <https://tools.ietf.org/html/rfc6749>`_. Si la autenticación básica falla, GeoServer recurre a ella utilizando GeoNode como proveedor OAuth2 de forma predeterminada.

source: Further details can be found directly on the official GeoServer documentation at section "`Authentication Chain <http://docs.geoserver.org/latest/en/user/security/auth/chain.html#security-auth-chain>`_"
es: Se pueden encontrar más detalles directamente en la documentación oficial de GeoServer en la sección "`Cadena de autenticación <http://docs.geoserver.org/latest/en/user/security/auth/chain.html#security-auth-chain>`_"

source: From the **GeoNode backend (server) side**, the server will make use of **Basic Authentication** with administrator credentials to configure the GeoServer catalog. GeoServer must be reachable by GeoNode of course, and GeoNode must know the internal GeoServer admin credentials.
es: Desde el lado del servidor de GeoNode, el servidor utilizará la autenticación básica con credenciales de administrador para configurar el catálogo de GeoServer. GeoNode debe poder acceder a GeoServer y GeoNode debe conocer las credenciales de administrador internas de GeoServer.

source: From the **GeoNode frontend (browser and GUI) side**, the *Authentication* goal is to allow GeoServer to recognize as valid a user which has been already logged into GeoNode, providing kind of an `SSO <https://en.wikipedia.org/wiki/Single_sign-on>`_ mechanism between the two applications.
es: Desde el **lado del frontend de GeoNode (navegador y GUI)**, el objetivo de la *Autenticación* es permitir que GeoServer reconozca como válido a un usuario que ya ha iniciado sesión en GeoNode, proporcionando una especie de mecanismo de SSO <https://en.wikipedia.org/wiki/Single_sign-on>_ entre las dos aplicaciones.

source: GeoServer must know and must be able to access GeoNode via HTTP/HTTPS. In other words, an external user connected to GeoNode must be authenticated to GeoServer with same permissions. This is possible through the **OAuth2 Authentication** Protocol.
es: GeoServer debe conocer y poder acceder a GeoNode a través de HTTP/HTTPS. En otras palabras, un usuario externo conectado a GeoNode debe estar autenticado en GeoServer con los mismos permisos. Esto es posible a través del protocolo de autenticación **OAuth2**.

source: **GeoNode / GeoServer Authentication Mechanism**
es: **Mecanismo de autenticación de GeoNode/GeoServer**

source: *GeoNode as OAuth2 Provider (OP)*
es: *GeoNode como proveedor OAuth2 (OP)*

source: OpenID Connect is an identity framework built on OAuth 2.0 protocol which extends the authorization of OAuth 2.0 processes to implement its authentication mechanism. OpenID Connect adds a discovery mechanism allowing users to use an external trusted authority as an identity provider. From another point of view, this can be seen as a single sign on (SSO) system.
es: OpenID Connect es un marco de identidad creado sobre el protocolo OAuth 2.0 que amplía la autorización de los procesos OAuth 2.0 para implementar su mecanismo de autenticación. OpenID Connect añade un mecanismo de descubrimiento que permite a los usuarios utilizar una autoridad externa de confianza como proveedor de identidad. Desde otro punto de vista, esto puede verse como un sistema de inicio de sesión único (SSO).

source: OAuth 2.0 is an authorization framework which is capable of providing a way for clients to access a resource with restricted access on behalf of the resource owner. OpenID Connect allows clients to verify the users with an authorization server based authentication.
es: OAuth 2.0 es un marco de autorización que permite a los clientes acceder a un recurso con acceso restringido en nombre del propietario del recurso. OpenID Connect permite a los clientes verificar a los usuarios con una autenticación basada en un servidor de autorización.

source: As an OP, GeoNode will be able to act as trusted identity provider, thus allowing the system working on an isolated environment and/or allow GeoNode to authenticate private users managed by the local DJango auth subsystem.
es: Como OP, GeoNode podrá actuar como proveedor de identidad confiable, lo que permitirá que el sistema funcione en un entorno aislado y/o permitirá que GeoNode autentique a usuarios privados gestionados por el subsistema de autenticación local de Django.

source: *GeoServer as OAuth2 Relying Party (RP)*
es: *GeoServer como entidad de confianza (RP) de OAuth2*

source: Thanks to the **OAuth2 Authentication** GeoServer is able to retrieve an end user's identity directly from the OAuth2 Provider (OP).
es: Gracias a la **Autenticación OAuth2**, GeoServer puede recuperar la identidad de un usuario final directamente del proveedor OAuth2 (OP).

source: With GeoNode acting as an OP, the mechanism will avoid the use of cookies relying, instead, on the OAuth2 secure protocol.
es: Con GeoNode actuando como OP, el mecanismo evitará el uso de cookies confiando, en cambio, en el protocolo seguro OAuth2.

source: How the OAuth2 Protocol works:
es: Cómo funciona el protocolo OAuth2:

source: The relying party sends the request to the OAuth2 provider to authenticate the end user
es: La parte confiada envía la solicitud al proveedor de OAuth2 para autenticar al usuario final.

source: The OAuth2 provider authenticates the user
es: El proveedor OAuth2 autentica al usuario

source: The OAuth2 provider sends the ID token and access token to the relying party
es: El proveedor de OAuth2 envía el ID token y el token de acceso a la parte confiada.

source: The relying party sends a request to the user info endpoint with the access token received from OAuth2 provider
es: La parte que confía envía una solicitud al endpoint de información del usuario con el token de acceso recibido del proveedor OAuth2.

source: The user info endpoint returns the claims.
es: El endpoint de información del usuario devuelve las claims (afirmaciones).

source: **GeoNode / GeoServer Authorization Mechanism**
es: **Mecanismo de autorización de GeoNode/GeoServer**

source: Allowing GeoServer to make use of a OAuth2 in order to act as an OAuth2 RP, is not sufficient to map a user identity to its roles though.
es: Sin embargo, permitir que GeoServer utilice un OAuth2 para actuar como un RP OAuth2 no es suficiente para asignar la identidad de un usuario a sus roles.

source: On GeoServer side we will still need to a ``RoleService`` which would be able to talk to GeoNode and transform the tokens into a User Principal to be used within the GeoServer Security subsystem itself.
es: En el lado de GeoServer, todavía necesitaremos un ``RoleService`` que pueda comunicarse con GeoNode y transformar los tokens en un User Principal para ser utilizado dentro del propio subsistema de seguridad de GeoServer.

source: In other words after a successfull Authentication, GeoServer needs to Authorize the user in order to understand which resources he is enable to access or not. A ``REST based RoleService`` on GeoNode side, allows GeoServer to talk to GeoNode via `REST <https://en.wikipedia.org/wiki/Representational_state_transfer>`_ to get the current user along with the list of its Roles.
es: En otras palabras, después de una autenticación exitosa, GeoServer debe autorizar al usuario para saber a qué recursos puede acceder o no. Un ``RolService basado en REST`` del lado de GeoNode permite que GeoServer se comunique con GeoNode a través de ``REST <https://en.wikipedia.org/wiki/Representational_state_transfer>`_ para obtener el usuario actual junto con la lista de sus Roles.

source: Nevertheless knowing the Roles associated to a user is not sufficient. The complete GeoServer Authorization needs to catch a set of ``Access Rules``, associated to the Roles, in order to establish which resources and data are accessible by the user.
es: Sin embargo, conocer los Roles asociados a un usuario no es suficiente. La Autorización completa de GeoServer necesita captar un conjunto de ``Reglas de Acceso``, asociadas a los Roles, para poder establecer qué recursos y datos son accesibles para el usuario.

source: The GeoServer Authorization is based on Roles only, therefore for each authenticated user we need also to know:
es: La autorización de GeoServer se basa únicamente en roles, por lo tanto, para cada usuario autenticado también necesitamos saber:

source: The Roles associated to a valid user session
es: Los roles asociados a una sesión de usuario válida

source: The access permissions associated to a GeoServer Resource
es: Los permisos de acceso asociados a un recurso GeoServer
