Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/advanced/components/index.po
Languages: es

source: Here below you can find a bash script which simplifies the Keystore SSL Certificates importing. Use it at your convenience.
es: A continuación, encontrarás un script bash que simplifica la importación de certificados SSL de Keystore. Úsalo cuando te resulte conveniente.

source: GeoFence Rules Management and Tutorials
es: Tutoriales y gestión de reglas de GeoFence

source: `This tutorial <http://docs.geoserver.org/latest/en/user/community/geofence-server/tutorial.html>`_ shows how to install and configure the Geofence Internal Server plug-in. It shows how to create rules in two ways: using the GUI and REST methods.
es: `Este tutorial <http://docs.geoserver.org/latest/en/user/community/geofence-server/tutorial.html>`_ muestra cómo instalar y configurar el complemento Geofence Internal Server. Muestra cómo crear reglas de dos maneras: usando la interfaz gráfica de usuario y los métodos REST.

source: GeoFence Rules can be created / updated / deleted through a REST API, accessible only by a GeoServer Admin user. You can find more details on how the GeoFence REST API works `here <https://github.com/geoserver/geofence/wiki/REST-API>`__.
es: Las reglas de GeoFence se pueden crear, actualizar o eliminar a través de una API REST, a la que solo puede acceder un usuario administrador de GeoServer. Puede encontrar más detalles sobre cómo funciona la API REST de GeoFence aquí <https://github.com/geoserver/geofence/wiki/REST-API>`__.

source: GeoFence Rules Storage Configuration
es: Configuración de almacenamiento de reglas de GeoFence

source: By default GeoFence is configured to use a filesystem based DB stored on the GeoServer Data Dir ``<GEOSERVER_DATA_DIR/geofence``.
es: De forma predeterminada, GeoFence está configurado para utilizar una base de datos basada en un sistema de archivos almacenada en el directorio de datos de GeoServer ``<GEOSERVER_DATA_DIR/geofence``.

source: It is possible also to configure GeoFence in order to use an external PostgreSQL / PostGIS Database. For more details please refer to the official GeoFence documentation `here <https://github.com/geoserver/geofence/wiki/GeoFence-configuration>`__.
es: También es posible configurar GeoFence para utilizar una base de datos PostgreSQL/PostGIS externa. Para obtener más detalles, consulta la documentación oficial de GeoFence aquí <https://github.com/geoserver/geofence/wiki/GeoFence-configuration>`__.

source: Add ``Java Libraries`` to ``GeoServer``
es: Agregar ``Bibliotecas Java`` a ``GeoServer``

source: Either create a DB with the updated schema `here <https://github.com/geoserver/geofence/blob/master/doc/setup/sql/002_create_schema_postgres.sql>`_ or enable the hbm2ddl auto creation through the configuration file (see step ``3``)
es: Crea una base de datos con el esquema actualizado `aquí <https://github.com/geoserver/geofence/blob/master/doc/setup/sql/002_create_schema_postgres.sql>`_ o habilita la creación automática de hbm2ddl a través del archivo de configuración (consulte el paso ``3``)

source: Notice that "update" also creates the tables if they do not exist. In production, however, I would suggest to change it to "validate"
es: Ten en cuenta que "update" también crea las tablas si no existen. Sin embargo, en producción, sugerimos cambiarlo a "validate"

source: Add configuration similar to ``geofence-datasource-ovr.properties`` sample below (if loaded as GeoServer extension)
es: Agrega una configuración similar al ejemplo ``geofence-datasource-ovr.properties`` que aparece a continuación (si está cargada como extensión GeoServer)
