Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/advanced/components/index.po
Languages: es

source: The Authentication mechanism above allows GeoServer to get information about the user and his Roles, which addresses point 1.
es: El mecanismo de autenticación anterior permite a GeoServer obtener información sobre el usuario y sus roles, lo que aborda el punto 1.

source: About point 2, GeoServer makes use of the `GeoFence Embedded Server <http://docs.geoserver.org/latest/en/user/community/geofence-server/index.html>`_ plugin. GeoFence is a java web application that provides an advanced authentication / authorization engine for GeoServer using the interface described in `here <https://github.com/geoserver/geofence/wiki/First-steps>`__. GeoFence has its own rules database for the management of Authorization rules, and overrides the standard GeoServer security management system by implementing a sophisticated Resource Access Manager. Least but not last, GeoFence implements and exposes a `REST API <https://github.com/geoserver/geofence/wiki/REST-API>`_ allowing remote authorized clients to read / write / modify security rules.
es: En relación con el punto 2, GeoServer hace uso del complemento `GeoFence Embedded Server <http://docs.geoserver.org/latest/en/user/community/geofence-server/index.html>`_. GeoFence es una aplicación web Java que proporciona un motor de autenticación/autorización avanzado para GeoServer utilizando la interfaz descrita `aquí <https://github.com/geoserver/geofence/wiki/First-steps>`__. GeoFence tiene su propia base de datos de reglas para la gestión de reglas de autorización y reemplaza el sistema de gestión de seguridad estándar de GeoServer implementando un sofisticado Resource Access Manager. Por último, pero no por ello menos importante, GeoFence implementa y expone una `REST API <https://github.com/geoserver/geofence/wiki/REST-API>`_ que permite a los clientes remotos autorizados leer/escribir/modificar reglas de seguridad.

source: The advantages using such plugin are multiple:
es: Las ventajas de utilizar este complemento son múltiples:

source: The Authorizations rules have a fine granularity. The security rules are handled by GeoFence in a way similar to the iptables ones, and allow to define security constraints even on sub-regions and attributes of layers.
es: Las reglas de autorización tienen una granularidad fina. Las reglas de seguridad son manejadas por GeoFence de manera similar a las de iptables y permiten definir restricciones de seguridad incluso en subregiones y atributos de capas.

source: GeoFence exposes a REST interface to its internal rule database, allowing external managers to update the security constraints programmatically
es: GeoFence expone una interfaz REST a su base de datos de reglas internas, lo que permite a los administradores externos actualizar las restricciones de seguridad de manera programática.

source: GeoFence implements an internal caching mechanism which improves considerably the performances under load.
es: GeoFence implementa un mecanismo de almacenamiento en caché interno que mejora considerablemente el rendimiento bajo carga.

source: *GeoNode interaction with GeoFence*
es: *Interacción de GeoNode con GeoFence*

source: GeoNode itself is able to push/manage Authorization rules to GeoServer through the GeoFence `REST API <https://github.com/geoserver/geofence/wiki/REST-API>`_, acting as an administrator for GeoServer. GeoNode properly configures the GeoFence rules anytime it is needed, i.e. the permissions of a Resource / Layer are updated.
es: GeoNode en sí mismo es capaz de gestionar y aplicar reglas de autorización en GeoServer a través de la `API REST de GeoFence <https://github.com/geoserver/geofence/wiki/REST-API>`_, actuando como administrador para GeoServer. GeoNode configura correctamente las reglas de GeoFence cada vez que es necesario, es decir, cuando se actualizan los permisos de un Recurso / Capa.

source: GeoServer must know and must be able to access GeoNode via HTTP/HTTPS. In other words, an external user connected to GeoNode must be authenticated to GeoServer with same permissions. This is possible through the **GeoNodeCoockieProcessingFiler**.
es: GeoServer debe conocer y poder acceder a GeoNode a través de HTTP/HTTPS. En otras palabras, un usuario externo conectado a GeoNode debe estar autenticado en GeoServer con los mismos permisos. Esto es posible a través de **GeoNodeCoockieProcessingFiler**.

source: Summarizing we will have different ways to access GeoNode Layers:
es: Resumiendo tendremos diferentes formas de acceder a las capas de GeoNode:

source: Through GeoNode via DJango Authentication and **GeoNodeCoockieProcessingFiler**; basically the users available in GeoNode are also valid for GeoServer or any other backend.
es: A través de GeoNode vía DJango Authentication y **GeoNodeCoockieProcessingFiler**; básicamente los usuarios disponibles en GeoNode también son válidos para GeoServer o cualquier otro backend.

source: If a GeoNode user has "administrator" rights, he will be able to administer GeoServer too.
es: Si un usuario de GeoNode tiene derechos de “administrador”, también podrá administrar GeoServer.

source: Through GeoServer Security Subsystem; it will be always possible to access to GeoServer using its internal security system and users, unless explictly disabled (**warning** this is dangerous, you must know what you are doing).
es: A través del Subsistema de Seguridad de GeoServer, siempre será posible acceder a GeoServer usando su sistema de seguridad interno y usuarios, a menos que esté explícitamente deshabilitado (**advertencia** esto es peligroso, debe saber lo que está haciendo).

source: Let's now see in details how the single pieces are configured and how they can be configured.
es: Veamos ahora en detalle cómo se configuran las piezas individuales y cómo se pueden configurar.

source: DJango OAuth Toolkit Setup and Configuration
es: Configuración e instalación de DJango OAuth Toolkit

source: As stated above, GeoNode makes use of the OAuth2 protocol for all the frontend interactions with GeoServer. GeoNode must be configured as an OAuth2 Provider and provide a ``Client ID`` and a ``Client Sercret`` key to GeoServer. This is possible by enabling and configuring the `Django OAuth Toolkit Plugin <https://django-oauth-toolkit.readthedocs.io/en/latest/>`_.
es: Como se indicó anteriormente, GeoNode utiliza el protocolo OAuth2 para todas las interacciones del frontend con GeoServer. GeoNode debe configurarse como un proveedor OAuth2 y proporcionar un ``ID de cliente`` y una clave ``Client Secret`` a GeoServer. Esto es posible habilitando y configurando el `Complemento Django OAuth Toolkit <https://django-oauth-toolkit.readthedocs.io/en/latest/>`_.

source: GeoNode and GeoServer won't work at all if the following steps are not executed at the first installation.
es: GeoNode y GeoServer no funcionarán en absoluto si no se ejecutan los siguientes pasos en la primera instalación.

source: Default ``settings.py`` Security Settings for OAuth2
es: Configuración de seguridad predeterminada ``settings.py`` para OAuth2

source: Double check that the OAuth2 Provider and Security Plugin is enabled and that the settings below are correctly configured.
es: Verifique nuevamente que el proveedor OAuth2 y el complemento de seguridad estén habilitados y que las configuraciones a continuación estén configuradas correctamente.

source: ``AUTH_IP_WHITELIST`` property limits access to users/groups REST Role Service endpoints to the only whitelisted IP addresses. Empty list means 'allow all'. If you need to limit 'api' REST calls to only some specific IPs fill the list like this: ``AUTH_IP_WHITELIST = ['192.168.1.158', '192.168.1.159']``
es: La propiedad ``AUTH_IP_WHITELIST`` limita el acceso a los puntos finales del servicio de rol REST de usuarios/grupos a las únicas direcciones IP incluidas en la lista blanca. Una lista vacía significa 'permitir todo'. Si necesita limitar las llamadas REST de 'api' a solo algunas IP específicas, complete la lista de esta manera: ``AUTH_IP_WHITELIST = ['192.168.1.158', '192.168.1.159']``

source: In order to allow GeoNode to act as an OAuth2 Provider, we need to enable the ``oauth2_provider`` DJango application provided by the "Django OAuth Toolkit".
es: Para permitir que GeoNode actúe como un proveedor OAuth2, debemos habilitar la aplicación DJango ``oauth2_provider`` proporcionada por "Django OAuth Toolkit".

source: Installing the `oauth2_provider`` DJango application is not sufficient to enable the full functionality. We need also GeoNode to include additional entities to its internal model.
es: La instalación de la aplicación DJango ``oauth2_provider`` no es suficiente para habilitar la funcionalidad completa. También necesitamos que GeoNode incluya entidades adicionales a su modelo interno.

source: In order to allow GeoNode to act as an OAuth2 Provider, we need to enable the ``oauth2_provider.backends.OAuth2Backend`` DJango backend provided by the "Django OAuth Toolkit". Also notice that we need to specify the OAuth2 Provider scopes and declare which ``generator`` to use in order to create ``OAuth2 Client IDs``.
es: Para permitir que GeoNode actúe como proveedor de OAuth2, debemos habilitar el backend de DJango ``oauth2_provider.backends.OAuth2Backend`` provisto por el "Django OAuth Toolkit". Observe también que debemos especificar los alcances del proveedor de OAuth2 y declarar qué ``generador`` utilizar para crear ``ID de cliente de OAuth2``.

source: Django OAuth Toolkit Admin Setup
es: Configuración de administrador del kit de herramientas OAuth de Django

source: Once the ``settings.py`` and ``local_settings.py`` have been correctly configured for your system:
es: Una vez que ``settings.py`` y ``local_settings.py`` se hayan configurado correctamente para su sistema:

source: Complete the GeoNode setup steps
es: Complete los pasos de configuración de GeoNode

source: Prepare the model
es: Preparar el modelo

source: Prepare the static data
es: Preparar los datos estáticos

source: Make sure the database has been populated with initial default data
es: Asegúrese de que la base de datos se haya rellenado con los datos predeterminados iniciales

source: *Deprecated* this command will be replaced by migrations in the future, so be careful.
es: *Obsoleto* este comando será reemplazado por migraciones en el futuro, así que tenga cuidado.

source: Make sure there exists a superuser for your environment
es: Asegúrese de que exista un superusuario para su entorno

source: Read the base tutorials on GeoNode Developer documentation for details on the specific commands and how to use them.
es: Lea los tutoriales básicos en la documentación de GeoNode Developer para obtener detalles sobre los comandos específicos y cómo usarlos.

source: Start the application
es: Iniciar la aplicación

source: Start GeoNode accordingly on how the setup has been done; run debug mode through ``paver``, or proxied by an HTTP Server like Apache2 HTTPD, Nginx or others.
es: Inicie GeoNode según cómo se haya realizado la configuración; ejecute el modo de depuración a través de ``paver``, o mediante un servidor HTTP como Apache2 HTTPD, Nginx u otros.

source: Finalize the setup of the OAuth2 Provider
es: Finalizar la configuración del proveedor OAuth2

source: First of all you need to configure and create a new OAuth2 Application called ``GeoServer`` through the GeoNode Admin Dashboard
es: En primer lugar, debe configurar y crear una nueva aplicación OAuth2 llamada ``GeoServer`` a través del panel de administración de GeoNode.

source: Access the GeoNode Admin Dashboard
es: Acceda al panel de administración de GeoNode

source: Go to ``Django OAuth Toolkit`` > ``Applications``
es: Vaya a ``Django OAuth Toolkit`` > ``Aplicaciones``

source: Update or create the Application named ``GeoServer``
es: Actualice o cree la aplicación llamada ``GeoServer``

source: The Application name **must** be ``GeoServer``
es: El nombre de la aplicación **debe** ser ``GeoServer``

source: ``Client id``; An alphanumeric code representing the OAuth2 Client Id. GeoServer OAuth2 Plugin **will** use **this** value.
es: ``ID de cliente``; un código alfanumérico que representa el ID de cliente de OAuth2. El complemento OAuth2 de GeoServer **utilizará** este** valor.

source: In a production environment it is **highly** recommended to modify the default value provided with GeoNode installation.
es: En un entorno de producción es **altamente** recomendable modificar el valor predeterminado proporcionado con la instalación de GeoNode.

source: ``User``; Search for the ``admin`` user. Its ``ID`` will be automatically updated into the form.
es: ``User``; Busca el usuario ``admin``. Su ``ID`` se actualizará automáticamente en el formulario.

source: ``Redirect uris``; It is possible to specify many URIs here. Those must coincide with the GeoServer instances URIs.
es: ``Redirect uris``; Es posible especificar aquí varios URI. Estos deben coincidir con los URI de las instancias de GeoServer.

source: ``Client type``; Choose ``Confidential``
es: ``Client type``; seleccione ```Confidential``

source: ``Authorization grant type``; Choose ``Authorization code``
es: ``Authorization grant type``; Elija ``Authorization code``

source: ``Client secret``; An alphanumeric code representing the OAuth2 Client Secret. GeoServer OAuth2 Plugin **will** use **this** value.
es: ``Client secret``; un código alfanumérico que representa el secreto del cliente de OAuth2. El complemento GeoServer OAuth2 **utilizará** este** valor.

source: ``Name``; **Must** be ``GeoServer``
es: ``Name``; **Debe** ser ``GeoServer``

source: GeoServer Security Backend
es: Backend de seguridad de GeoServer

source: GeoServer has a robust security subsystem, modeled on Spring Security. Most of the security features are available through the Web administration interface.
es: GeoServer cuenta con un subsistema de seguridad robusto, basado en Spring Security. La mayoría de las funciones de seguridad están disponibles a través de la interfaz de administración web.

source: For more details on how this works and how to configure and modify it, please refer to the official GeoServer guide http://docs.geoserver.org/stable/en/user/security/webadmin/index.html
es: Para obtener más detalles sobre cómo funciona esto y cómo configurarlo y modificarlo, consulte la guía oficial de GeoServer http://docs.geoserver.org/stable/en/user/security/webadmin/index.html

source: By using the ``GeoServer Data Dir`` provided with GeoNode build, the following configuration are already available. You will need just to update them accordingly to your environment (like IP addresses and Host names, OAuth2 Keys, and similar things). However it is recommended to read carefully all the following passages in order to understand exactly how the different component are configured and easily identify any possible issue during the deployment.
es: Al utilizar el directorio de datos de GeoServer que se incluye con la compilación de GeoNode, ya está disponible la siguiente configuración. Solo deberá actualizarla de acuerdo con su entorno (como direcciones IP y nombres de host, claves OAuth2 y cosas similares). Sin embargo, se recomienda leer atentamente todos los siguientes pasajes para comprender exactamente cómo se configuran los diferentes componentes e identificar fácilmente cualquier posible problema durante la implementación.

source: The main topics of this section are:
es: Los temas principales de esta sección son:

source: Connection to the GeoNode REST Role Service
es: Conexión al servicio de rol REST de GeoNode

source: Setup of the GeoServer OAuth2 Authentication Filter
es: Configuración del filtro de autenticación OAuth2 de GeoServer

source: Configuration of the GeoServer Filter Chains
es: Configuración de las cadenas de filtros de GeoServer

source: Setup and test of the GeoFence Server and Default Rules
es: Configuración y prueba del servidor GeoFence y reglas predeterminadas

source: Preliminary checks
es: Comprobaciones preliminares

source: GeoServer is up and running and you have admin rights
es: GeoServer está en funcionamiento y tienes derechos de administrador.

source: GeoServer must reach the GeoNode instance via HTTP
es: GeoServer debe llegar a la instancia GeoNode a través de HTTP

source: The GeoServer Host IP Address must be allowed to access the GeoNode Role Service APIs (see the section ``AUTH_IP_WHITELIST`` above)
es: La dirección IP del host de GeoServer debe tener permiso para acceder a las API del servicio de rol de GeoNode (consulte la sección ``AUTH_IP_WHITELIST`` más arriba)

source: Setup of the GeoNode REST Role Service
es: Configuración del servicio de rol REST de GeoNode

source: Login as ``admin`` to the GeoServer GUI
es: Inicia sesión como ``admin`` en la GUI de GeoServer

source: In a production system remember to change the default admin credentials ``admin`` \ ``geoserver``
es: En un sistema de producción recuerda cambiar las credenciales de administrador predeterminadas ``admin`` \ ``geoserver``

source: Access the ``Security`` > ``Users, Groups, Roles`` section
es: Accede a la sección ``Seguridad`` > ``Usuarios, Grupos, Roles``

source: **If not yet configured** the service ``geonode REST role service``, click on ``Role Services`` > ``Add new``
es: **Si aún no está configurado** el servicio ``geonode REST role service``, haz clic en ``Servicios de rol`` > ``Agregar nuevo``

source: This passage is **not** needed if the ``geonode REST role service`` has been already created. If so it will be displayed among the Role Services list
es: Este pasaje **no** es necesario si ya se has creado el ``servicio de rol REST de geonodo``. En ese caso, se mostrará en la lista de servicios de rol.

source: **If not yet configured** the service ``geonode REST role service``, choose ``AuthKEY REST - Role service from REST endpoint``
es: **Si aún no está configurado** el servicio ``geonode REST role service``, selecciona ``AuthKEY REST - Role service from REST endpoint``

source: Create / update the ``geonode REST role service`` accordingly
es: Crea o actualiza el ``servicio de rol REST geonode`` según corresponda

source: ``Name``; **Must** be ``geonode REST role service``
es: ``Name``; **Debe** ser ``geonode REST role service``

source: ``Base Server URL``; Must point to the GeoNode instance base URL (e.g. ``http://<geonode_host_url>``)
es: ``Base Server URL``; debe apuntar a la URL base de la instancia de GeoNode (p. ej., ``http://<geonode_host_url>``)

source: ``Roles REST Endpoint``; Enter ``/api/roles``
es: ``Roles REST Endpoint```; Ingresa ``/api/roles``

source: ``Admin Role REST Endpoint``; Enter ``/api/adminRole``
es: ``Admin Role REST Endpoint``; Ingresa ``/api/adminRole``

source: ``Users REST Endpoint``; Enter ``/api/users``
es: ``Users REST Endpoint``; Ingresa ``/api/users``

source: ``Roles JSON Path``; Enter ``$.groups``
es: ``Roles JSON Path``; Ingresa ``$.groups``

source: ``Admin Role JSON Path``; Enter ``$.adminRole``
es: ``Admin Role JSON Path``; Ingresa ``$.adminRole``

source: ``Users JSON Path``; Enter ``$.users[0].groups``
es: ``Users JSON Path``; Ingresa ``$.users[0].groups``

source: Once everything has been setup and it is working, choose the ``Administrator role`` and ``Group administrator role`` as ``ROLE_ADMIN``
es: Una vez que todo esté configurado y funcione, elije el ``rol de administrador`` y el ``rol de administrador de grupo`` como ``ROLE_ADMIN``

source: Allow GeoFence to validate rules with ``ROLES``
es: Permitir que GeoFence valide reglas con ``ROLES``

source: The following instruction are different accordingly to the GeoServer version you are currently using.
es: Las siguientes instrucciones son diferentes según la versión de GeoServer que esté utilizando actualmente.

source: GeoServer 2.9.x and 2.10.x
es: GeoServer 2.9.x y 2.10.x

source: Access the ``Security`` > ``Settings`` section
es: Acceda a la sección ``Seguridad`` > ``Configuración``

source: Choose the ``geonode REST role service`` as ``Active role service``
es: Seleccione el ``servicio de rol REST geonode`` como ``Servicio de rol activo``

source: GeoServer 2.12.x and above
es: GeoServer 2.12.x y superior

source: With the latest updates to GeoFence Plugin, the latter no more recognizes the Role Service from the default settings but from the ``geofence-server.properties`` file.
es: Con las últimas actualizaciones del complemento GeoFence, este último ya no reconoce el servicio de rol desde la configuración predeterminada, sino desde el archivo ``geofence-server.properties``.

source: That said, it is important that the ``Security`` > ``Settings`` role service will be set to **default**, in order to allow GeoServer following the standard authorization chain.
es: Dicho esto, es importante que el servicio de rol ``Seguridad`` > ``Configuración`` se configure como **predeterminado**, para permitir que GeoServer siga la cadena de autorización estándar.

source: On the other side, you will need to be sure that the ``geofence-server.properties`` file under the ``$GEOSERVER_DATA_DIR/geofence`` folder, contains the two following additional properties: ::
es: Por otro lado, deberás asegurarte de que el archivo ``geofence-server.properties`` bajo la carpeta ``$GEOSERVER_DATA_DIR/geofence``, contenga las dos propiedades adicionales siguientes: ::

source: It is necessary now check that GeoServer can connect to OAuth2 Providers (specifically to GeoNode OP), and being able to Authenticate users through it.
es: Ahora es necesario verificar que GeoServer pueda conectarse a proveedores OAuth2 (específicamente a GeoNode OP) y poder autenticar usuarios a través de él.

source: OAuth2 ``Client ID`` and ``Client Secret`` have been generated on GeoNode and known
es: SLos valores de ``Client ID`` y ``Client Secret`` de OAuth2 han sido generados en GeoNode y son conocidos.

source: Setup of the GeoNode OAuth2 Security Filter
es: Configuración del filtro de seguridad OAuth2 de GeoNode

source: Access the ``Security`` > ``Authentication`` section
es: Accede a la sección ``Seguridad`` > ``Autenticación``

source: **If not yet configured** the Authentication Filter ``geonode-oauth2 - Authentication using a GeoNode OAuth2``, click on ``Authentication Filters`` > ``Add new``
es: **Si aún no está configurado** el Filtro de autenticación ``geonode-oauth2 - Authentication using a GeoNode OAuth2``, haz clic en ``Filtros de autenticación`` > ``Agregar nuevo``

source: This passage is **not** needed if the ``geonode-oauth2 - Authentication using a GeoNode OAuth2`` has been already created. If so it will be displayed among the Authentication Filters list
es: Este pasaje **no** es necesario si ya se ha creado el ``geonode-oauth2 - Authentication using a GeoNode OAuth2``. En ese caso, se mostrará entre la lista de filtros de autenticación.

source: **If not yet configured** the Authentication Filter ``geonode-oauth2 - Authentication using a GeoNode OAuth2``, choose ``GeoNode OAuth2 - Authenticates by looking up for a valid GeoNode OAuth2 access_token key sent as URL parameter``
es: **Si aún no está configurado** el filtro de autenticación ``geonode-oauth2 - Authentication using a GeoNode OAuth2``, seleccione ``GeoNode OAuth2 - Authenticates by looking up for a valid GeoNode OAuth2 access_token key sent as URL parameter``

source: Create / update the ``geonode-oauth2 - Authentication using a GeoNode OAuth2`` accordingly
es: Crea o actualiza ``geonode-oauth2 - Authentication using a GeoNode OAuth2`` según corresponda

source: ``Name``; **Must** be ``geonode-oauth2``
es: ``Name``; **Debe** ser ``geonode-oauth2``
