Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/maps_configuration/attribute_table.po
Languages: es

source: Attributes Table
es: Tabla de atributos

source: When clicking on the |attribute_table_button| button of the :ref:`toc`, the *Attributes Table* panel opens at the bottom of the *Map* page.
es: Al hacer clic en el botón |attribute_table_but| del :ref:`toc`, el panel *Tabla de Atributos* se abre en la parte inferior de la página *Mapa*.

source: *The Attributes Table Panel*
es: *El panel de la tabla de atributos*

source: In that panel you can navigate through the features of the dataset, zoom to their geometries by clicking on the |zoom_to_feature_icon| icon and explore their attributes.
es: En ese panel puede navegar a través de las características del conjunto de datos, hacer zoom a sus geometrías haciendo clic en |zoom_to_feature_icon| icono y explorar sus atributos.

source: The *Attribute Tables* has a row for each feature belonging to the dataset and a column for each attribute that describes the feature.
es: Las *Tablas de atributos* tienen una fila para cada característica que pertenece al conjunto de datos y una columna para cada atributo que describe la característica.

source: Each column has a *Filter* input field through which you can filter the features basing on some value or expression (depending on the data type of the field).
es: Cada columna tiene un campo de entrada *Filtro* a través del cual puede filtrar las características basándose en algún valor o expresión (dependiendo del tipo de datos del campo).

source: *Filtering Features by Attribute*
es: *Filtrado de funciones por atributo*

source: The *Attributes Table* panel contains a *Toolbar* which makes you available some useful functionalities.
es: El panel *Tabla de atributos* contiene una *Barra de herramientas* que pone a su disposición algunas funcionalidades útiles.

source: *The Attributes Table Toolbar*
es: *La barra de herramientas de la tabla de atributos*

source: Those functionalities are:
es: Esas funcionalidades son:

source: *Edit Mode*
es: *Modo de edición*

source: By clicking on |edit_mode_button| you can start an editing session. It permits you to add new features, to delete or modify the existing ones, to edit geometries. See the :ref:`dataset-data-editing` section for further information.
es: Al hacer clic en |edit_mode_button| puedes iniciar una sesión de edición. Te permite agregar nuevas funciones, eliminar o modificar las existentes, editar geometrías. Consulta la sección :ref:`dataset-data-editing` para obtener más información.

source: *Advanced Search*
es: *Búsqueda Avanzada*

source: Click on |advanced_search_button|, a new panel opens. That panel allows you to filter features in many different ways. This functionality will be explained in depth in the :ref:`advanced-search` section.
es: Haz clic en |advanced_search_button|, se abre un nuevo panel. Ese panel te permite filtrar funciones de muchas maneras diferentes. Esta funcionalidad se explicará en profundidad en la sección :ref:`búsqueda avanzada`.

source: *Zoom to page extent*
es: *Zoom a la extensión de la páginaa*

source: Click on |zoom_to_page_extent_button| to zoom to the page extent.
es: Haz clic en |zoom_to_page_extent_button| para ampliar la extensión de la página.

source: *Export Data*
es: *Exportar datos*

source: Click on |export_data_button| to open the export/download data form.
es: Haz clic en |export_data_button| para abrir el formulario de exportación/descarga de datos.

source: *Hide/show columns*
es: *Ocultar/mostrar columnas*

source: When clicking on |hide_show_columns_button| another panel opens inside the *Attributes Table*. Through that panel you can choose what columns you want to see.
es: Al hacer clic en |hide_show_columns_button| se abre otro panel dentro de la *Tabla de Atributos*. A través de ese panel puedes elegir qué columnas quieres ver.

source: *Create a chart*
es: *Crear un gráfico*

source: Through the |create_charts_button| button you can open the *Chart Widgets* panel where many functionalities to describe and visualize the dataset data are available (see :ref:`creating-widgets`).
es: A través del |create_charts_button| Puede abrir el panel *Widgets de gráficos* donde están disponibles muchas funcionalidades para describir y visualizar los datos del conjunto de datos (ver :ref:`creación de widgets`).

source: *Sync map with filter*
es: *Sincronizar mapa con filtro*

source: Click on the |sync_map_with_filter_button| icon to synchronize the map with the filter.
es: Haz clic en el icono |sync_map_with_filter_button| para sincronizar el mapa con el filtro.

source: Advanced Search
es: Búsqueda Avanzada

source: As mentioned before, GeoNode allows both an attribute based and spatial filtering. When clicking on |advanced_search_button| from the dataset *Attributes Table* the *Advanced Search* panel opens and shows you three different filtering functionalities:
es: Como se mencionó anteriormente, GeoNode permite un filtrado espacial y basado en atributos. Al hacer clic en |advanced_search_button| desde el conjunto de datos *Tabla de atributos* se abre el panel *Búsqueda avanzada* y le muestra tres funcionalidades de filtrado diferentes:

source: In the **Attribute Filter** section you can compose a series of conditions about the attributes of the dataset. Click on |add_condition_button| to insert a new empty condition. Select the attribute you are interested in, select an operator and type a comparison value. You can group conditions through the *Add Group* |add_group_button| button. Click on |start_search_button| to perform the search.
es: En la sección **Filtro de atributos** puedes componer una serie de condiciones sobre los atributos del conjunto de datos. Haz clic en |add_condition_button| para insertar una nueva condición vacía. Selecciona el atributo que te interesa, selecciona un operador y escribe un valor de comparación. Puedes agrupar condiciones a través de *Agregar grupo* |add_group_button| botón. Haz clic en |start_search_button| para realizar la búsqueda.

source: *Filtering by Attributes*
es: *Filtrado por Atributos*

source: You can also decide if *All* the conditions have to be met, if only *Any* or *None* of them (see the red arrow in the picture above).
es: También puedes decidir si se deben cumplir *Todas* las condiciones, si solo *Cualquiera* o *Ninguna* (ver la flecha roja en la imagen de arriba).

source: The ** Area of interest** filtering allows you to filter features that have some relationship with a spatial region that you draw on the map.
es: El filtrado **Área de interés** te permite filtrar entidades que tienen alguna relación con una región espacial que dibuja en el mapa.

source: Select the *Filter Type* (Circle, Viewport, Polygon or Rectangle), draw the spatial region of interest on the map, select a *Geometric Operation* (Intersects, Bounding Box, Contains or Is contained) and then click on |start_search_button|.
es: Selecciona el *Tipo de filtro* (Círculo, Ventana gráfica, Polígono o Rectángulo), dibuja la región espacial de interés en el mapa, selecciona una *Operación geométrica* (Intersecta, Cuadro delimitador, Contiene o Está contenido) y luego haz clic en |start_search_button| .

source: *Filtering by Area Of Interest*
es: *Filtrado por Área de Interés*

source: Through the **Dataset Filter** you can select only those features which comply with some conditions on other datasets of the map. You can also add conditions on attributes for those datasets.
es: A través del **Filtro de conjunto de datos** puedes seleccionar solo aquellas entidades que cumplan con algunas condiciones en otros conjuntos de datos del mapa. También puedes agregar condiciones a los atributos de esos conjuntos de datos.

source: *Dataset Filtering*
es: *Filtrado de conjuntos de datos*

source: You can read more about the *Attributes Table* and the *Advanced Search* on the `MapStore Documentation <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/filtering-layers/#query-panel>`_.
es: Puedes leer más sobre la *Tabla de atributos* y la *Búsqueda avanzada* en la `Documentación de MapStore <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/filtering-layers/#query-panel>`_.
