Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/maps_configuration/creating_widgets.po
Languages: es

source: Creating Widgets
es: Creando widgets

source: *Widgets* are graphical elements that describe the datasets data. They can be of different types such as *Charts*, *Texts*, *Tables* and *Counters*. Through the |create_widgets_button| button of the :ref:`toc` you can open the *Widgets* panel.
es: Los *Widgets* son elementos gráficos que describen los datos del conjunto de datos. Pueden ser de diferentes tipos como *Gráficos*, *Textos*, *Tablas* y *Contadores*. A través del |create_widgets_button| del :ref:`toc` puedes abrir el panel *Widgets*.

source: *Creating Widgets*
es: *Creación de widgets*

source: Chart Widgets
es: Widgets de gráficos

source: *Chart Widgets* are graphical representations of the dataset data. They can be *Bar Chart*, *Pie Chart* or *Line Chart* as shown in the picture below.
es: *Los widgets de gráficos* son representaciones gráficas de los datos del conjunto de datos. Pueden ser *Gráfico de barras*, *Gráfico circular* o *Gráfico de líneas* como se muestra en la siguiente imagen.

source: *Chart Widgets*
es: *Widgets de gráficos*

source: Lets create a new **Bar Chart**.
es: Creemos un nuevo **Gráfico de barras**.

source: Click on *Bar Chart* then select the *X Attribute*, the *Y Attribute*, the *Operation* and the *Color* do you prefer. You can also display the *Legend*, *Hide the Y axis*, *Hide the grid* and decide what *Label* display into the legend.
es: Haz clic en *Gráfico de barras* y luego selecciona el *Atributo X*, el *Atributo Y*, la *Operación* y el *Color* que prefiera. También puedes mostrar la *Leyenda*, *Ocultar el eje Y*, *Ocultar la cuadrícula* y decidir qué *Etiqueta* se muestra en la leyenda.

source: Now you can filter the data to be considered for the chart by clicking on |advanced_search_button|. We don't need any filter so click |configure_widgets_options_button| to configure other widget options. Insert a *Title* and a *Description* and click on *Save* |save_button|.
es: Ahora puedes filtrar los datos que se considerarán para el gráfico haciendo clic en |advanced_search_button|. No necesitamos ningún filtro, así que haz clic en |configure_widgets_options_button| para configurar otras opciones del widget. Inserta un *Título* y una *Descripción* y haz clic en *Guardar* |save_button|.

source: *Chart Widgets Creation*
es: *Creación de widgets de gráficos*

source: The green |connect_to_viewport| icon means that the chart is connected to the viewport.
es: El icono verde |connect_to_viewport| significa que el gráfico está conectado a la ventana gráfica.

source: At the top of the bar chat, there is the options menu of the widget where you can *Download grapg as png*, *Zoom the wigets* and *Reset axes*.
es: En la parte superior de la barra de chat, se encuentra el menú de opciones del widget donde puedes *Descargar gráfico como png*, *Hacer zoom en los widgets* y *Restablecer ejes*.

source: *Chart Widgets Options*
es: *Opciones de widgets de gráficos*

source: Text Widgets
es: Widgets de texto

source: If you select *Text* on the *Widgets* panel you can create *Text Widgets*. Add a *Title* and the desired descriptive text, then click on |save_button|.
es: Si seleccionas *Texto* en el panel *Widgets*, puedes crear *Widgets de texto*. Agrega un *Título* y el texto descriptivo deseado, luego haz clic en |save_button|.

source: *Text Widgets Creation*
es: *Creación de widgets de texto*

source: The resulting widget looks like the following.
es: El widget resultante se parece al siguiente.

source: *My Text Widget*
es: *Mi widget de texto*

source: Table Widgets
es: Widgets de tabla

source: Through the *Table Widgets* you can add the :ref:`attributes-table` of the dataset to the map. You can decide to show a subset of the features, through filters, and you can select one or more columns/attributes.
es: A través de los *Widgets de tabla* puedes agregar los :ref:`attributes-table` del conjunto de datos al mapa. Puedes decidir mostrar un subconjunto de las funciones, a través de filtros, y puedes seleccionar una o más columnas/atributos.

source: You can also enter a *Title* for each column to be displayed as the table header in place of the Name of the layer field and enter a *Description* for each field to be displayed as a tooltip, visible moving the mouse on the column header.
es: También puedes ingresar un *Título* para cada columna que se mostrará como el encabezado de la tabla en lugar del Nombre del campo de la capa, y agregar una *Descripción* para cada campo que se mostrará como una descripción emergente, visible al mover el mouse sobre el encabezado de la columna.

source: So, choose what attributes you are interested in and click on |configure_widgets_options_button|.
es: Entonces, elige los atributos que te interesan y haz clic en |configure_widgets_options_button|.

source: *Table Widgets Columns*
es: *Columnas de los Widgets de tabla*

source: Insert *Title* and *Description* (optional) and click on |save_button|. The example below shows the *Table Widget* on the map.
es: Inserta *Título* y *Descripción* (opcional) y haz clic en |save_button|. El siguiente ejemplo muestra el *Widget de tabla* en el mapa.

source: *Table Widget*
es: *Widget de tabla*

source: Counter Widgets
es: Widgets de contador

source: *Counter Widgets* are numeric representations of some attributes. For example you can represent the average speed limit on a road network.
es: *Los widgets de contador* son representaciones numéricas de algunos atributos. Por ejemplo, puedes representar el límite de velocidad promedio en una red de carreteras.

source: *Counter Widget Creation*
es: *Creación de widget de contador*

source: Click on |configure_widgets_options_button|, insert *Title* and *Description* then click on |save_button|.
es: Haz clic en |configure_widgets_options_button|, inserta *Título* y *Descripción* y luego haz clic en |save_button|.

source: *Counter Widget*
es: *Widget de contador*

source: The GeoNode map viewer is `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ based, see the `MapStore Documentation <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/widgets/>`_ for further information.
es: El visor de mapas GeoNode está basado en `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_; consulta la `Documentación de MapStore <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/widgets/>`_ para obtener más información.
