Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/maps_configuration/get_fetureinfo.po
Languages: es

source: Customizing The Datasets' GetFeatureInfo Templates
es: Personalización de las plantillas GetFeatureInfo de los conjuntos de datos

source: When “clicking” over a feature of a dataset into a GeoNode Map, an info window popups showing a formatted representation of the raw data identified by the coordinates (see Fig. 1)
es: Al hacer “clic” sobre una característica de un conjunto de datos en un Mapa de GeoNode, aparece una ventana de información que muestra una representación formateada de los datos en bruto identificados por las coordenadas (ver Fig. 1).

source: *Fig. 1*
es: *Figura 1*

source: The way how such information is presented to the user is defined by what we call “GetFeatureInfo Template”. The latter is basically an HTML snippet containing some placeholders and special inline codes that instruct GeoServer on how to generate the raw data output.
es: La forma en que dicha información se presenta al usuario se define mediante lo que llamamos "Plantilla GetFeatureInfo". Esta última es básicamente un fragmento de HTML que contiene algunos marcadores de posición y códigos en línea especiales que instruyen a GeoServer sobre cómo generar la salida de datos sin procesar.

source: The outcome is a rendered HTML snippet with the real values replacing the placeholders of the Template.
es: El resultado es un fragmento de HTML renderizado con los valores reales reemplazando los marcadores de posición de la plantilla.

source: Currently, GeoNode allows a very simple mechanism to customize the “GetFeatureInfo Template” of a dataset.
es: Actualmente, GeoNode permite un mecanismo muy simple para personalizar la "Plantilla GetFeatureInfo" de un conjunto de datos.

source: It is possible, through the dataset Metadata Editor, to assign a name, a label and also set the attributes we want to display on the GetFeatureInfo output.
es: Es posible, a través del Editor de metadatos del conjunto de datos, asignar un nombre, una etiqueta y también establecer los atributos que queremos mostrar en la salida de GetFeatureInfo.

source: As an instance, by using the example above, we can customize a bit the dataset Metadata as shown in Fig. 2
es: Por ejemplo, utilizando el ejemplo anterior, podemos personalizar un poco los metadatos del conjunto de datos como se muestra en la Fig. 2.

source: *Fig. 2*
es: *Figura 2*

source: The “GetFeatureInfo” output will change accordingly as shown in Fig. 3
es: La salida "GetFeatureInfo" cambiará en consecuencia como se muestra en la Fig. 3

source: *Fig. 3*
es: *Figura 3*

source: Simple Template: Assigning A Media-Type To Attribute Values
es: Plantilla simple: asignación de un tipo de medio a valores de atributo

source: The easiest way to render a different media-type (:guilabel:`image`, :guilabel:`audio`, :guilabel:`video` or :guilabel:`iframe`) to a property value, is to change it from the :guilabel:`Metadata Edit` attributes panel.
es: La forma más sencilla de renderizar un tipo de medio diferente (:guilabel:`imagen`, :guilabel:`audio`, :guilabel:`video` o :guilabel:`iframe`) para un valor de propiedad es cambiarlo desde el panel de atributos de :guilabel:`Edición de Metadatos`.

source: By changing the :guilabel:`Display Type` of an attribute from this panel as shown in Fig. 4
es: Cambiando el :guilabel:`Tipo de visualización` de un atributo de este panel como se muestra en la Fig. 4

source: *Fig. 4*
es: *Figura 4*

source: GeoNode will create automatically the HTML media type when rendering by using the **value** of the selected property.
es: GeoNode creará automáticamente el tipo de medio HTML al renderizar utilizando el **valor** de la propiedad seleccionada.

source: So, as an example, if, in the figure above, the attribute ``NAME`` contains values representing some ``links`` to other resources, GeoNode will create those links automatically for you when clicking over a geometry.
es: Entonces, por ejemplo, si, en la figura anterior, el atributo ``NOMBRE`` contiene valores que representan algunos ``enlaces`` a otros recursos, GeoNode creará esos enlaces automáticamente cuando haga clic sobre una geometría.

source: *Fig. 5*
es: *Figura 5*

source: Selecting :guilabel:`image` as media-type (Fig. 6)
es: Seleccionando :guilabel:`image` como tipo de medio (Fig. 6)

source: *Fig. 6*
es: *Figura 6*

source: and editing the contents accordingly (Fig. 7)
es: y editar el contenido en consecuencia (Fig. 7)

source: *Fig. 7*
es: *Figura 7*

source: you will get a nice effect as shown in Fig. 8
es: Obtendrá un bonito efecto como se muestra en la Fig. 8.

source: *Fig. 8*
es: *Figura 8*

source: Advanced Template: Use A Custom HTML Template
es: Plantilla avanzada: utilice una plantilla HTML personalizada

source: By selecting the option :guilabel:`Use a custom template?` as shown in Fig. 9
es: Seleccionando la opción :guilabel:`¿Usar una plantilla personalizada?` como se muestra en la Fig. 9

source: *Fig. 9*
es: *Figura 9*

source: You will be able to provide your own custom HTML Template for the Feature Info output. Attributes from the dataset can be represented inside the template using ``${properties.ATTRIBUTE}``, where ``ATTRIBUTE`` is the name of an attribute (field) from your dataset.
es: Podrás proporcionar tu propia plantilla HTML personalizada para la salida de información de la función. Los atributos del conjunto de datos se pueden representar dentro de la plantilla usando ``${properties.ATTRIBUTE}``, donde ``ATTRIBUTE`` es el nombre de un atributo (campo) de su conjunto de datos.

source: The example below uses the ``wikipedia`` and the ``name`` attributes to show the name of the airport as a link to the Wikipedia page:
es: El siguiente ejemplo utiliza los atributos ``wikipedia`` y ``name`` para mostrar el nombre del aeropuerto como un enlace a la página de Wikipedia:

source: *Fig. 10*
es: *Figura 10*

source: *Fig. 11*
es: *Figura 11*

source: This is the result shown when you click on an airport
es: Este es el resultado que se muestra al hacer clic en un aeropuerto

source: *Fig. 12*
es: *Figura 12*

source: Optional: Customizing the HTML WYSIWYG Editor Menu Bar
es: Opcional: Personalización de la barra de menú del editor HTML WYSIWYG

source: The :guilabel:`Menu Bar` and :guilabel:`Tool Bar` of the HTML Editor, can be easily customized by overriding the ``TINYMCE_DEFAULT_CONFIG`` variable on :guilabel:`settings.py` (see :ref:`tinyMCE Default Config Settings`)
es: La :guilabel:`Barra de menú` y :guilabel:`Barra de herramientas` del editor HTML se pueden personalizar fácilmente anulando la variable ``TINYMCE_DEFAULT_CONFIG`` en :guilabel:`settings.py` (ver :ref:`tinyMCE Configuración predeterminada`)

source: There are many plugins and options allowing you to easily customize the editor and also provides some predefined *templates* to speed up the editing.
es: Hay muchos complementos y opciones que le permiten personalizar fácilmente el editor y también proporciona algunas *plantillas* predefinidas para acelerar la edición.

source: For more information about the Javascript tool, please refer to https://www.tiny.cloud/
es: Para obtener más información sobre la herramienta Javascript, consulte https://www.tiny.cloud/
