Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/maps_configuration/index.po
Languages: es

source: Map tools and configuration
es: Herramientas de mapas y configuración.

source: In this section, we are going to explore all tools provided on the Map View page. From the list of available maps, you can select the map you are interested in and click *View map*, the map will look like this.
es: En esta sección, exploraremos todas las herramientas proporcionadas en la página Vista del mapa. De la lista de mapas disponibles, puede seleccionar el mapa que le interesa y hacer clic en *Ver mapa*, el mapa se verá así.

source: *The Map View*
es: *La vista del mapa*

source: The Map View (based on `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_) provides the following tools:
es: La vista de mapa (basada en `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_) proporciona las siguientes herramientas:

source: the :ref:`toc` to manage the map contents;
es: la :ref:`toc` para gestionar el contenido del mapa;

source: the *Basemap Switcher* to change the basemap (see the next paragraphs);
es: el *Cambiador de Mapas Base* para cambiar el mapa base (ver los párrafos siguientes);

source: the *Search Bar* to search by location, name and coordinates (see the paragraph below);
es: la *Barra de búsqueda* para buscar por ubicación, nombre y coordenadas (ver el párrafo siguiente);

source: the :ref:`options-menu-tools` which contains the link to the datasets *Catalog*;
es: las :ref:`opciones-menú-herramientas` que contiene el enlace a los conjuntos de datos *Catálogo*;

source: the *Sidebar* which contains, by default, the link to the *Print* tool and to the *Measure* tool;
es: la *Barra lateral* que contiene, de forma predeterminada, el enlace a la herramienta *Imprimir* y a la herramienta *Medir*;

source: the *Navigation Bar* and its tools such as the *Zoom* tools, the *3D Navigation* tool and the *Get Features Info* tool;
es: la *Barra de navegación* y sus herramientas, como las herramientas *Zoom*, la herramienta *Navegación 3D* y la herramienta *Obtener información de funciones*;

source: the *Footer Tools* to manage the scale of the map, to track the mouse coordinates and change the CRS (Coordinates Reference System).
es: las *Herramientas de pie de página* para administrar la escala del mapa, rastrear las coordenadas del mouse y cambiar el CRS (Sistema de referencia de coordenadas).

source: A map can be configured to use a custom :ref:`map-viewers`, with which the lsit of tools available in the map can be customized.
es: Se puede configurar un mapa para utilizar :ref:`map-viewers` personalizado, con el que se puede personalizar la lista de herramientas disponibles en el mapa.

source: Search Bar
es: Barra de búsqueda

source: The *Search Bar* of the map viewer allows you to find point of interests (POIs), streets or locations by name.
es: La *Barra de búsqueda* del visor de mapas le permite buscar puntos de interés (POI), calles o ubicaciones por nombre.

source: Lets type the name of some place then select the first record.
es: Escribamos el nombre de algún lugar y luego seleccionemos el primer registro.

source: *The Search Bar*
es: *La barra de búsqueda*

source: The map will automatically re-center on that area delimiting it by a polygon in the case of an area, by a line in the case of a linear shape (e.g. streets, streams) and by a marker in the case of a point.
es: El mapa se volverá a centrar automáticamente en esa zona delimitándola por un polígono en el caso de un área, por una línea en el caso de una forma lineal (por ejemplo, calles, arroyos) y por un marcador en el caso de un punto.

source: *Result of a Search*
es: *Resultado de una Búsqueda*

source: Navigation bar
es: Barra de navegación

source: The *Map Viewer* makes also available the *Navigation bar*. It is a navigation panel containing various tools that help you to explore the map such as tools for zooming, changing the extent and querying objects on the map.
es: El *Visor de mapas* también pone a disposición la *Barra de navegación*. Es un panel de navegación que contiene varias herramientas que le ayudan a explorar el mapa, como herramientas para hacer zoom, cambiar la extensión y consultar objetos en el mapa.

source: By default the *Navigation bar* shows you the zooming buttons |zoom_in_button|, |zoom_out_button| and |3d_button|, other options can be explored by clicking on |sidebar_expand_button| which expands/collapses the toolbar.|
es: De forma predeterminada, la *barra de navegación* muestra los botones de zoom |zoom_in_button|, |zoom_out_button| y |3d_button|, se pueden explorar otras opciones haciendo clic en |sidebar_expand_button| que expande/contrae la barra de herramientas.|

source: *The Default Navigation bar*
es: *La barra de navegación predeterminada*

source: *The Expanded Navigation bar*
es: *La barra de navegación ampliada*

source: The *Navigation bar* contains the following tools:
es: La *barra de navegación* contiene las siguientes herramientas:

source: The *Query Objects on map* allows you to get feature information through the |query_objects_on_map_button| button. It allows you to retrieve information about the features of some datasets by clicking them directly on the map.
es: *Consultar objetos en el mapa* te permite obtener información sobre entidades a través del |query_objects_on_map_button| botón. Te permite recuperar información sobre las características de algunos conjuntos de datos haciendo clic en ellos directamente en el mapa.

source: *Querying Objects on map*
es: *Consulta de objetos en el mapa*

source: When clicking on map a new panel opens. That panel will show you all the information about the clicked features for each active loaded dataset.
es: Al hacer clic en el mapa se abre un nuevo panel. Ese panel te mostrará toda la información sobre las funciones en las que se hizo clic para cada conjunto de datos cargado activo.

source: You can *Zoom To Max Extent* by clicking |zoom_to_max_extent_button|.
es: Puedes *Acercar al máximo alcance* haciendo clic en |zoom_to_max_extent_button|.

source: Basemap Switcher
es: Conmutador de mapas base

source: By default, GeoNode allows to enrich maps with many world backgrounds. You can open available backgrounds by clicking on the map tile below:
es: De forma predeterminada, GeoNode permite enriquecer mapas con muchos fondos mundiales. Puede abrir fondos disponibles haciendo clic en el mosaico del mapa a continuación:

source: *The Basemap Switcher Tool*
es: *La herramienta de cambio de mapa base*

source: You can also decide to have an *Empty Background*.
es: También puedes decidir tener un *Fondo vacío*.

source: *Switching the Basemap*
es: *Cambiando el mapa base*

source: Footer Tools
es: Herramientas de pie de página

source: At the bottom of the map, the *Footer* shows you the *Scale* of the map and allows you to change it.
es: En la parte inferior del mapa, el *Pie de página* muestra la *Escala* del mapa y te permite cambiarla.

source: *The Map Scale*
es: *La escala del mapa*

source: The |show_hide_coordinates_button| button allows you to see the pointer *Coordinates* and to change the Coordinates Reference System (CRS), WGS 84 by default.
es: El |show_hide_coordinates_button| El botón te permite ver el puntero *Coordenadas* y cambiar el Sistema de referencia de coordenadas (CRS), WGS 84 de forma predeterminada.

source: *The Pointer Coordinates and the CRS*
es: *Las coordenadas del puntero y el CRS*
