Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/maps_configuration/map_viewers.po
Languages: es

source: Map Viewer
es: Visor de mapas

source: GeoNode allows for the administrator of the map to configure a custom viewer by choosing the set of plugins available for the viewer
es: GeoNode permite al administrador del mapa configurar un visor personalizado eligiendo el conjunto de complementos disponibles para el visor

source: From the :guilabel:`Add viewer` option under the :guilabel:`Edit` options of the *Menu* a page opens and the user can:
es: Desde la opción :guilabel:`Agregar visor` bajo las opciones :guilabel:`Editar` del *Menú* se abre una página y el usuario puede:

source: Select an existing viewer from the list of viewers by clicking on the :guilabel:`Link to viewer`
es: Seleccionar un visor existente de la lista de visores haciendo clic en :guilabel:`Enlace al visor`

source: Create a new viewer by clicking on the :guilabel:`Create new viewer`
es: Crear un nuevo visor haciendo clic en :guilabel:`Crear nuevo visor`

source: *Add viewer option*
es: *Agregar opción de visor*

source: Once the :guilabel:`Create new viewer` is selected an *Edit Plugins* page opens and, through the central vertical bar, the user can select the plugins to include in the context viewer by moving them from the **Available Plugins** list to the **Enabled Plugins** list.
es: Una vez seleccionado :guilabel:`Crear nuevo visor` se abre una página *Editar Complementos* y, a través de la barra vertical central, puedes seleccionar los complementos a incluir en el visor de contexto moviéndolos de la lista **Complementos Disponibles** a la lista **Complementos habilitados**.

source: *Enable plugins fro the viewer*
es: *Habilitar complementos para el visor*

source: To save and enable the map viewer, the user can click :guilabel:`Save as` option under the :guilabel:`Resource` options of the *Menu*.
es: Para guardar y habilitar el visor de mapas, puedes hacer clic en la opción :guilabel:`Guardar como` bajo las opciones :guilabel:`Recursos` del *Menú*.

source: The *Map Viewer* will be visible to all users who have permission to view the map and can be reused or modified by the user who has edit permissions on it. It will be available on the list of the resources on *Home Page*
es: El *Visor de mapas* será visible para todos los usuarios que tengan permiso para ver el mapa y podrá ser reutilizado o modificado por el usuario que tenga permisos de edición. Estará disponible en la lista de recursos en la *Página de inicio*

source: See the `MapStore Documentation <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/application-context/#configure-plugins>`_ for more information.
es: Consulta la `Documentación de MapStore <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/application-context/#configure-plugins>`_ para obtener más información.
