Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/maps_configuration/options_menu.po
Languages: es

source: Other Menu Tools
es: Otras herramientas de menú

source: At the top of the *Map* and on the *SideBar* of the map there are more menu items which we are are going to explain in this section.
es: En la parte superior del *Mapa* y en la *Barra lateral* del mapa hay más elementos de menú que vamos a explicar en esta sección.

source: Add dataset
es: Agregar conjunto de datos

source: All the datasets available in GeoNode, both uploaded and remote, can be loaded on the map through the *Catalog*. Click on the :guilabel:`Add dataset` option of the *Menu* to take a look at the catalog panel.
es: Todos los conjuntos de datos disponibles en GeoNode, tanto cargados como remotos, se pueden cargar en el mapa a través del *Catálogo*. Haz clic en la opción :guilabel:`Añadir conjunto de datos` del *Menú* para echar un vistazo al panel del catálogo.

source: *The Datasets Catalog*
es: *El catálogo de conjuntos de datos*

source: You can navigate through datasets and look at their *Thumbnail* images, *Title*, *Description* and *Abstract*. Click on a dataset to load it into the map, it will be also visible in the :ref:`toc`.
es: Puedes navegar a través de conjuntos de datos y ver sus imágenes *Miniatura*, *Título*, *Descripción* y *Resumen*. Haz clic en un conjunto de datos para cargarlo en el mapa; también será visible en :ref:`toc`.

source: Saving a map
es: Guardar un mapa

source: Once all the customizations have been carried out, you can *Save* your map by clicking on the :guilabel:`Save` option under the :guilabel:`Resources` options of the *Menu*.
es: Una vez realizadas todas las personalizaciones, podrás *Guardar* tu mapa haciendo clic en la opción :guilabel:`Guardar` bajo las opciones :guilabel:`Recursos` del *Menú*.

source: You could create a new map from the existing view by clicking :guilabel:`Save As..`.
es: Puedes crear un nuevo mapa a partir de la vista existente haciendo clic en :guilabel:`Guardar como...`.

source: A new popup window will open.
es: Se abrirá una nueva ventana emergente.

source: *Saving as Map option*
es: *Guardar como opción de mapa*

source: The current map title is filled by default, You can change it to the prefered naming then click on :guilabel:`Save`. The page will reload and your map should be visible in the :ref:`finding-data` list.
es: El título del mapa actual se completa de forma predeterminada. Puede cambiarlo al nombre que prefiera y luego hacer clic en :guilabel:`Guardar`. La página se recargará y su mapa debería estar visible en la lista :ref:`finding-data`.

source: Printing a map
es: Imprimir un mapa

source: The `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ based map viewer of GeoNode allows you to print the current view with a customizable layout.
es: El visor de mapas basado en `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ de GeoNode te permite imprimir la vista actual con un diseño personalizable.

source: Click the |print_button| button from the *SideBar*, the **Printing Window** will open.
es: Al hacer clic en el botón |print_button| de la *barra lateral*, se abrirá la **ventana de impresión**.

source: *The Printing Window*
es: *La ventana de impresión*

source: From this window you can:
es: Desde esta ventana podrás:

source: enter *Title* and *Description*;
es: ingresar *Título* y *Descripción*;

source: choose the *Resolution* in dpi;
es: elegir la *Resolución* en ppp;

source: select the format
es: seleccionar el formato

source: select the coordinate
es: seleccionar la coordenada

source: add the scale
es: agregar la escala

source: add grid with label
es: agregar cuadrícula con etiqueta

source: customize the *Layout*
es: personalizar el *Diseño*

source: the *Sheet size* (A3, A4);
es: el *Tamaño de hoja* (A3, A4);

source: if include the legend or not;
es: si incluye la leyenda o no;

source: if to put the legend in a separate page;
es: si poner la leyenda en página aparte;

source: the page *Orientation* (Landscape or Portrait);
es: la *Orientación* de la página (Paisaje o Retrato);

source: customize the *Legend*
es: personalizar la *Leyenda*

source: the *Label Font*;
es: la *Fuente de etiqueta*;

source: the *Font Size*;
es: el *Tamaño de fuente*;

source: the *Font Emphasis* (bold, italic);
es: el *énfasis de fuente* (negrita, cursiva);

source: if *Force Labels*;
es: si *Forzar Etiquetas*;

source: if use *Anti Aliasing Font*;
es: si utilizar *Fuente antialiasing*;

source: the *Icon Size*;
es: el *Tamaño del icono*;

source: the *Legend Resolution* in dpi.
es: la *Resolución de la leyenda* en ppp.

source: To print the view click on :guilabel:`Print`.
es: Para imprimir la vista haga clic en :guilabel:`Imprimir`.

source: Performing Measurements
es: Realizar mediciones

source: Click on the |measure_button| button from the *SideBar* to perform a measurement. As you can see in the picture below, this tool allows you to measure *Distances*, *Areas* and the *Bearing* of lines.
es: Haz clic en el botón |measure_button| de la *barra lateral* para realizar una medición. Como puedes ver en la imagen a continuación, esta herramienta le permite medir *Distancias*, *Áreas* y el *Rumbo* de líneas.

source: *The Measure Tool*
es: *La herramienta de medición*

source: To perform a measure draw on the map the geometry you are interested in, the result will be displayed on the left of the unit of measure select menu (this tool allows you to change the unit of measure also).
es: Para realizar una medida, dibuja en el mapa la geometría que le interesa, el resultado se mostrará a la izquierda del menú de selección de unidad de medida (esta herramienta también te permite cambiar la unidad de medida).

source: *Measuring Areas*
es: *Áreas de medición*
