Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/maps_configuration/timeline.po
Languages: es

source: Timeline
es: Línea de tiempo

source: GeoNode can manage datasets with a *time dimension*. Those vector datasets may vary their data through time so it is useful to represent that variation on the map.
es: GeoNode puede gestionar conjuntos de datos con una *dimensión de tiempo*. Esos conjuntos de datos vectoriales pueden variar sus datos a lo largo del tiempo, por lo que es útil representar esa variación en el mapa.

source: The `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ based map viewer used in Geonode makes available the **Timeline** tool which allows you to observe the datasets' evolution over time, to inspect the dataset configuration at a specific time instant and to view different dataset configurations time by time dynamically through animations (see the `MapStore Documentation <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/timeline/#animations>`_ for further details).
es: El visor de mapas basado en `MapStore <https://mapstore2.geo-solutions.it/mapstore/#/>`_ utilizado en Geonode pone a disposición la herramienta **Línea de tiempo** que le permite observar la evolución de los conjuntos de datos a lo largo del tiempo, para inspeccionar la configuración del conjunto de datos. en un instante específico y para ver diferentes configuraciones de conjuntos de datos de vez en cuando dinámicamente a través de animaciones (consulta la `Documentación de MapStore <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/timeline/#animations>`_ para obtener más detalles).

source: Timeline actually works only with WMTS-Multidim extension (WMS time in capabilities is not fully supported).
es: En realidad, la línea de tiempo solo funciona con la extensión WMTS-Multidim (las capacidades de tiempo WMS no son totalmente compatibles).

source: When loading a temporal dataset into the map, the *Timeline* opens automatically.
es: Al cargar un conjunto de datos temporales en el mapa, la *Línea de tiempo* se abre automáticamente.

source: *The Timeline*
es: *La línea de tiempo*

source: On the left side of the *Timeline* panel you can set the time value in which you want to observe the data. You can type it directly filling out the corresponding input fields or by using the up/down arrows.
es: En el lado izquierdo del panel *Línea de tiempo* puedes ajustar el valor de tiempo en el que deseas observar los datos. Puedes escribirlo directamente completando los campos de entrada correspondientes o usando las flechas arriba/abajo.

source: *The Time Control Buttons*
es: *Los botones de control de tiempo*

source: On the other side there are the buttons responsible for managing the animations.
es: En el otro lado se encuentran los botones encargados de gestionar las animaciones.

source: In particular you can *Play* the animation by clicking |play_button|, go back to the previous time instant through |time_go_backward_button|, go forward to next time step using |time_go_forward_button| and stop the animation by clicking |stop_button|.
es: En particular, puedes *Reproducir* la animación haciendo clic en |play_button|, volver al instante de tiempo anterior mediante |time_go_backward_button|, avanzar al siguiente paso de tiempo usando |time_go_forward_button| y detener la animación haciendo clic en |stop_button|.

source: *The Animation Control Buttons*
es: *Los botones de control de animación*

source: The *Timeline* panel can be expanded through the |expand_timeline_button| button.
es: El panel *Línea de tiempo* se puede expandir mediante el |expand_timeline_button| botón.

source: *The Expanded Timeline*
es: *La línea de tiempo ampliada*

source: The expanded section of the *Timeline* panel contains the *Time Datasets List* and an *Histogram* which shows you:
es: La sección ampliada del panel *Línea de tiempo* contiene la *Lista de conjuntos de datos de tiempo* y un *Histograma* que muestra:

source: the distribution of the data over time
es: la distribución de los datos a lo largo del tiempo

source: *The Timeline Histogram*
es: *El histograma de la línea de tiempo*

source: the *Time Cursor*
es: el *cursor de tiempo*

source: *The Time Cursor*
es: *El cursor del tiempo*

source: You can show/hide the datasets list by clicking |show_hide_datasets_list_button| (it is active by default).
es: Puedes mostrar/ocultar la lista de conjuntos de datos haciendo clic en |show_hide_datasets_list_button| (está activo por defecto).

source: Through the *Time Range* function you can observe the data in a finite temporal interval. Click on |time_range_button| and set the initial and the final times to use it.
es: A través de la función *Rango de Tiempo* puedes observar los datos en un intervalo temporal finito. Haz clic en |time_range_button| y establece los tiempos inicial y final para usarlo.

source: *The Time Range Settings*
es: *La configuración del rango de tiempo*

source: Animations
es: Animaciones

source: The *Timeline* allows you to see the data configurations (one for each time in which the data are defined) through ordered sequences of steps.
es: La *Línea de tiempo* permite ver las configuraciones de datos (una por cada momento en el que se definen los datos) a través de secuencias ordenadas de pasos.

source: As said before, you can play the resulting *Animation* by clicking the play button |play_button|. The dataset data displayed on map will change accordingly to the time reach by the cursor on the *Histogram*.
es: Como se dijo antes, puedes reproducir la *Animación* resultante haciendo clic en el botón de reproducción |play_button|. Los datos del conjunto de datos mostrados en el mapa cambiarán de acuerdo con el tiempo alcanzado por el cursor en el *Histograma*.

source: By clicking on |animation_settings_button| you can manage some *Animation Settings*.
es: Al hacer clic en |animation_settings_button| puedes administrar algunas *Configuraciones de animación*.

source: *The Timeline Settings*
es: *La configuración de la línea de tiempo*

source: You can activate the *Snap to guide dataset* so that the time cursor will snap to the selected dataset's data. You can also set up the *Frame Duration* (by default 5 seconds).
es: Puedes activar *Ajustar al conjunto de datos guía* para que el cursor de tiempo se ajuste a los datos del conjunto de datos seleccionado. También puedes configurar la *Duración del fotograma* (por defecto, 5 segundos).

source: If the *Snap to guide dataset* option is disabled, you can force the animation step to be a fixed value.
es: Si la opción *Ajustar al conjunto de datos de guía* está deshabilitada, puedes forzar que el paso de la animación tenga un valor fijo.

source: The *Animation Range* option lets you to define a temporal range within which the time cursor can move.
es: La opción *Rango de animación* te permite definir un rango temporal dentro del cual se puede mover el cursor de tiempo.

source: *The Timeline Animation Range*
es: *El rango de animación de la línea de tiempo*

source: See the `MapStore Documentation <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/timeline/>`__ for more information.
es: Consulta la `Documentación de MapStore <https://docs.mapstore.geosolutionsgroup.com/en/latest/user-guide/timeline/>`__ para obtener más información.
