Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/intermediate/backup/index.po
Languages: es

source: Full GeoNode Backup & Restore
es: Copia de seguridad y restauración completa de GeoNode

source: The admin command to backup and restore GeoNode, allows to extract consistently the GeoNode and GeoServer data models in a serializable meta-format which is being interpreted later by the restore procedure in order to exactly rebuild the whole structure.
es: El comando de administración para realizar copias de seguridad y restaurar GeoNode, permite extraer consistentemente los modelos de datos de GeoNode y GeoServer en un metaformato serializable que luego es interpretado por el procedimiento de restauración para reconstruir exactamente toda la estructura.

source: In particular the tool helps developers and administrators to correctly extract and serialize the following resources:
es: En particular, la herramienta ayuda a los desarrolladores y administradores a extraer y serializar correctamente los siguientes recursos:

source: **GeoNode** (Resource Base Model):
es: **GeoNode** (Modelo base de recursos):

source: Layers (both raster and vectors)
es: Capas (tanto raster como vectoriales)

source: Maps
es: Mapas

source: Documents
es: Documentos

source: People with Credentials
es: Personas con Credenciales

source: Permissions
es: Permisos

source: Associated Styles
es: Estilos asociados

source: Static data and templates
es: Datos estáticos y plantillas

source: **GeoServer** (Catalog):
es: **GeoServer** (Catálogo):

source: OWS Services configuration and limits
es: Configuración y límites de los servicios OWS

source: Security model along with auth filters configuration, users and credentials
es: Modelo de seguridad junto con la configuración de filtros de autenticación, usuarios y credenciales

source: Workspaces
es: Espacios de trabajo

source: Stores (both DataStores and CoverageStores)
es: Almacenes (tanto DataStores como CoverageStores)

source: Layers
es: Capas

source: Styles
es: Estilos

source: The tool exposes two GeoNode Management Commands, 'backup' and 'restore'.
es: La herramienta expone dos comandos de administración de GeoNode, 'copia de seguridad' y 'restaurar'.

source: The commands allow to:
es: Los comandos permiten:

source: Fully backup GeoNode data and fixtures on a zip archive
es: Realizar una copia de seguridad completa de los datos y dispositivos de GeoNode en un archivo zip

source: Fully backup GeoServer configuration (physical datasets - tables, shapefiles, geotiffs)
es: Realizar una copia de seguridad completa de la configuración de GeoServer (conjuntos de datos físicos: tablas, shapefiles, geotiffs)

source: Fully restore GeoNode and GeoServer fixtures and catalog from the zip archive
es: Restaurar completamente los accesorios y el catálogo de GeoNode y GeoServer desde el archivo zip

source: The usage of those commands is quite easy and straightforward.
es: El uso de estos comandos es bastante fácil y directo.

source: The first step is to ensure that everything is correctly configured and the requisites respected in order to successfully perform a backup and restore of GeoNode.
es: El primer paso es asegurarse de que todo esté configurado correctamente y se respeten los requisitos para poder realizar con éxito una copia de seguridad y restauración de GeoNode.

source: It is worth to notice that this functionality requires the latest `GeoServer Extension <https://build.geo-solutions.it/geonode/geoserver/latest/>`_ (2.9.x or greater) for GeoNode in order to correctly work.
es: Vale la pena señalar que esta funcionalidad requiere la última versión de `GeoServer Extension <https://build.geo-solutions.it/geonode/geoserver/latest/>`_ (2.9.x o superior) para GeoNode para funcionar correctamente.

source: GeoServer full documentation is also available here `GeoServer Docs <https://docs.geoserver.org/stable/en/user/community/backuprestore/index.html>`_
es: La documentación completa de GeoServer también está disponible aquí `GeoServer Docs <https://docs.geoserver.org/stable/en/user/community/backuprestore/index.html>`_

source: Requisites and Setup
es: Requisitos y configuración

source: **Before** running a GeoNode backup / restore, it is necessary to ensure everything is correctly configured and setup.
es: **Antes** de ejecutar una copia de seguridad/restauración de GeoNode, es necesario asegurarse de que todo esté configurado y preparado correctamente.

source: Settings
es: Ajustes

source: Accordingly to the admin needs, the file ``settings.ini`` must be ceated before running a backup or restore.
es: Según las necesidades del administrador, se debe crear el archivo ``settings.ini`` antes de ejecutar una copia de seguridad o restauración.

source: The default files can be found at ``geonode/br/management/commands/settings_sample.ini`` and ``geonode/br/management/commands/settings_docker_sample.ini`` for the classic and Docker environments accordingly. The content is similar in both of them (an example from ``settings_sample.ini``):
es: Los archivos predeterminados se pueden encontrar en ``geonode/br/management/commands/settings_sample.ini`` y ``geonode/br/management/commands/settings_docker_sample.ini`` para los entornos clásico y Docker, respectivamente. El contenido es similar en ambos (un ejemplo de ``settings_sample.ini``):

source: The ``settings.ini`` file can be created in any directory accessible by GeoNode, and it's path can be passed to the backup / restore procedures using `-c` (`--config`) argument.
es: El archivo ``settings.ini`` se puede crear en cualquier directorio accesible por GeoNode, y su ruta se puede pasar a los procedimientos de respaldo/restauración usando el argumento `-c` (`--config`).

source: There are few different sections of the configuration file, that must be carefully checked before running a backup / restore command.
es: Hay algunas secciones diferentes del archivo de configuración que deben revisarse cuidadosamente antes de ejecutar un comando de copia de seguridad/restauración.

source: Settings: [database] Section
es: Configuración: Sección [base de datos]

source: This section is quite simple. It contains only two properties:
es: Esta sección es bastante sencilla. Contiene sólo dos propiedades:

source: *pgdump*; the path of the ``pg_dump`` local command.
es: *pgdump*; la ruta del comando local ``pg_dump``.

source: *pgrestore*; the path of the ``pg_restore`` local command.
es: *pgrestore*; la ruta del comando local ``pg_restore``.

source: Those properties are ignored in case GeoNode is not configured to use a DataBase as backend (see ``settings.py`` and ``local_settings.py`` sections)
es: Esas propiedades se ignoran en caso de que GeoNode no esté configurado para usar una base de datos como backend (consulte las secciones ``settings.py`` y ``local_settings.py``)

source: Database connection settings (both for GeoNode and GeoServer) will be taken from ``settings.py`` and ``local_settings.py`` configuration files. Make sure they are correctly configured (on the target GeoNode instance, too) and the DataBase server is accessible while executing a backup / restore command.
es: Las configuraciones de conexión de la base de datos (tanto para GeoNode como para GeoServer) se tomarán de los archivos de configuración ``settings.py`` y ``local_settings.py``. Asegúrese de que estén correctamente configuradas (también en la instancia de GeoNode de destino) y que el servidor de base de datos sea accesible mientras se ejecuta un comando de copia de seguridad/restauración.

source: Settings: [geoserver] Section
es: Configuración: Sección [geoserver]

source: This section allows to enable / disable a full data backup / restore of GeoServer.
es: Esta sección permite habilitar / deshabilitar una copia de seguridad / restauración completa de datos de GeoServer.

source: *datadir*: the full path of GeoServer Data Dir, by default ``/opt/gs_data_dir``. The path **must** be accessible and **fully writable** by the ``geonode`` and / or ``httpd server`` users when executing a backup / restore command.
es: *datadir*: la ruta completa del directorio de datos de GeoServer, de manera predeterminada ``/opt/gs_data_dir``. La ruta **debe** ser accesible y **completamente escribible** por los usuarios de ``geonode`` y/o ``httpd server`` al ejecutar un comando de copia de seguridad/restauración.

source: *datadir_exclude_file_path*: comma separated list of paths to exclude from ``geoserver_catalog.zip``; This list will be sent and managed directly by the GeoServer Backup REST API.
es: *datadir_exclude_file_path*: lista separada por comas de rutas a excluir de ``geoserver_catalog.zip``; esta lista será enviada y administrada directamente por la API REST de GeoServer Backup.

source: *dumpvectordata*: a boolean flag enabling or disabling creation of a vector data dump from GeoServer (shapefiles or DB tables). If ``false`` (or ``no``) vector data won't be stored / re-stored.
es: *dumpvectordata*: un indicador booleano que habilita o deshabilita la creación de un volcado de datos vectoriales desde GeoServer (shapefiles o tablas de bases de datos). Si es ``false`` (o ``no``) los datos vectoriales no se almacenarán ni se volverán a almacenar.

source: *dumprasterdata*: a boolean flag enabling or disabling creation of a raster data dump from GeoServer (geotiffs). If ``false`` (or ``no``) raster data won't be stored / re-stored.
es: *dumprasterdata*: un indicador booleano que habilita o deshabilita la creación de un volcado de datos raster desde GeoServer (geotiffs). Si es ``false`` (o ``no``) los datos raster no se almacenarán ni se volverán a almacenar.

source: *data_dt_filter*: {cmp_operator} {ISO8601} e.g. > 2019-04-05T24:00 which means "include on backup archive only the files that have been modified later than 2019-04-05T24:00
es: *data_dt_filter*: {cmp_operator} {ISO8601} e.g. > 2019-04-05T24:00 que significa "incluir en el archivo de respaldo solo los archivos que se hayan modificado después de 2019-04-05T24:00

source: *data_layername_filter*: comma separated list of ``layer names``, optionally with glob syntax e.g.: tuscany_*,italy; Only ``RASTER`` original data and ``VECTORIAL`` table dumps matching those filters will be **included** into the backup ZIP archive
es: *data_layername_filter*: lista separada por comas de ``nombres de capas``, opcionalmente con sintaxis global, p. ej.: tuscany_*,italy; Solo los datos originales ``RASTER`` y los volcados de tablas ``VECTORIAL`` que coincidan con esos filtros se **incluirán** en el archivo ZIP de respaldo

source: *data_layername_exclude_filter*: comma separated list of ``layer names``, optionally with glob syntax e.g.: tuscany_*,italy; The ``RASTER`` original data and ``VECTORIAL`` table dumps matching those filters will be **excluded** from the backup ZIP archive
es: *data_layername_exclude_filter*: lista separada por comas de ``nombres de capas``, opcionalmente con sintaxis global, p. ej.: tuscany_*,italy; Los datos originales ``RASTER`` y los volcados de la tabla ``VECTORIAL`` que coincidan con esos filtros se **excluirán** del archivo ZIP de respaldo

source: Enabling these options **requires** the GeoServer Data Dir to be accessible and **fully writable** for the ``geonode`` and / or ``httpd server`` users when executing a backup / restore command.
es: Para habilitar estas opciones **se requiere** que el directorio de datos de GeoServer sea accesible y **totalmente escribible** para los usuarios de ``geonode`` y/o ``servidor httpd`` al ejecutar un comando de respaldo/restauración.

source: Settings: [fixtures] Section
es: Ajustes: Sección [partidos]

source: This section is the most complex one. Usually you don't need to modify it. Only an expert user who knows Python and GeoNode model structure should modify this section.
es: Esta sección es la más compleja. Normalmente no es necesario modificarla. Solo un usuario experto que conozca Python y la estructura del modelo GeoNode debería modificar esta sección.

source: What its properties mean:
es: Qué significan sus propiedades:

source: *apps*; an ordered list of GeoNode Django applications. The backup / restore procedure will dump / restore the fixtures in a portable format.
es: *apps*; una lista ordenada de aplicaciones Django de GeoNode. El procedimiento de copia de seguridad/restauración volcará/restaurará los datos en un formato portátil.

source: *dumps*; this is the list of ``files`` associated to the Django applications. The order **must** be the same as in the *apps* property above. Each name represents the ``file name`` where to dump to / read from the single app's fixtures.
es: *dumps*; esta es la lista de ``archivos`` asociados a las aplicaciones de Django. El orden **debe** ser el mismo que en la propiedad *apps* anterior. Cada nombre representa el ``nombre de archivo`` donde volcar o leer los accesorios de la aplicación individual.

source: Executing from the CLI
es: Ejecutando desde la CLI

source: The following sections shows instructions on how to perform backup / restore from the command line by using the Django Admin Management Commands.
es: Las siguientes secciones muestran instrucciones sobre cómo realizar copias de seguridad/restauraciones desde la línea de comandos utilizando los comandos de administración de Django.

source: In order to obtain a basic user guide for the management command from the command line, just run
es: Para obtener una guía básica de usuario para el comando de administración desde la línea de comandos, simplemente ejecute

source: ``--help`` will provide the list of available command line options with a brief description.
es: ``--help`` proporcionará la lista de opciones de línea de comando disponibles con una breve descripción.

source: By default both procedures activate `Read Only` mode, disabling any content modifying requests, which is reverted to the previous state (from before the execution) after finish, regardless of the command's result (success or failure). To disable activation of this mode, ``--skip-read-only`` argument can be passed to the command.
es: Por defecto, ambos procedimientos activan el modo `Read Only`, deshabilitando cualquier petición de modificación de contenido, que vuelve al estado anterior (antes de la ejecución) al finalizar, independientemente del resultado del comando (éxito o fracaso). Para deshabilitar la activación de este modo, se puede pasar al comando el argumento ``--skip-read-only``.

source: It is worth notice that both commands allows the following option
es: Vale la pena notar que ambos comandos permiten la siguiente opción

source: Which enables a non-interactive mode, meaning the user will not be asked for an explicit confirmation.
es: Esto habilita un modo no interactivo, lo que significa que no se le pedirá al usuario una confirmación explícita.

source: Backup
es: Respaldo

source: In order to perform a backup just run the command:
es: Para realizar una copia de seguridad simplemente ejecute el comando:

source: The management command will automatically generate a ``.zip`` archive file on the target folder in case of success. In the target directory ``.md5`` file with the same name as backup will be created. It contains the MD5 hash of the backup file, which can be used to check archive's integrity before restoration.
es: En caso de éxito, el comando de administración generará automáticamente un archivo comprimido ``.zip`` en la carpeta de destino. En el directorio de destino se creará un archivo ``.md5`` con el mismo nombre que la copia de seguridad. Contiene el hash MD5 del archivo de copia de seguridad, que se puede utilizar para comprobar la integridad del archivo comprimido antes de la restauración.

source: It is worth to mention that ``br`` (Backup & Restore GeoNode application) will not be dumped, even if specified in the ``settings.ini`` as its content is strictly related to the certain GeoNode instance.
es: Vale la pena mencionar que ``br`` (aplicación Backup & Restore GeoNode) no se volcará, incluso si se especifica en ``settings.ini``, ya que su contenido está estrictamente relacionado con la instancia específica de GeoNode.

source: Currently, GeoNode does not support any automatic extraction of the backup file. It should be manually transferred, if needed to the target instance environment.
es: Actualmente, GeoNode no admite la extracción automática del archivo de copia de seguridad. Si es necesario, se debe transferir manualmente al entorno de la instancia de destino.

source: Restore
es: Restaurar

source: The ``restore`` command has a number of arguments, modifying its execution:
es: El comando ``restore`` tiene una serie de argumentos que modifican su ejecución:

source: # ``-c`` / ``--config``: path to the ``settings.ini`` configuration file. If the Backup archive is provided with his settings, the latter will be used by the restore command and this option won't be mandatory anymore
es: # ``-c`` / ``--config``: ruta al archivo de configuración ``settings.ini``. Si se proporciona el archivo de copia de seguridad con sus configuraciones, el comando de restauración utilizará estas últimas y esta opción ya no será obligatoria

source: ``--skip-geoserver``: the GeoServer backup restoration won't be performed
es: ``--skip-geoserver``: no se realizará la restauración de la copia de seguridad de GeoServer

source: ``--skip-geoserver-info``: {Default: True} Skips GeoServer Global Infos, like the proxy base url and other global GeoServer metadata info
es: ``--skip-geoserver-info``: {Predeterminado: True} Omite la información global de GeoServer, como la URL base del proxy y otra información de metadatos globales de GeoServer

source: ``--skip-geoserver-security``: {Default: True} Skips GeoServer all the Security Settings
es: ``--skip-geoserver-security``: {Predeterminado: True} Omite todas las configuraciones de seguridad de GeoServer

source: ``--backup-file``: (exclusive together with ``--backup-files-dir``) path to the backup ``.zip`` archive
es: ``--backup-file``: (exclusivo junto con ``--backup-files-dir``) ruta al archivo de respaldo ``.zip``

source: ``--backup-files-dir``: (exclusive together with ``--backup-file``) directory containing backup archives. The directory may contain a number of files, but **only** backup archives are allowed with a ``.zip`` extension. In case multiple archives are present in the directory, the newest one, created after the last already restored backup creation time, will be restored. This option was implemented with a thought of automated restores.
es: ``--backup-files-dir``: (exclusivo junto con ``--backup-file``) directorio que contiene archivos de copia de seguridad. El directorio puede contener varios archivos, pero **solo** se permiten archivos de copia de seguridad con una extensión ``.zip``. En caso de que haya varios archivos en el directorio, se restaurará el más nuevo, creado después de la hora de creación de la última copia de seguridad ya restaurada. Esta opción se implementó pensando en las restauraciones automáticas.

source: ``--recovery-file``: Backup archive containing GeoNode data to restore in case of failure.
es: ``--recovery-file``: Archivo de respaldo que contiene datos de GeoNode para restaurar en caso de falla.

source: ``-l`` / ``--with-logs``: the backup file will be checked against the restoration logs (history). In case this backup has already been restored (MD5 based comparision), RuntimeError is raised, preventing restore execution.
es: ``-l`` / ``--with-logs``: el archivo de copia de seguridad se comparará con los registros de restauración (historial). En caso de que esta copia de seguridad ya se haya restaurado (comparación basada en MD5), se genera un error RuntimeError que impide la ejecución de la restauración.

source: ``-n`` / ``--notify``: the restore procedure outcome will be send by an e-mail notification to the superusers of the instance (note: notification will be sent to the superusers of the instance before restoration).
es: ``-n`` / ``--notify``: el resultado del procedimiento de restauración se enviará mediante una notificación por correo electrónico a los superusuarios de la instancia (nota: la notificación se enviará a los superusuarios de la instancia antes de la restauración).

source: ``--skip-read-only``: the restore procedure will be conducted without setting `Read Only` mode during execution.
es: ``--skip-read-only``: el procedimiento de restauración se llevará a cabo sin configurar el modo `Solo lectura` durante la ejecución.

source: ``--soft-reset``: the restore procedure will preserve geoserver table / resources during the restore. By default the procedure will drop tables and resources
es: ``--soft-reset``: el procedimiento de restauración conservará la tabla y los recursos de geoserver durante la restauración. De manera predeterminada, el procedimiento eliminará las tablas y los recursos.

source: In order to perform a default backup restoration just run the command:
es: Para realizar una restauración de copia de seguridad predeterminada, simplemente ejecuta el comando:

source: For restore to run it requires either ``--backup-file`` or ``--backup-files-dir`` argument defined.
es: Para que se ejecute la restauración, se requiere el argumento ``--backup-file`` o ``--backup-files-dir`` definido.

source: The Restore will **overwrite** the whole target instances of GeoNode (and by default GeoServer) including users, catalog and database, so be very careful.
es: La restauración **sobrescribirá** todas las instancias de destino de GeoNode (y por defecto GeoServer), incluidos los usuarios, el catálogo y la base de datos, así que tenga mucho cuidado.

source: GeoNode Admin GUI Inspection
es: Inspección de la interfaz gráfica de usuario de administración de GeoNode

source: The history of restored backups can be verified in the admin panel.
es: El historial de copias de seguridad restauradas se puede verificar en el panel de administración.

source: Login to the admin panel and select ``Restored backups`` table from ``BACKUP/RESTORE`` application.
es: Inicia sesión en el panel de administración y selecciona la tabla «Copias de seguridad restauradas» de la aplicación «COPIA DE SEGURIDAD/RESTAURACIÓN».

source: A list will be displayed with a history of all restored backups. You can select a certain backup to view it's data.
es: Se mostrará una lista con el historial de todas las copias de seguridad restauradas. Puedes seleccionar una copia de seguridad determinada para ver sus datos.

source: The detailed view of the restored backup shows backup archive's name, it's MD5 hash, it's creation/modification date (in the target folder), and the date of the restoration. Please note Restored Backup history cannot be modified.
es: La vista detallada de la copia de seguridad restaurada muestra el nombre del archivo de copia de seguridad, su hash MD5, su fecha de creación o modificación (en la carpeta de destino) y la fecha de la restauración. Ten en cuenta que el historial de copias de seguridad restauradas no se puede modificar.

source: B/R in Docker environment
es: B/R en el entorno Docker

source: When executing B/R in the Docker environment, creation backup to / restoration from should be executed in ``/backup_restore`` directory. It is a shared volume between Geoserver and Geonode images, created for this purpose only. Pointing at another location will fail, as one of the images won't have an access to the files.
es: Al ejecutar B/R en el entorno Docker, la creación de la copia de seguridad y la restauración desde la misma se deben realizar en el directorio ``/backup_restore``. Es un volumen compartido entre las imágenes de Geoserver y Geonode, creado solo para este propósito. Si se apunta a otra ubicación, fallará, ya que una de las imágenes no tendrá acceso a los archivos.
