Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/intermediate/backup/index.po
Languages: es

source: When executing B/R in Docker environment **remember** to create ``settings.ini`` file basing on ``settings_docker_sample.ini`` to point at a proper Geoserver data directory! In other case configuration mismatch may cause unexpected errors.
es: Al ejecutar B/R en el entorno Docker, **recuerda** crear el archivo ``settings.ini`` basándose en ``settings_docker_sample.ini`` para apuntar a un directorio de datos de Geoserver adecuado. En otro caso, la falta de coincidencia de configuración puede provocar errores inesperados.

source: The only other volume shared between images is ``/geoserver_data/data``, but backup creation **should not** be performed there, as the recursive Geoserver backups may be created in such case.
es: El único otro volumen compartido entre imágenes es ``/geoserver_data/data``, pero la creación de copias de seguridad **no debería** realizarse allí, ya que en ese caso se pueden crear copias de seguridad recursivas de Geoserver.

source: B/R Jenkins Job in Docker environment
es: Trabajo de B/R Jenkins en el entorno Docker

source: When installing GeoNode through the :guilabel:`geonode-project` Docker (see :ref:`geonode-project-basic`), an instance of `Jenkins CI/CD <https://www.jenkins.io/>`_ is also automatically deployed and available through :guilabel:`http://<geonode_host>/jenkins`.
es: Al instalar GeoNode a través del Docker :guilabel:`geonode-project` (ver :ref:`geonode-project-basic`), también se implementa automáticamente una instancia de `Jenkins CI/CD <https://www.jenkins.io/>`_ y está disponible a través de :guilabel:`http://<geonode_host>/jenkins`.

source: Configure Jenkins at first startup
es: Configurar Jenkins en el primer inicio

source: The very first time you try to access Jenkins, you will need to unlock it and generate a new administrator username and password.
es: La primera vez que intentes acceder a Jenkins, deberás desbloquearlo y generar un nuevo nombre de usuario y contraseña de administrador.

source: In order to do that, you need to print the contents of the auto-generated file ``/var/jenkins_home/secrets/initialAdminPassword``
es: Para hacer esto, debes imprimir el contenido del archivo generado automáticamente ``/var/jenkins_home/secrets/initialAdminPassword``

source: First of all search for the Jenkins container ID, usually :guilabel:`jenkins4{{project_name}}` where ``{{project_name}}`` is the name of your :guilabel:`geonode-project` instance (e.g. ``my_geonode``)
es: En primer lugar, busca el ID del contenedor de Jenkins, generalmente :guilabel:`jenkins4{{project_name}}` donde ``{{project_name}}`` es el nombre de tu instancia :guilabel:`geonode-project` (por ejemplo, ``my_geonode``)

source: Now just ``cat`` the file above inside the Jenkins container
es: Ahora simplemente haz un ``cat`` del archivo anterior dentro del contenedor de Jenkins

source: Copy the hash code you just got form the print above, and copy-and-paste to the browser window
es: Copia el código hash que acabas de obtener de la impresión anterior y cópialo y pégalo en la ventana del navegador.

source: In the next step just install the :guilabel:`Default Plugins`. You can install more of them later on from the management page.
es: En el siguiente paso, simplemente instala los complementos predeterminados. Puedes instalar más complementos más adelante desde la página de administración.

source: Wait until Jenkins has finished configuring the plugins
es: Espera hasta que Jenkins haya terminado de configurar los complementos

source: Provide the administrator credentials as requested
es: Proporciona las credenciales de administrador según lo solicitado

source: Confirm the Jenkins instance URL, this can be changed form the configuration later in case you will need to update the server address
es: Confirma la URL de la instancia de Jenkins, esto se puede cambiar desde la configuración más adelante en caso de que necesites actualizar la dirección del servidor

source: Well done, Jenkins is ready now
es: Bien hecho, Jenkins ya está listo.

source: The next step is to configure a Jenkins Job able to interact with the Django Docker container and run a full backup
es: El siguiente paso es configurar un trabajo de Jenkins capaz de interactuar con el contenedor Docker de Django y ejecutar una copia de seguridad completa.

source: Configure a Jenkins Job to run a full backup on the Django Container
es: Configurar un trabajo de Jenkins para ejecutar una copia de seguridad completa en el contenedor de Django

source: Before creating the new Jenkins job, we need to install and configure a new plugin, `Publish over SSH <https://plugins.jenkins.io/publish-over-ssh>`_
es: Antes de crear el nuevo trabajo de Jenkins, necesitamos instalar y configurar un nuevo complemento, `Publicar sobre SSH <https://plugins.jenkins.io/publish-over-ssh>`_

source: In order to do that, once logged in as ``admin``, go to the Jenkins :guilabel:`Management Page > Manage Plugins` tab
es: Para hacer eso, una vez que hayas iniciado sesión como ``admin``, ve a la página de administración de Jenkins > pestaña Administrar complementos.

source: Click on :guilabel:`Available` tab and search for ``SSH`` available plugins
es: Haz clic en la pestaña :guilabel:`Disponibles` y busca los complementos ``SSH`` disponibles

source: Select and check the ``Publish over SSH`` one
es: Selecciona y marque la opción ``Publicar mediante SSH``

source: Install the plugins and restart Jenkins
es: Instalar los complementos y reiniciar Jenkins

source: The next step is to configure the ``SSH Server Connection`` for the :guilabel:`Publish over SSH` plugin.
es: El siguiente paso es configurar la «Conexión del servidor SSH» para el complemento :guilabel:`Publicar sobre SSH`.

source: Move to :guilabel:`Jenkins Configuration`
es: Mover a :guilabel:`Configuración de Jenkins`

source: Scroll down until you find the :guilabel:`Publish over SSH` plugin section
es: Desplázate hacia abajo hasta encontrar la sección del complemento :guilabel:`Publish over SSH`

source: Depending on how your ``HOST SSH service`` has been configured, you might need several information in order to setup the connection.
es: Dependiendo de cómo se haya configurado su ``servicio HOST SSH``, es posible que necesites diversa información para configurar la conexión.

source: Here below an example using a global host (``master.demo.geonode.org``) accepting ``SSH`` connections via ``RSA keys``
es: A continuación se muestra un ejemplo que utiliza un host global (``master.demo.geonode.org``) que acepta conexiones ``SSH`` a través de ``claves RSA``

source: Before saving the configuration always ensure the connection is ok by using the :guilabel:`Test Configuration` button
es: Antes de guardar la configuración, asegúrate siempre de que la conexión sea correcta utilizando el botón Probar configuración

source: It is possible also to run and configure :guilabel:`Jenkins` to run locally, as an instance on :guilabel:`localhost`. In that case you will need to change few things in order to allow :guilabel:`Jenkins` to access your local network.
es: También es posible ejecutar y configurar :guilabel:`Jenkins` para que se ejecute localmente, como una instancia en :guilabel:`localhost`. En ese caso, deberás cambiar algunas cosas para permitir que :guilabel:`Jenkins` acceda a tu red local.

source: First of all, be sure :guilabel:`OpenSSH Server` is correctly installed and running on your PC. Eventually check any firewall rules.
es: En primer lugar, asegúrate que el servidor OpenSSH esté instalado y funcionando correctamente en su PC. Por último, verifica las reglas del firewall.

source: # Test your connection locally
es: # Prueba tu conexión localmente

source: You will need to do some changed to your ``docker-compose.yml`` file in order to enable the :guilabel:`host network` configuration.
es: Necesitarás realizar algunos cambios en tu archivo ``docker-compose.yml`` para habilitar la configuración de la ``red del host`.

source: Enable ``network_mode: "host"`` on Jenkins container
es: Habilitar ``network_mode: "host"`` en el contenedor Jenkins

source: From now on, your local Jenkins instance will be accessible from :guilabel:`http://localhost:9080/jenkins`
es: A partir de ahora, tu instancia local de Jenkins será accesible desde :guilabel:`http://localhost:9080/jenkins`

source: Add ``localhost`` Server to the :guilabel:`Publish over SSH` plugin configuration
es: Agrega el servidor ``localhost`` a la configuración del complemento ``Publicar sobre SSH``

source: Mode to :guilabel:`http://localhost:9080/jenkins/configure` and fill the required information
es: Modo :guilabel:`http://localhost:9080/jenkins/configure` y completa la información requerida

source: We are now ready to create the Jenkins Job which will run a full backup & restore of our GeoNode dockerized instance.
es: Ahora estamos listos para crear el trabajo de Jenkins que ejecutará una copia de seguridad y restauración completa de nuestra instancia acoplada de GeoNode.

source: Move to the Jenkins Home and click on :guilabel:`Create a Job` button
es: Ve a la página de inicio de Jenkins y haz clic en el botón :guilabel:`Crear un trabajo`

source: Provide a name to the Job and select :guilabel:`Freestyle project`
es: Proporciona un nombre al trabajo y selecciona :guilabel:`Proyecto Freestyle`

source: Enable the :guilabel:`Log rotation` strategy if needed
es: Habilita la estrategia :guilabel:`Rotación de registros` si es necesario

source: Configure the :guilabel:`Job Parameters` which will be used by the script later on.
es: Configura los :guilabel:`Parámetros del trabajo` que utilizará el script más adelante.

source: Add three :guilabel:`String Parameters`
es: Agrega tres :guilabel:`Parámetros de cadena`

source: as shown below
es: como se muestra a continuación

source: Provide the correct URL of your GeoNode instance
es: Proporciona la URL correcta de tu instancia de GeoNode

source: Enable the :guilabel:`Delete workspace before build starts` and :guilabel:`Add timestamps to the Console Output` :guilabel:`Build Environment` options
es: Habilita las opciones :guilabel:`Eliminar espacio de trabajo antes de que comience la compilación` y :guilabel:`Agregar marcas de tiempo a la salida de la consola` :guilabel:`Entorno de compilación`

source: Finally let's create the :guilabel:`SSH Build Step`
es: Finalmente, vamos a crear el paso de compilación :guilabel:`SSH Build Step`

source: Select the correct :guilabel:`SSH Server` and provide the :guilabel:`Exec Command` below
es: Selecciona el :guilabel:`Servidor SSH` correcto y proporcione el :guilabel:`Comando de ejecución` a continuación

source: Replace :guilabel:`{{project_name}}` with your :guilabel:`geonode-project instance name` (e.g. :guilabel:`my_geonode`)
es: Reemplaza :guilabel:`{{project_name}}` con su :guilabel:`nombre de instancia de geonode-project` (por ejemplo, :guilabel:`my_geonode`)

source: Click on :guilabel:`Advanced` and change the parameters as shown below
es: Haz clic en :guilabel:`Avanzado` y cambia los parámetros como se muestra a continuación

source: **Save!** You are ready to run the Job...
es: **¡Guarda!** Estás listo para ejecutar el trabajo...

source: Link the :guilabel:`backup_restore` folder to a local folder on the :guilabel:`HOST`
es: Vincula la carpeta :guilabel:`backup_restore` a una carpeta local en el :guilabel:`HOST`

source: In the case you need to save the backup archives outside the docker container, there's the possibility to directly link the :guilabel:`backup_restore` folder to a local folder on the :guilabel:`HOST`.
es: En caso de que necesites guardar los archivos de respaldo fuera del contenedor Docker, existe la posibilidad de vincular directamente la carpeta :guilabel:`backup_restore` a una carpeta local en el :guilabel:`HOST`.

source: In that case you won't need to :guilabel:`docker cp` the files everytime from the containers, they will be directly available on the host filesystem.
es: En ese caso, no necesitarás copiar y pegar los archivos cada vez desde los contenedores, estarán disponibles directamente en el sistema de archivos del host.

source: Always keep an eye to the disk space. Backups archives may be huge.
es: Deberías estar siempre atento al espacio en disco. Los archivos de respaldo pueden ser enormes.

source: You might want also to consider filtering the files through the backup dt filters on the :guilabel:`settings.ini` in order to reduce the size of the archive files, including only the new ones.
es: También podrías considerar filtrar los archivos a través de los filtros de respaldo en el :guilabel:`settings.ini` para reducir el tamaño de los archivos de respaldo, incluyendo solo los nuevos.

source: Modify the ``docker-compose.override.yml`` as follows in order to link the backup folders outside.
es: Modifica ``docker-compose.override.yml`` de la siguiente manera para vincular las carpetas de respaldo externas.

source: ``/data/backup_restore`` is a folder physically located into the host filesystem.
es: ``/data/backup_restore`` es una carpeta ubicada físicamente en el sistema de archivos del host.
