Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/devel/docker/index.po
Languages: es

source: Start to develop with Docker
es: Empieza a desarrollar con Docker

source: How to run the instance for development
es: Cómo ejecutar la instancia para el desarrollo

source: There are two options to develop using Docker containers:
es: Hay dos opciones para desarrollar utilizando contenedores Docker:

source: **Alternative A**: Running by command line and editing the code using your preferred editor (usually harder).
es: **Alternativa A**: Ejecutar desde la línea de comandos y editar el código usando su editor preferido (generalmente más difícil).

source: **Alternative B**: Using the vscode `remote containers <https://code.visualstudio.com/docs/remote/containers>`_ extension (easier).
es: **Alternativa B**: Usar la extensión vscode `contenedores remotos <https://code.visualstudio.com/docs/remote/containers>`_ (más fácil).

source: Alternative A: Building and running Docker for development
es: Alternativa A: Construir y ejecutar Docker para el desarrollo

source: Build (first time only):
es: Construir (primera vez solamente):

source: Running:
es: Correr:

source: If you are running ``postgresql`` and ``tomcat9`` services, you need to stop them, ``docker-compose`` will take care of running the database and geonode service.
es: Si está ejecutando los servicios ``postgresql`` y ``tomcat9``, debe detenerlos, ``docker-compose`` se encargará de ejecutar la base de datos y el servicio geonode.

source: Otherwise, you will get the following error:
es: De lo contrario, obtendrás el siguiente error:

source: Running the geonode application in debug mode:
es: Ejecutar la aplicación geonode en modo de depuración:

source: When running, you can debug the application using your preferred method. For example, you can edit a file, save it and see your modifications. You can also use `ipdb <https://github.com/gotcha/ipdb>`_ to add breakpoints and inspect your code (Writing ``import ipdb; ipdb.set_trace()`` in the line you want your breakpoint).
es: Al ejecutar la aplicación, puedes depurarla utilizando el método que prefieras. Por ejemplo, puedes editar un archivo, guardarlo y ver las modificaciones. También puedes utilizar `ipdb <https://github.com/gotcha/ipdb>`_ para agregar puntos de interrupción e inspeccionar su código (escribiendo ``import ipdb; ipdb.set_trace()`` en la línea donde desea colocar el punto de interrupción).

source: Another option is to use *debugpy* alongside with *vscode*, for this you have to enable *debugpy* inside your *django4geonode* container:
es: Otra opción es usar *debugpy* junto con *vscode*, para esto debes habilitar *debugpy* dentro de tu contenedor *django4geonode*:

source: Select "**Run and Debug**" in vscode and use the following launch instruction in your ``.vscode/launch.json`` file:
es: Selecciona "**Ejecutar y depurar**" en vscode y usa la siguiente instrucción de inicio en su archivo ``.vscode/launch.json``:

source: Alternative B: Using vscode extension
es: Alternativa B: Usar la extensión vscode

source: Alternatively, you can develop using the vscode `remote containers <https://code.visualstudio.com/docs/remote/containers>`_ extension. In this approach you need to:
es: Como alternativa, puedes desarrollar usando la extensión `remote contenedores <https://code.visualstudio.com/docs/remote/containers>`_ de vscode. En este enfoque, debes:

source: Install the extension in your vscode: `ms-vscode-remote.remote-containers <https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-containers>`_
es: Instala la extensión en tu vscode: `ms-vscode-remote.remote-containers <https://marketplace.visualstudio.com/items?itemName=ms-vscode-remote.remote-containers>`_

source: On your command pallet, select: "**Remote-Containers: Reopen in Container**"
es: En su paleta de comandos, selecciona: "**Contenedores remotos: Reabrir en contenedor**"

source: If it's the first time, vscode will take care of building the images. This might take some time.
es: Si es la primera vez, vscode se encargará de generar las imágenes. Esto puede llevar algún tiempo.

source: Then a new vscode window will open, and it'll be connected to your docker container.
es: Luego se abrirá una nueva ventana de vscode y se conectará a su contenedor Docker.

source: The message "**Dev Container: Debug Docker Compose**" will appear in the bottom-left corner of that window.
es: El mensaje "**Dev Container: Debug Docker Compose**" aparecerá en la esquina inferior izquierda de esa ventana.

source: In the vscode terminal, you're going to see something similar to ``root@77e80acc89b8:/usr/src/geonode#``.
es: En la terminal vscode, verás algo similar a ``root@77e80acc89b8:/usr/src/geonode#``.

source: To run your application, you can use the integrated terminal (``./manage.py runserver 0.0.0.0:8000``) or the vscode "**Run and Debug**" option. For launching with "Run and Debug", use the following instruction file:
es: Para ejecutar tu aplicación, puedes utilizar la terminal integrada (``./manage.py runserver 0.0.0.0:8000``) o la opción "Ejecutar y depurar" de vscode. Para ejecutar con "Ejecutar y depurar", utiliza el siguiente archivo de instrucciones:

source: For more information, take a read at vscode remote containers `help page <https://code.visualstudio.com/docs/remote/containers>`_.
es: Para obtener más información, lee la página de ayuda de contenedores remotos de vscode `<https://code.visualstudio.com/docs/remote/containers>`_.
