Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/upgrade/3.2-to-3.3/index.po
Languages: es

source: Upgrade from 3.2.x / 3.3.x
es: Actualizar desde 3.2.x / 3.3.x

source: Upgrade the dependencies
es: Actualizar las dependencias

source: Perform the ``migrations`` management command; in case some attribute is conflicting, remove it manually from the DB
es: Ejecute el comando de gestión ``migraciones``; en caso de que algún atributo esté en conflicto, elimínelo manualmente de la base de datos

source: Proform the ``collectstatic`` management command
es: Realiza el comando de gestión ``collectstatic``

source: Upgrade the instance dependencies
es: Actualiza las dependencias de la instancia

source: Check the :ref:`install_dep` and :ref:`install_venv` sections in order to upgrade your Python environment.
es: Consulte las secciones :ref:`install_dep` y :ref:`install_venv` para actualizar tu entorno Python.

source: Also, make sure the code is ``Python 3.8`` compatible and that you switched and aligned the **source code** and the **requirements.txt** to the ``master`` branch.
es: Además, asegúrate de que el código sea compatible con ``Python 3.8`` y que hayas cambiado y alineado el **código fuente** y el **requirements.txt** a la rama ``master``.

source: This must be done manually and with particular attention.
es: Esto debe hacerse manualmente y con especial atención.

source: Run GeoNode migrations
es: Ejecutar migraciones de GeoNode

source: Activate your GeoNode virtualenv and set the env vars:
es: Active su GeoNode virtualenv y configure las variables de entorno:

source: Here are the variables to export - update them to your environment settings:
es: Aquí están las variables a exportar - actualízalas según la configuración de tu entorno:

source: Apply migrations and apply basic fixtures:
es: Aplica migraciones y aplica las fixtures básicas:

source: Incase of an error of :guilabel:`django.db.utils.ProgrammingError: column "colum-name" of relation "table-name" already exists` on running migrations, you can backup the field data with the following steps.
es: En caso de un error de :guilabel:`django.db.utils.ProgrammingError: column "colum-name" of relation "table-name" already exists` al ejecutar las migraciones, puedes hacer una copia de seguridad de los datos del campo con los siguientes pasos.

source: Run migration then:
es: Ejecute la migración entonces:

source: Create superuser
es: Crea un superusuario

source: To create a superuser you should drop the following constraints (they can be re-enabled if needed):
es: Para crear un superusuario, debes eliminar las siguientes restricciones (pueden ser reactivadas si es necesario):

source: Update Templates
es: Actualiza las plantillas

source: Update available templates to use {% load static %} instead of {% load staticfiles %}
es: Actualiza las plantillas disponibles para usar {% load static %} en lugar de {% load staticfiles %}
