Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/accounts_user_profile/new_account/index.po
Languages: es

source: Creating a New Account
es: Creando una nueva cuenta

source: To take full advantage of all the GeoNode features you need a user account. Follow these step to create a new one.
es: Para aprovechar al máximo todas las funciones de GeoNode, necesita una cuenta de usuario. Siga estos pasos para crear uno nuevo.

source: From any page in the web interface, you will see a :guilabel:`Register` link. Click that link, and the register form will appear
es: Desde cualquier página de la interfaz web, verá un enlace :guilabel:`Registrarse`. Haga clic en ese enlace y aparecerá el formulario de registro.

source: The registrations in GeoNode must be open, in case you don't see the register link then it's not possible to register unless the administrator of the site does that for you.
es: Los registros en GeoNode deben estar abiertos, en caso de que no vea el enlace de registro, no será posible registrarse a menos que el administrador del sitio lo haga por usted.

source: *Register Link*
es: *Enlace de registro*

source: On the next page, fill out the form. Enter a username and password in the fields. Also, enter your email address for verification.
es: En la página siguiente, complete el formulario. Ingrese un nombre de usuario y contraseña en los campos. Además, ingrese su dirección de correo electrónico para verificación.

source: *Registering for a new account*
es: *Registrarse para una nueva cuenta*

source: You will be automatically logged in and redirected to the Profile page. An email will be sent confirming that you have signed up. If no errors occur during the registration, the following alerts will appear on the screen:
es: Iniciará sesión automáticamente y será redirigido a la página de Perfil. Se enviará un correo electrónico confirmando que te has registrado. Si no se producen errores durante el registro, aparecerán las siguientes alertas en pantalla:

source: *Alerts*
es: *Alertas*

source: To log out click on the :guilabel:`Log out` link of the user menu.
es: Para cerrar sesión haga clic en el enlace :guilabel:`Cerrar sesión` del menú de usuario.

source: *Logout link*
es: *Enlace para cerrar sesión*

source: You have to confirm this action as described in the picture below.
es: Tienes que confirmar esta acción como se describe en la siguiente imagen.

source: *Confirm Log out*
es: *Confirmar cerrar sesión*
