Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/install/advanced/core/index.po
Languages: es

source: Serving {“geonode”, “geoserver”} via NGINX
es: Sirviendo {“geonode”, “geoserver”} a través de NGINX

source: **!IMPORTANT!**
es: **!IMPORTANTE!**

source: Change the line ``ExecStart=...`` below with your current user home directory!
es: ¡Cambia la línea ``ExecStart=...`` a continuación con el directorio de inicio de tu usuario actual!

source: e.g.: If the user is ``geosolutions`` then ``ExecStart=/home/geosolutions/.virtualenvs/geonode/bin/uwsgi --ini /opt/geonode/uwsgi.ini``
es: por ejemplo: Si el usuario es ``geosolutions`` entonces ``ExecStart=/home/geosolutions/.virtualenvs/geonode/bin/uwsgi --ini /opt/geonode/uwsgi.ini``

source: Update the settings in order to use the ``PostgreSQL`` Database
es: Actualiza la configuración para utilizar la base de datos ``PostgreSQL``

source: Make sure you already installed and configured the Database as explained in the previous sections.
es: Asegúrate de haber instalado y configurado la base de datos como se explica en las secciones anteriores.

source: Instead of using the ``local_settings.py``, you can drive the GeoNode behavior through the ``.env*`` variables; see as an instance the file ``./paver_dev.sh`` or ``./manage_dev.sh`` in order to understand how to use them. In that case **you don't need to create** the ``local_settings.py`` file; you can just stick with the decault one, which will take the values from the ENV. We tend to prefer this method in a production/dockerized system.
es: En lugar de usar el archivo ``local_settings.py``, puedes controlar el comportamiento de GeoNode a través de las variables ``.env*``; consulta por ejemplo ``./paver_dev.sh`` o ``./manage_dev`` para entender cómo usarlas. En ese caso **no necesitas crear** el archivo ``local_settings.py``; puedes simplemente usar el archivo por defecto, que tomará los valores del entorno. Tendemos a preferir este método en un sistema de producción/dockerizado.

source: Before finalizing the configuration we will need to update the ``UWSGI`` settings
es: Antes de finalizar la configuración necesitaremos actualizar la configuración de ``UWSGI``

source: Restart ``UWSGI`` and update ``OAuth2`` by using the new ``geonode.settings``
es: Reinicia ``UWSGI`` y actualiza ``OAuth2`` usando el nuevo ``geonode.settings``

source: Check for any error with
es: Comprueba si hay algún error con

source: Reload the UWSGI configuration with
es: Vuelva a cargar la configuración de UWSGI con

source: 6. Update the settings in order to update GeoNode and GeoServer services running on a public IP or hostname
es: 6. Actualizar la configuración para actualizar los servicios GeoNode y GeoServer que se ejecutan en una IP pública o nombre de host

source: Before exposing your services to the Internet, **make sure** your system is **hardened** and **secure enough**. See the specific documentation section for more details.
es: Antes de exponer tus servicios a Internet, **asegúrate** que tu sistema esté **reforzado** y **lo suficientemente seguro**. Consulta la sección de documentación específica para más detalles.

source: Let's say you want to run your services on a public IP or domain, e.g. ``www.example.org``. You will need to slightly update your services in order to reflect the new server name.
es: Supongamos que deseas ejecutar tus servicios en una IP o dominio público, p. ``www.example.org``. Deberá actualizar ligeramente tus servicios para reflejar el nuevo nombre del servidor.

source: In particular the steps to do are:
es: En concreto los pasos a seguir son:

source: Update ``NGINX`` configuration in order to serve the new domain name.
es: Actualiza la configuración de ``NGINX`` para servir el nuevo nombre de dominio.

source: Update ``.env`` with the new domain name.
es: Actualiza ``.env`` con el nuevo nombre de dominio.

source: Update ``OAuth2`` configuration in order to hit the new hostname.
es: Actualiza la configuración de ``OAuth2`` para acceder al nuevo nombre de host.

source: Update the existing ``GeoNode`` links in order to hit the new hostname.
es: Actualiza los enlaces ``GeoNode`` existentes para acceder al nuevo nombre de host.

source: If at the end you get a "bad gateway" error when accessing your geonode site, check uwsgi log with ``sudo tail -f /var/log/geonode.log`` and if theres is an error related with port 5432 check the listening configuration from the postgresql server and allow the incoming traffic from geonode.
es: Si al final obtienes un error de "bad gateway" al acceder a tu sitio de geonode, verifica el registro de uwsgi con ``sudo tail -f /var/log/geonode.log`` y si hay un error relacionado con el puerto 5432, verifica la configuración de escucha del servidor PostgreSQL y permite el tráfico entrante desde GeoNode.

source: 7. Install and enable HTTPS secured connection through the Let's Encrypt provider
es: 7. Instala y habilita la conexión segura HTTPS a través del proveedor Let's Encrypt

source: Next, the steps to do are:
es: A continuación, los pasos a realizar son:

source: Update the ``GeoNode`` **OAuth2** ``Redirect URIs`` accordingly.
es: Actualiza el `Redirect URIs`` de **OAuth2** en ``GeoNode`` en consecuencia.

source: From the ``GeoNode Admin Dashboard`` go to ``Home › Django/GeoNode OAuth Toolkit › Applications › GeoServer``
es: Desde el ``Panel de administración de GeoNode``, ve a ``Inicio › Django/GeoNode OAuth Toolkit › Applications › GeoServer``

source: *Redirect URIs*
es: *Redireccionar URI*

source: Update the ``GeoServer`` ``Proxy Base URL`` accordingly.
es: Actualiza el ``URL base del proxy``de ``GeoServer`` en consecuencia.

source: From the ``GeoServer Admin GUI`` go to ``About & Status > Global``
es: Desde la ``GeoServer Admin GUI``, ve a ``Settings > Global``

source: *Proxy Base URL*
es: *URL base del proxy*

source: Update the ``GeoServer`` ``Role Base URL`` accordingly.
es: Actualiza el ``Role Base URL`` de ``GeoServer``en consecuencia.

source: From the ``GeoServer Admin GUI`` go to ``Security > Users, Groups, Roles > geonode REST role service``
es: Desde la `GeoServer Admin GUI``, ve a ``Seguridad > Usuario, Grupos, Roles > geonode REST role service``

source: Update the ``GeoServer`` ``OAuth2 Service Parameters`` accordingly.
es: Actualizar los ``OAuth2 Service Parameters`` de ``GeoServer`` en consecuencia.

source: From the ``GeoServer Admin GUI`` go to ``Security > Authentication > Authentication Filters > geonode-oauth2``
es: Desde la ``GUI de administración de GeoServer``, vaya a ``Seguridad > Identificación > Filtros de identificación > geonode-oauth2``

source: Update the ``.env`` file
es: Actualiza el archivo ``.env``

source: 8. Enabling Fully Asynchronous Tasks
es: 8. Habilitación de tareas totalmente asincrónicas

source: Install and configure `"rabbitmq-server" <https://lindevs.com/install-rabbitmq-on-ubuntu/>`_
es: Instala y configura `"rabbitmq-server" <https://lindevs.com/install-rabbitmq-on-ubuntu/>`_

source: A `March 2021 blog post <https://blog.rabbitmq.com/posts/2021/03/migrate-off-of-bintray/>`_ from RabbitMQ provides alternative installations for other systems.
es: Una `publicación de blog de marzo de 2021 <https://blog.rabbitmq.com/posts/2021/03/migrate-off-of-bintray/>`_ de RabbitMQ proporciona instalaciones alternativas para otros sistemas.

source: **Install rabbitmq-server**
es: **Instalar el servidor Rabbitmq**

source: Reference: `lindevs.com/install-rabbitmq-on-ubuntu/ <https://lindevs.com/install-rabbitmq-on-ubuntu/>`_ & `www.rabbitmq.com/install-debian.html/ <https://www.rabbitmq.com/install-debian.html#apt-cloudsmith/>`_
es: Referencia: `lindevs.com/install-rabbitmq-on-ubuntu/ <https://lindevs.com/install-rabbitmq-on-ubuntu/>`_ & `www.rabbitmq.com/install-debian.html/ <https://www.rabbitmq.com/install-debian.html#apt-cloudsmith/>`_

source: **Create admin user**
es: **Crear usuario administrador**

source: This is the user that GeoNode will use to communicate with rabbitmq-server.
es: Este es el usuario que GeoNode utilizará para comunicarse con el servidor Rabbitmq.

source: **Managing RabbitMQ**
es: **Administrando RabbitMQ**

source: You can manage the rabbitmq-server service like any other service::
es: Puedes gestionar el servicio Rabbitmq-server como cualquier otro servicio::

source: You can manage the rabbitmq-server node with `rabbitmqctl <https://www.rabbitmq.com/rabbitmqctl.8.html>`_. For example, to fully reset the server, use these commands::
es: Puedes administrar el nodo del servidor Rabbitmq con `rabbitmqctl <https://www.rabbitmq.com/rabbitmqctl.8.html>`_. Por ejemplo, para restablecer completamente el servidor, utiliza estos comandos::

source: After reset, you'll need to recreate the ``admin`` user (see above).
es: Después del reinicio, necesitarás volver a crear el usuario ``admin`` (ver arriba).

source: Daemonize and configure Celery
es: Demonizar y configurar Celery

source: **Create the Systemd unit**
es: **Crear la unidad Systemd**

source: **Manage Celery**
es: **Administrar Celery**

source: Restart Celery
es: Reiniciar Celery

source: Inspect the logs
es: Inspeccionar los registros

source: **Troubleshooting**
es: **Solución de problemas**

source: Celery might crash during startup with this error:
es: Celery puede fallar durante el inicio con este error:

source: The workaround is a symlink at that path.
es: La solución es un enlace simbólico en esa ruta.

source: Install Memcached
es: Instalar Memcached

source: In this section we are going to list the passages needed to deploy a vanilla ``GeoNode`` with ``Docker`` You can follow the instructions at :ref:`Docker Setup for Ubuntu (22.04) <Ubuntu (22.04) Basic Setup>` to prepare a Ubuntu 22.04 server with Docker and Docker Compose
es: En esta sección vamos a enumerar los pasajes necesarios para implementar un ``GeoNode`` estándar con ``Docker``. Puedes seguir las instrucciones en :ref:`Docker Setup for Ubuntu (22.04) <Ubuntu (22.04) Basic Setup>` para preparar un servidor Ubuntu 22.04 con Docker y Docker Compose

source: 1. Clone GeoNode
es: 1. Clonar GeoNode

source: 2. Prepare the .env file
es: 2. Prepara el archivo .env

source: Follow the instructions at :ref:`Docker create env file<Docker create env file>`
es: Sigue las instrucciones en :ref:`Docker create env file<Docker create env file>`

source: 3. Build and run
es: 3. Construir y ejecutar

source: Follow the instructions at :ref:`Docker build and run<Docker build and run>`
es: Sigue las instrucciones en :ref:`Docker build and run<Docker build and run>`

source: Test the instance and follow the logs
es: Prueba la instancia y sigue los registros

source: If you run the containers daemonized (with the ``-d`` option), you can either run specific Docker commands to follow the ``startup and initialization logs`` or entering the image ``shell`` and check for the ``GeoNode logs``.
es: Si ejecutas los contenedores demonizados (con la opción ``-d``), puedes ejecutar comandos específicos de Docker para seguir los ``registros de inicio e inicialización`` o ingresar al ``shell`` de la imagen y verificar los ``Registros de GeoNode``.

source: In order to follow the ``startup and initialization logs``, you will need to run the following command from the repository folder
es: Para seguir los ``registros de inicio e inicialización``, deberás ejecutar el siguiente comando desde la carpeta del repositorio

source: Alternatively:
es: Alternativamente:

source: You should be able to see several initialization messages. Once the container is up and running, you will see the following statements
es: Deberías poder ver varios mensajes de inicialización. Una vez que el contenedor esté en funcionamiento, verás las siguientes declaraciones

source: To exit just hit ``CTRL+C``.
es: Para salir simplemente presiona ``CTRL+C``.

source: This message means that the GeoNode containers have bee started. Browsing to ``http://localhost/`` will show the GeoNode home page. You should be able to successfully log with the default admin user (``admin`` / ``admin``) and start using it right away.
es: Este mensaje significa que los contenedores GeoNode se han iniciado. Al navegar a ``http://localhost/`` se mostrará la página de inicio de GeoNode. Deberías poder iniciar sesión correctamente con el usuario administrador predeterminado (``admin`` / ``admin``) y comenzar a usarlo de inmediato.

source: With Docker it is also possible to run a shell in the container and follow the logs exactly the same as you deployed it on a physical host. To achieve this run
es: Con Docker también es posible ejecutar un shell en el contenedor y seguir los registros exactamente igual que si lo hubieras desplegado en un host físico. Para lograr esto ejecuta

source: To exit just hit ``CTRL+C`` and ``exit`` to return to the host.
es: Para salir, simplemente presiona ``CTRL+C`` y ``exit`` para regresar al host.

source: Override the ENV variables to deploy on a public IP or domain
es: Anula las variables ENV para implementar en una IP o dominio público

source: If you would like to start the containers on a ``public IP`` or ``domain``, let's say ``www.example.org``, you can follow the instructions at :ref:`Deploy to production<Docker deploy to production>`
es: Si deseas iniciar los contenedores en una ``IP pública`` o ``dominio``, digamos ``www.example.org``, puedes seguir las instrucciones en :ref:`Deploy to production<Docker deploy to production>`

source: ariables to customize the GeoNode instance. See the ``GeoNode Settings`` section in order to get a list of the available options.
es: variables para personalizar la instancia de GeoNode. Consulta la sección ``Configuración de GeoNode`` para obtener una lista de las opciones disponibles.

source: Remove all data and bring your running GeoNode deployment to the initial stage
es: Elimina todos los datos y lleva tu implementación de GeoNode en ejecución a la etapa inicial

source: This procedure allows you to stop all the containers and reset all the data with the deletion of all the volumes.
es: Este procedimiento te permite detener todos los contenedores y restablecer todos los datos con la eliminación de todos los volúmenes.

source: Get rid of old Docker images and volumes (reset the environment completely)
es: Eliminar imágenes y volúmenes antiguos de Docker (reiniciar el entorno completamente)

source: For more details on Docker commands, please refer to the official Docker documentation.
es: Para obtener más detalles sobre los comandos de Docker, consulta la documentación oficial de Docker.

source: It is possible to let docker show which containers are currently running (add ``-a`` for all containers, also stopped ones)
es: Es posible permitir que Docker muestre qué contenedores se están ejecutando actualmente (agregue ``-a`` para todos los contenedores, también los detenidos).

source: Stop all the containers by running
es: Detén todos los contenedores ejecutando

source: Force kill all containers by running
es: Fuerza la eliminación de todos los contenedores ejecutando

source: I you want to clean up all containers and images, without deleting the static volumes (i.e. the ``DB`` and the ``GeoServer catalog``), issue the following commands
es: Si deseas limpiar todos los contenedores e imágenes, sin eliminar los volúmenes estáticos (es decir, la ``DB`` y el ``GeoServer catalog``), ejecuta los siguientes comandos

source: If you want to remove a ``volume`` also
es: Si también deseas eliminar un ``volumen``
