Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/install/advanced/core/index.po
Languages: es

source: Overview
es: Descripción general

source: The following steps will guide you to a fresh setup of GeoNode.
es: Los siguientes pasos te guiarán hacia una nueva configuración de GeoNode.

source: All guides will first install and configure the system to run it in ``DEBUG`` mode (also known as ``DEVELOPMENT`` mode) and then by configuring an HTTPD server to serve GeoNode through the standard ``HTTP`` (``80``) port.
es: Todas las guías primero instalarán y configurarán el sistema para ejecutarlo en modo ``DEBUG`` (también conocido como modo ``DEVELOPMENT``) y luego configurarán un servidor HTTPD para servir GeoNode a través del puerto estándar ``HTTP`` (` `80``).

source: Those guides **are not** meant to be used on a production system. There will be dedicated chapters that will show you some *hints* to optimize GeoNode for a production-ready machine. In any case, we strongly suggest to task an experienced *DevOp* or *System Administrator* before exposing your server to the ``WEB``.
es: Esas guías **no** están destinadas a usarse en un sistema de producción. Habrá capítulos dedicados que te mostrarán algunos *consejos* para optimizar GeoNode para una máquina lista para producción. En cualquier caso, recomendamos encarecidamente consultar a un *DevOp* o *Administrador del sistema* experimentado antes de exponer tu servidor a la ``WEB``.

source: This part of the documentation describes the complete setup process for GeoNode on an Ubuntu 22.04.1LTS **64-bit** clean environment (Desktop or Server).
es: Esta parte de la documentación describe el proceso de configuración completo de GeoNode en un entorno limpio de Ubuntu 22.04.1LTS **64 bits** (escritorio o servidor).

source: All examples use shell commands that you must enter on a local terminal or a remote shell.
es: Todos los ejemplos utilizan comandos de shell que debes ingresar en una terminal local o en un shell remoto.

source: If you have a graphical desktop environment you can open the terminal application after login;
es: Si tienes un entorno de escritorio gráfico, puedes abrir la aplicación de terminal después de iniciar sesión;

source: if you are working on a remote server the provider or sysadmin should has given you access through an ssh client.
es: si estás trabajando en un servidor remoto, el proveedor o administrador del sistema debería haberte dado acceso a través de un cliente ssh.

source: 1. Install the dependencies
es: 1. Instalar las dependencias

source: In this section, we are going to install all the basic packages and tools needed for a complete GeoNode installation.
es: En esta sección, instalaremos todos los paquetes y herramientas básicos necesarios para una instalación completa de GeoNode.

source: To follow this guide, a basic knowledge about Ubuntu Server configuration and working with a shell is required.
es: Para seguir esta guía, se requieren conocimientos básicos sobre la configuración del servidor Ubuntu y cómo trabajar con un shell.

source: This guide uses ``vim`` as the editor; fill free to use ``nano``, ``gedit`` or others.
es: Esta guía utiliza ``vim`` como editor; siéntete libre de usar ``nano``, ``gedit`` u otros.

source: Upgrade system packages
es: Paquetes de sistema de actualización

source: Check that your system is already up-to-date with the repository running the following commands:
es: Verifique que tu sistema ya esté actualizado con el repositorio ejecutando los siguientes comandos:

source: Packages Installation
es: Instalación de paquetes

source: You don't need to install the **system packages** if you want to run the project using Docker
es: No necesitas instalar los **paquetes del sistema** si desea ejecutar el proyecto usando Docker

source: We will use **example.org** as fictitious Domain Name.
es: Usaremos **example.org** como nombre de dominio ficticio.

source: First, we are going to install all the **system packages** needed for the GeoNode setup. Login to the target machine and execute the following commands:
es: Primero, instalaremos todos los **paquetes del sistema** necesarios para la configuración de GeoNode. Inicia sesión en la máquina de destino y ejecuta los siguientes comandos:

source: GeoNode 4.2.x is not compatible with Python < 3.7
es: GeoNode 4.2.x no es compatible con Python < 3.7

source: 2. GeoNode Installation
es: 2. Instalación de GeoNode

source: This is the most basic installation of GeoNode. It won't use any external server like ``Apache Tomcat``, ``PostgreSQL`` or ``HTTPD``.
es: Esta es la instalación más básica de GeoNode. No utilizará ningún servidor externo como ``Apache Tomcat``, ``PostgreSQL`` o ``HTTPD``.

source: First of all we need to prepare a new Python Virtual Environment
es: En primer lugar, debemos preparar un nuevo entorno virtual de Python

source: Since geonode needs a large number of different python libraries and packages, its recommended to use a python virtual environment to avoid conflicts on dependencies with system wide python packages and other installed software. See also documentation of `Virtualenvwrapper <https://virtualenvwrapper.readthedocs.io/en/stable/>`_ package for more information
es: Dado que GeoNode necesita una gran cantidad de bibliotecas y paquetes de Python diferentes, se recomienda utilizar un entorno virtual de Python para evitar conflictos de dependencias con paquetes de Python de todo el sistema y otro software instalado. Consulte también la documentación del paquete `Virtualenvwrapper <https://virtualenvwrapper.readthedocs.io/en/stable/>`_ para obtener más información

source: The GeoNode Virtual Environment must be created only the first time. You won't need to create it again everytime.
es: El entorno virtual GeoNode debe crearse sólo la primera vez. No necesitarás crearlo nuevamente cada vez.

source: At this point your command prompt shows a ``(geonode)`` prefix, this indicates that your virtualenv is active.
es: En este punto, tu símbolo del sistema muestra un prefijo ``(geonode)``, esto indica que su virtualenv está activo.

source: The next time you need to access the Virtual Environment just run
es: La próxima vez que necesites acceder al entorno virtual, simplemente ejecute

source: In order to save permanently the virtualenvwrapper environment
es: Para guardar permanentemente el entorno virtualenvwrapper

source: Edit ``/opt/geonode/celery-cmd``.
es: Edite ``/opt/geonode/celery-cmd``.

source: Edit ``/opt/geonode/geonode/settings.py``.
es: Edite ``/opt/geonode/geonode/settings.py``.

source: Edit ``/opt/geonode/uwsgi.ini``.
es: Edite ``/opt/geonode/uwsgi.ini``.

source: 3. Postgis database Setup
es: 3. Configuración de la base de datos Postgis

source: Be sure you have successfully completed all the steps of the section :ref:`install_dep`.
es: Asegúrate de haber completado con éxito todos los pasos de la sección :ref:`install_dep`.

source: In this section, we are going to setup users and databases for GeoNode in PostgreSQL.
es: En esta sección, configuraremos usuarios y bases de datos para GeoNode en PostgreSQL.

source: Install and Configure the PostgreSQL Database System
es: Instalar y configurar el sistema de base de datos PostgreSQL

source: In this section we are going to install the ``PostgreSQL`` packages along with the ``PostGIS`` extension. Those steps must be done **only** if you don't have the DB already installed on your system.
es: En esta sección vamos a instalar los paquetes ``PostgreSQL`` junto con la extensión ``PostGIS``. Esos pasos deben realizarse **solo** si aún no tienes la base de datos instalada en su sistema.

source: We now must create two databases, ``geonode`` and ``geonode_data``, belonging to the role ``geonode``.
es: Ahora debemos crear dos bases de datos, ``geonode`` y ``geonode_data``, pertenecientes al rol ``geonode``.

source: This is our default configuration. You can use any database or role you need. The connection parameters must be correctly configured on ``settings``, as we will see later in this section.
es: Esta es nuestra configuración predeterminada. Puedes utilizar cualquier base de datos o rol que necesites. Los parámetros de conexión deben estar correctamente configurados en ``settings``, como veremos más adelante en este apartado.

source: Databases and Permissions
es: Bases de datos y permisos

source: First, create the geonode user. GeoNode is going to use this user to access the database
es: Primero, crea el usuario de geonode. GeoNode utilizará este usuario para acceder a la base de datos

source: You will be prompted asked to set a password for the user. **Enter geonode as password**.
es: Se te pedirá que establezcas una contraseña para el usuario. **Ingresa geonode como contraseña**.

source: This is a sample password used for the sake of simplicity. This password is very **weak** and should be changed in a production environment.
es: Esta es una contraseña de ejemplo utilizada por simplicidad. Esta contraseña es muy **débil** y debe cambiarse en un entorno de producción.

source: Create database ``geonode`` and ``geonode_data`` with owner ``geonode``
es: Crear base de datos ``geonode`` y ``geonode_data`` con el propietario ``geonode``

source: Next let's create PostGIS extensions
es: A continuación, vamos a crear las extensiones de PostGIS

source: Final step is to change user access policies for local connections in the file ``pg_hba.conf``
es: El último paso es cambiar las políticas de acceso de usuarios para conexiones locales en el archivo ``pg_hba.conf``

source: Scroll down to the bottom of the document. We want to make local connection ``trusted`` for the default user.
es: Desplázate hasta el final del documento. Queremos que la conexión local sea "confiable (trusted)" para el usuario predeterminado.

source: Make sure your configuration looks like the one below.
es: Asegúrate de que tu configuración se parezca a la siguiente.

source: If your ``PostgreSQL`` database resides on a **separate/remote machine**, you'll have to **allow** remote access to the databases in the ``/etc/postgresql/13/main/pg_hba.conf`` to the ``geonode`` user and tell PostgreSQL to **accept** non-local connections in your ``/etc/postgresql/13/main/postgresql.conf`` file
es: Si tu base de datos ``PostgreSQL`` reside en una **máquina separada/remota**, tendrá que **permitir** el acceso remoto a las bases de datos en el archivo ``/etc/postgresql/13/main/pg_hba. conf`` para el usuario ``geonode`` y decirle a PostgreSQL que **acepte** conexiones no locales en tu archivo ``/etc/postgresql/13/main/postgresql.conf``

source: Restart PostgreSQL to make the change effective.
es: Reinicia PostgreSQL para que el cambio sea efectivo.

source: PostgreSQL is now ready. To test the configuration, try to connect to the ``geonode`` database as ``geonode`` role.
es: PostgreSQL está listo. Para probar la configuración, intenta conectarte a la base de datos ``geonode`` con el rol ``geonode``.

source: 4. Install GeoServer
es: 4. Instalar GeoServer

source: In this section, we are going to install the ``Apache Tomcat 8`` Servlet Java container, which will be started by default on the internal port ``8080``.
es: En esta sección, vamos a instalar el contenedor Servlet Java ``Apache Tomcat 8``, que se iniciará de forma predeterminada en el puerto interno ``8080``.

source: We will also perform several optimizations to:
es: También realizaremos varias optimizaciones para:

source: Correctly setup the Java VM Options, like the available heap memory and the garbage collector options.
es: Configurar correctamente las opciones de Java VM, como la memoria dinámica disponible y las opciones del recolector de basura.

source: Externalize the ``GeoServer`` and ``GeoWebcache`` catalogs in order to allow further updates without the risk of deleting our datasets.
es: Externalizar los catálogos ``GeoServer`` y ``GeoWebcache`` para permitir futuras actualizaciones sin el riesgo de eliminar nuestros conjuntos de datos.

source: This is still a basic setup of those components. More details will be provided on sections of the documentation concerning the hardening of the system in a production environment. Nevertheless, you will need to tweak a bit those settings accordingly with your current system. As an instance, if your machine does not have enough memory, you will need to lower down the initial amount of available heap memory. **Warnings** and **notes** will be placed below the statements that will require your attention.
es: Esta es aún una configuración básica de esos componentes. Se proporcionarán más detalles en las secciones de la documentación referentes al endurecimiento del sistema en un entorno de producción. No obstante, necesitarás ajustar un poco esos parámetros de acuerdo con tu sistema actual. Por ejemplo, si tu máquina no tiene suficiente memoria, deberás reducir la cantidad inicial de memoria heap disponible. Se colocarán **advertencias** y **notas** debajo de las declaraciones que requerirán tu atención.

source: Install Apache Tomcat
es: Instalar Apache Tomcat

source: The reference version of Tomcat for the Geoserver for GeoNode is **Tomcat 9**.
es: La versión de referencia de Tomcat para GeoServer en GeoNode es **Tomcat 9**.

source: The following steps have been adapted from https://yallalabs.com/linux/ubuntu/how-to-install-apache-tomcat-9-ubuntu-20-04/
es: Los siguientes pasos han sido adaptados de https://yallalabs.com/linux/ubuntu/how-to-install-apache-tomcat-9-ubuntu-20-04/

source: Apache Tomcat 9 and Geoserver require Java 11 or newer to be installed on the server. Check the steps before in order to be sure you have OpenJDK 11 correctly installed on your system.
es: Apache Tomcat 9 y Geoserver requieren que Java 11 o una versión posterior esté instalada en el servidor. Verifica los pasos anteriores para asegurarse de tener OpenJDK 11 correctamente instalado en su sistema.

source: First, it is not recommended to run Apache Tomcat as user root, so we will create a new system user which will run the Apache Tomcat server
es: Primero, no se recomienda ejecutar Apache Tomcat como usuario root, por lo que crearemos un nuevo usuario del sistema que ejecutará el servidor Apache Tomcat

source: Now, go to the official Apache Tomcat `website <https://tomcat.apache.org/>`_ and download the most recent version of the software to your server. But don't use Tomcat10 because there are still some errors between Geoserver and Tomcat.
es: Ahora, ve al `sitio web oficial de Apache Tomcat <https://tomcat.apache.org/>`_ y descarga la versión más reciente del software a tu servidor. Pero no utilice Tomcat10 porque todavía hay algunos errores entre Geoserver y Tomcat.

source: Once the download is complete, extract the tar file to the /opt/tomcat directory:
es: Una vez que se complete la descarga, extrae el archivo tar al directorio /opt/tomcat:

source: Apache Tomcat is updated regulary. So, to have more control over versions and updates, we’ll create a symbolic link as below:
es: Apache Tomcat se actualiza periódicamente. Entonces, para tener más control sobre las versiones y actualizaciones, crearemos un enlace simbólico como se muestra a continuación:

source: Now, let’s change the ownership of all Apache Tomcat files as below:
es: Ahora, cambiemos la propiedad de todos los archivos de Apache Tomcat como se muestra a continuación:

source: Make the shell scripts inside the bin directory executable:
es: Haz ejecutables los scripts de shell dentro del directorio bin:

source: Create the a systemd file with the following content:
es: Crea un archivo systemd con el siguiente contenido:

source: Now you can start the Apache Tomcat 9 server and enable it to start on boot time using the following command:
es: Ahora puedes iniciar el servidor Apache Tomcat 9 y habilitarlo para que se inicie en el momento del arranque usando el siguiente comando:

source: For verification, type the following ss command, which will show you the 8080 open port number, the default open port reserved for Apache Tomcat Server.
es: Para verificación, escribe el siguiente comando ``ss``, que te mostrará el número de puerto abierto 8080, el puerto abierto predeterminado reservado para el servidor Apache Tomcat.

source: In a clean Ubuntu 22.04.1, the ss command may not be found and the iproute2 library should be installed first.
es: En un Ubuntu 22.04.1 limpio, es posible que no se encuentre el comando ``ss`` y primero se debe instalar la biblioteca ``iproute2``.

source: If your server is protected by a firewall and you want to access Tomcat from the outside of your local network, you need to open port 8080.
es: Si tu servidor está protegido por un firewall y deseas acceder a Tomcat desde el exterior de tu red local, debe abrir el puerto 8080.

source: Use the following command to open the necessary port:
es: Utiliza el siguiente comando para abrir el puerto necesario:

source: Generally, when running Tomcat in a production environment, you should use a load balancer or reverse proxy.
es: Generalmente, cuando se ejecuta Tomcat en un entorno de producción, debes utilizar un equilibrador de carga o un proxy inverso.

source: It’s a best practice to allow access to port ``8080`` only from your internal network.
es: Es una buena práctica permitir el acceso al puerto ``8080`` solo desde su red interna.

source: We will use ``NGINX`` in order to provide Apache Tomcat through the standard ``HTTP`` port.
es: Usaremos ``NGINX`` para proporcionar Apache Tomcat a través del puerto estándar ``HTTP``.

source: Alternatively you can define the Tomcat Service as follow, in case you would like to use ``systemctl``
es: Alternativamente, puedes definir el servicio Tomcat de la siguiente manera, en caso de que desees utilizar ``systemctl``

source: Install GeoServer on Tomcat
es: Instalar GeoServer en Tomcat

source: Let's externalize the ``GEOSERVER_DATA_DIR`` and ``logs``
es: Exterioricemos el ``GEOSERVER_DATA_DIR`` y los ``logs``

source: Let's now configure the ``JAVA_OPTS``, i.e. the parameters to run the Servlet Container, like heap memory, garbage collector and so on.
es: Ahora configuremos ``JAVA_OPTS``, es decir, los parámetros para ejecutar el contenedor de servlet, como memoria heap, recolector de basura, etc.

source: After the execution of the above statements, you should be able to see the new options written at the bottom of the file ``/opt/tomcat/latest/bin/setenv.sh``.
es: Después de la ejecución de las declaraciones anteriores, debería poder ver las nuevas opciones escritas en la parte inferior del archivo ``/opt/tomcat/latest/bin/setenv.sh``.

source: Those options could be updated or changed manually at any time, accordingly to your needs.
es: Esas opciones pueden actualizarse o cambiarse manualmente en cualquier momento, según tus necesidades.

source: The default options we are going to add to the Servlet Container, assume you can reserve at least ``4GB`` of ``RAM`` to ``GeoServer`` (see the option ``-Xmx4096m``). You must be sure your machine has enough memory to run both ``GeoServer`` and ``GeoNode``, which in this case means at least ``4GB`` for ``GeoServer`` plus at least ``2GB`` for ``GeoNode``. A total of at least ``6GB`` of ``RAM`` available on your machine. If you don't have enough ``RAM`` available, you can lower down the values ``-Xms512m -Xmx4096m``. Consider that with less ``RAM`` available, the performances of your services will be highly impacted.
es: Las opciones predeterminadas que vamos a agregar al contenedor de servlets suponen que puedes reservar al menos ``4 GB`` de ``RAM`` para ``GeoServer`` (consulta la opción ``-Xmx4096m``). Asegurate de que tu máquina tenga suficiente memoria para ejecutar tanto ``GeoServer`` como ``GeoNode``, lo que en este caso significa al menos ``4GB`` para ``GeoServer`` más al menos ``2GB`` para ``GeoNode``. Un total de al menos ``6 GB`` de ``RAM`` disponibles en tu máquina. Si no tienes suficiente ``RAM`` disponible, puedes reducir los valores ``-Xms512m -Xmx4096m``. Considera que con menos ``RAM`` disponible, el rendimiento de tus servicios se verá muy afectado.

source: Conifgure the Geofence DB
es: Configurar la base de datos Geofence

source: Before starting the service, Geofence must be configured to connect to the PostgreSQL DB, where its rules will be stored.
es: Antes de iniciar el servicio, se debe configurar Geofence para conectarse a la base de datos PostgreSQL, donde se almacenarán tus reglas.

source: In previous versions this step was optional and a file-based H2 DB could be used. This option has been dropped since using H2 is highly discouraged.
es: En versiones anteriores, este paso era opcional y se podía utilizar una base de datos H2 basada en archivos. Esta opción se ha descartado ya que se desaconseja el uso de H2.

source: Open the ``geofence-datasource-ovr.properties`` file for edit:
es: Abre el archivo ``geofence-datasource-ovr.properties`` para editarlo:

source: And paste the following code by replace the placehoders with the required files
es: Y pega el siguiente código reemplazando los marcadores de posición con los archivos requeridos

source: In order to make the changes effective, you'll need to restart the Servlet Container.
es: Para que los cambios sean efectivos, deberás reiniciar el contenedor de servlets.

source: If you can see on the logs something similar to this, without errors
es: Si ves algo similar a esto en los registros y no aparecen errores

source: Your ``GeoServer`` should be up and running at
es: Tu ``GeoServer`` debería estar funcionando en

source: In case of errors or the file ``geoserver.log`` is not created, check the Catalina logs in order to try to understand what's happened.
es: En caso de errores o que no se cree el archivo ``geoserver.log``, verifica los registros de Catalina para intentar comprender qué sucedió.

source: 5. Web Server
es: 5. Servidor web

source: Until now we have seen how to start ``GeoNode`` in ``DEBUG`` mode from the command line, through the ``paver`` utilities. This is of course not the best way to start it. Moreover you will need a dedicated ``HTTPD`` server running on port ``80`` if you would like to expose your server to the world.
es: Hasta ahora hemos visto cómo iniciar ``GeoNode`` en modo ``DEBUG`` desde la línea de comando, a través de las utilidades ``paver``. Por supuesto, esta no es la mejor manera de empezar. Además, necesitarás un servidor ``HTTPD`` dedicado que se ejecute en el puerto ``80`` si deseas exponer tu servidor al mundo.

source: In this section we will see:
es: En este apartado veremos:

source: How to configure ``NGINX`` HTTPD Server to host ``GeoNode`` and ``GeoServer``. In the initial setup we will still run the services on ``http://localhost``
es: Cómo configurar el servidor HTTPD ``NGINX`` para alojar ``GeoNode`` y ``GeoServer``. En la configuración inicial seguiremos ejecutando los servicios en ``http://localhost``

source: Update the ``settings`` in order to link ``GeoNode`` and ``GeoServer`` to the ``PostgreSQL`` Database.
es: Como actualizar la ``configuración`` para vincular ``GeoNode`` y ``GeoServer`` a la base de datos ``PostgreSQL``.

source: Update the ``settings`` in order to update ``GeoNode`` and ``GeoServer`` services running on a **public IP** or **hostname**.
es: Como actualizar la ``configuración`` para actualizar los servicios ``GeoNode`` y ``GeoServer`` que se ejecutan en una **IP pública** o **hostname**.

source: Install and enable ``HTTPS`` secured connection through the ``Let's Encrypt`` provider.
es: Como instalar y habilitar la conexión segura ``HTTPS`` a través del proveedor ``Let's Encrypt``.

source: Install and configure NGINX
es: Instalar y configurar NGINX

source: Seems to be possible that NGINX works with Python 3.6 and not with 3.8.
es: Parece posible que NGINX funcione con Python 3.6 y no con 3.8.
