Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/install/advanced/project/index.po
Languages: es

source: GeoNode Project
es: Proyecto GeoNode

source: Overview
es: Descripción general

source: The following steps will guide you to a new setup of GeoNode Project. All guides will first install and configure the system to run it in ``DEBUG`` mode (also known as ``DEVELOPMENT`` mode) and then by configuring an HTTPD server to serve GeoNode through the standard ``HTTP`` (``80``) port.
es: Los siguientes pasos to guiarán hacia una nueva configuración del Proyecto GeoNode. Todas las guías primero instalarán y configurarán el sistema para ejecutarlo en modo ``DEBUG`` (también conocido como modo ``DESARROLLO``) y luego configurarán un servidor HTTPD para servir a GeoNode a través del puerto estándar ``HTTP`` (` `80``).

source: Those guides **are not** meant to be used on a production system. There will be dedicated chapters that will show you some *hints* to optimize GeoNode for a production-ready machine. In any case, we strongly suggest to task an experienced *DevOp* or *System Administrator* before exposing your server to the ``WEB``.
es: Esas guías **no** están destinadas a usarse en un sistema de producción. Habrá capítulos dedicados que te mostrarán algunos *consejos* para optimizar GeoNode para una máquina lista para producción. En cualquier caso, recomendamos encarecidamente consultar a un *DevOp* o *Administrador del sistema* experimentado antes de exponer su servidor a la ``WEB``.

source: This part of the documentation describes the complete setup process for GeoNode on an Ubuntu 22.04 64-bit clean environment (Desktop or Server). All examples use shell commands that you must enter on a local terminal or a remote shell. - If you have a graphical desktop environment you can open the terminal application after login; - if you are working on a remote server the provider or sysadmin should has given you access through an ssh client.
es: Esta parte de la documentación describe el proceso de configuración completo de GeoNode en un entorno limpio Ubuntu 22.04 de 64 bits (escritorio o servidor). Todos los ejemplos utilizan comandos de shell que debes ingresar en una terminal local o en un shell remoto. - Si tienes un entorno de escritorio gráfico, puede abrir la aplicación de terminal después de iniciar sesión; - si está trabajando en un servidor remoto, el proveedor o administrador del sistema debería haberle dado acceso a través de un cliente ssh.

source: Install the dependencies
es: Instalar las dependencias

source: In this section, we are going to install all the basic packages and tools needed for a complete GeoNode installation. To follow this guide, a piece of basic knowledge about Ubuntu Server configuration and working with a shell is required. This guide uses ``vim`` as the editor; fill free to use ``nano``, ``gedit`` or others.
es: En esta sección, instalaremos todos los paquetes y herramientas básicos necesarios para una instalación completa de GeoNode. Para seguir esta guía, se requieren conocimientos básicos sobre la configuración del servidor Ubuntu y el trabajo con un shell. Esta guía utiliza ``vim`` como editor; siéntete libre de usar ``nano``, ``gedit`` u otros.

source: Upgrade system packages
es: Actualización de los paquetes de sistema

source: Check that your system is already up-to-date with the repository running the following commands:
es: Verifica que tu sistema ya esté actualizado con el repositorio ejecutando los siguientes comandos:

source: Create a Dedicated User
es: Crear un usuario dedicado

source: In the following steps a User named ``geonode`` is used: to run installation commands the user must be in the ``sudo`` group.
es: En los siguientes pasos se utiliza un usuario llamado ``geonode``: para ejecutar los comandos de instalación, el usuario debe estar en el grupo ``sudo``.

source: Create User ``geonode`` **if not present**:
es: Crear usuario ``geonode`` **si no está presente**:

source: Packages Installation
es: Instalación de paquetes

source: Add the Ubuntu GIS packages prior to installing the other system packages.
es: Agrega los paquetes GIS de Ubuntu antes de instalar los otros paquetes del sistema.

source: You don't need to install the **system packages** if you want to run the project using Docker
es: No necesitas instalar los **paquetes del sistema** si deseas ejecutar el proyecto usando Docker

source: First, we are going to install all the **system packages** needed for the GeoNode setup.
es: Primero, instalaremos todos los **paquetes del sistema** necesarios para la configuración de GeoNode.

source: Geonode Project Installation
es: Instalación del proyecto Geonode

source: Geonode project is the proper way to run a customized installation of Geonode. The repository of geonode-project contains a minimal set of files following the structure of a django-project. Geonode itself will be installed as a requirement of your project. Inside the project structure is possible to extend, replace or modify all geonode components (e.g. css and other static files, templates, models..) and even register new django apps **without touching the original Geonode code**.
es: El proyecto Geonode es la forma adecuada de ejecutar una instalación personalizada de Geonode. El repositorio de geonode-project contiene un conjunto mínimo de archivos que siguen la estructura de un proyecto django. El propio Geonode se instalará como requisito de su proyecto. Dentro de la estructura del proyecto es posible ampliar, reemplazar o modificar todos los componentes de GeoNode (por ejemplo, css y otros archivos estáticos, plantillas, modelos...) e incluso registrar nuevas aplicaciones de Django **sin tocar el código original de Geonode**.

source: You can call your geonode project whatever you like following the naming conventions for python packages (generally lower case with underscores (_). In the examples below, replace ``my_geonode`` with whatever you would like to name your project.
es: Puedes llamar a tu proyecto de geonode como desees siguiendo las convenciones de nomenclatura para paquetes de Python (generalmente minúsculas con guiones bajos (_). En los ejemplos siguientes, reemplaza ``my_geonode`` con el nombre que desees para tu proyecto.

source: See also the `README <https://github.com/GeoNode/geonode-project/blob/master/README.md>`_ file on geonode-project repository
es: Consulta también el archivo `README <https://github.com/GeoNode/geonode-project/blob/master/README.md>`_ en el repositorio geonode-project

source: First of all we need to prepare a new Python Virtual Environment
es: En primer lugar, debemos preparar un nuevo entorno virtual de Python.

source: Prepare the environment
es: Preparar el ambiente

source: Clone the source code
es: Clonar el código fuente

source: This will clone the ``master`` branch. You will have to checkout the desidered branch or tag. As an example, if you want to generate a propject for GeoNode 4.2.2 you will docker
es: Esto clonará la rama ``master``. Tendrás que cambiar a la rama o etiqueta deseada. Por ejemplo, si quieres generar un proyecto para GeoNode 4.2.2, debes usar el comando docker.

source: Make an instance out of the ``Django Template``
es: Haz una instancia a partir de la ``Plantilla Django``

source: We will call our instance ``my_geonode``. You can change the name at your convenience.
es: Llamaremos a nuestra instancia ``my_geonode``. Puedes cambiar el nombre a tu conveniencia.

source: Install and Configure the PostgreSQL Database System
es: Instalar y configurar el sistema de base de datos PostgreSQL

source: In this section we are going to install the ``PostgreSQL`` packages along with the ``PostGIS`` extension. Those steps must be done **only** if you don't have the DB already installed on your system.
es: En esta sección vamos a instalar los paquetes ``PostgreSQL`` junto con la extensión ``PostGIS``. Esos pasos deben realizarse **solo** si aún no tienes la base de datos instalada en tu sistema.

source: We now must create two databases, ``my_geonode`` and ``my_geonode_data``, belonging to the role ``my_geonode``.
es: Ahora debemos crear dos bases de datos, ``my_geonode`` y ``my_geonode_data``, pertenecientes al rol ``my_geonode``.

source: This is our default configuration. You can use any database or role you need. The connection parameters must be correctly configured on ``settings``, as we will see later in this section.
es: Esta es nuestra configuración predeterminada. Puedes utilizar cualquier base de datos o rol que necesites. Los parámetros de conexión deben estar correctamente configurados en ``settings``, como veremos más adelante en este apartado.

source: Databases and Permissions
es: Bases de datos y permisos

source: First, create the geonode user. GeoNode is going to use this user to access the database
es: Primero, crea el usuario del geonode. GeoNode utilizará este usuario para acceder a la base de datos.

source: You will be prompted asked to set a password for the user. **Enter geonode as password**.
es: Se te pedirá que establezcas una contraseña para el usuario. **Ingrese geonode como contraseña**.

source: This is a sample password used for the sake of simplicity. This password is very **weak** and should be changed in a production environment.
es: Esta es una contraseña de ejemplo utilizada por simplicidad. Esta contraseña es muy **débil** y debe cambiarse en un entorno de producción.

source: Create database ``my_geonode`` and ``my_geonode_data`` with owner ``my_geonode``
es: Crea la base de datos ``my_geonode`` y ``my_geonode_data`` con el propietario ``my_geonode``

source: Next let's create PostGIS extensions
es: A continuación, creemos extensiones PostGIS.

source: Final step is to change user access policies for local connections in the file ``pg_hba.conf``
es: El último paso es cambiar las políticas de acceso de usuarios para conexiones locales en el archivo ``pg_hba.conf``

source: Scroll down to the bottom of the document. We want to make local connection ``trusted`` for the default user.
es: Desplázate hasta el final del documento. Queremos que la conexión local sea "confiable" para el usuario predeterminado.

source: Make sure your configuration looks like the one below.
es: Asegúrate de que tu configuración se parezca a la siguiente.

source: If your ``PostgreSQL`` database resides on a **separate/remote machine**, you'll have to **allow** remote access to the databases in the ``/etc/postgresql/13/main/pg_hba.conf`` to the ``geonode`` user and tell PostgreSQL to **accept** non-local connections in your ``/etc/postgresql/13/main/postgresql.conf`` file
es: Si tu base de datos ``PostgreSQL`` reside en una **máquina separada/remota**, tendrás que **permitir** el acceso remoto a las bases de datos en el archivo ``/etc/postgresql/13/main/pg_hba. conf`` al usuario ``geonode`` y le dice a PostgreSQL que **acepte** conexiones no locales en el archivo ``/etc/postgresql/13/main/postgresql.conf``

source: Restart PostgreSQL to make the change effective.
es: Reinicia PostgreSQL para que el cambio sea efectivo.

source: PostgreSQL is now ready. To test the configuration, try to connect to the ``geonode`` database as ``geonode`` role.
es: PostgreSQL ya está listo. Para probar la configuración, intenta conectarte a la base de datos ``geonode`` como función ``geonode``.

source: Run GeoNode Project for the first time in DEBUG Mode
es: Ejecuta el proyecto GeoNode por primera vez en modo DEBUG

source: Be sure you have successfully completed all the steps of the section :ref:`install_dep_proj`.
es: Asegúrate de haber completado con éxito todos los pasos de la sección :ref:`install_dep_proj`.

source: This command will run both GeoNode and GeoServer locally after having prepared the Spatialite database. The server will start in ``DEBUG`` (or ``DEVELOPMENT``) mode, and it will start the following services:
es: Este comando ejecutará GeoNode y GeoServer localmente después de haber preparado la base de datos Spatialite. El servidor se iniciará en modo ``DEBUG`` (o ``DESARROLLO``) e iniciará los siguientes servicios:

source: GeoNode on ``http://localhost:8000/``
es: GeoNode en ``http://localhost:8000/``

source: GeoServer on ``http://localhost:8080/geoserver/``
es: GeoServer en ``http://localhost:8080/geoserver/``

source: This modality is beneficial to debug issues and/or develop new features, but it cannot be used on a production system.
es: Esta modalidad es beneficiosa para depurar problemas y/o desarrollar nuevas funciones, pero no se puede utilizar en un sistema de producción.

source: In case you want to start again from a clean situation, just run
es: En caso de que quieras empezar de nuevo desde una situación limpia, simplemente ejecuta

source: This will blow up completely your ``local_settings``, delete the SQLlite database and remove the GeoServer data dir.
es: Esto eliminará por completo tus ``local_settings``, borrará la base de datos SQLlite y eliminará el directorio de datos de GeoServer.

source: Once the server has finished the initialization and prints on the console the sentence ``GeoNode is now available.``, you can open a browser and go to::
es: Una vez que el servidor haya terminado la inicialización e imprima en la consola la frase ``GeoNode ya está disponible.``, puedes abrir un navegador e ir a:

source: Sign-in with::
es: Inicia sesión con:

source: From now on, everything already said for GeoNode Core (please refer to the section :ref:`configure_dbs_core` and following), applies to a GeoNode Project.
es: De ahora en adelante, todo lo ya dicho para GeoNode Core (consulta la sección :ref:`configure_dbs_core` y siguientes), se aplica a un Proyecto GeoNode.

source: **Be careful** to use the **new** paths and names everywhere:
es: **Ten cuidado** de utilizar las **nuevas** rutas y nombres en todas partes:

source: Everytime you'll find the keyword ``geonode``, you'll need to use your geonode custom name instead (in this example ``my_geonode``).
es: Cada vez que encuentres la palabra clave ``geonode``, deberás utilizar el nombre personalizado de su geonode (en este ejemplo, ``my_geonode``).

source: Everytime you'll find paths pointing to ``/opt/geonode/``, you'll need to update them to point to your custom project instead (in this example ``/opt/geonode_custom/my_geonode``).
es: Cada vez que encuentres rutas que apunten a ``/opt/geonode/``, deberás actualizarlas para que apunten a tu proyecto personalizado (en este ejemplo, ``/opt/geonode_custom/my_geonode``).

source: Before moving with this section, you should have read and clearly understood the ``INSTALLATION > GeoNode Core`` sections, and in particular the ``Docker`` one. Everything said for the GeoNode Core Vanilla applies here too, except that the Docker container names will be slightly different. As an instance if you named your project ``my_geonode``, your containers will be called:
es: Antes de continuar con esta sección, deberías haber leído y comprendido claramente las secciones ``INSTALACIÓN > GeoNode Core``, y en particular la de ``Docker``. Todo lo dicho para GeoNode Core Vanilla se aplica aquí también, excepto que los nombres de los contenedores Docker serán ligeramente diferentes. Por ejemplo, si nombraste a tu proyecto ``my_geonode``, tus contenedores se llamarán:

source: Deploy an instance of a geonode-project Django template with Docker on localhost
es: Desplegar una instancia de una plantilla Django de geonode-project con Docker en localhost.

source: Create the .env file
es: Crea el archivo .env

source: An `.env` file is requird to run the application. It can be created from the `.env.sample` either manually or with the create-envfile.py script.
es: Se requiere un archivo `.env` para ejecutar la aplicación. Se puede crear desde `.env.sample` ya sea manualmente o con el script create-envfile.py.

source: The script accepts several parameters to create the file, in detail:
es: El script acepta varios parámetros para crear el archivo, en detalle:

source: *hostname*: e.g. master.demo.geonode.org, default localhost
es: *hostname*: por ejemplo, master.demo.geonode.org, el valor predeterminado es localhost

source: *https*: (boolean), default value is False
es: *https*: (booleano), el valor predeterminado es False

source: *email*: Admin email (this is required if https is set to True since a valid email is required by Letsencrypt certbot)
es: *email*: correo electrónico del administrador (esto es obligatorio si https está configurado en True, ya que LetsEncrypt certbot requiere un correo electrónico válido)

source: *emv_type*: `prod`, `test` or `dev`. It will set the `DEBUG` variable to `False` (`prod`, `test`) or `True` (`dev`)
es: *emv_type*: `prod`, `test` o `dev`. Establecerá la variable `DEBUG` en `False` (`prod`, `test`) o `True` (`dev`)

source: *geonodepwd*: GeoNode admin password (required inside the .env)
es: *geonodepwd*: Contraseña de administrador de GeoNode (requerida dentro del .env)

source: *geoserverpwd*: Geoserver admin password (required inside the .env)
es: *geoserverpwd*: Contraseña de administrador de Geoserver (requerida dentro del .env)

source: *pgpwd*: PostgreSQL password (required inside the .env)
es: *pgpwd*: Contraseña de PostgreSQL (requerida dentro del .env)

source: *dbpwd*: GeoNode DB user password (required inside the .env)
es: *dbpwd*: Contraseña de usuario de GeoNode DB (requerida dentro del .env)

source: *geodbpwd*: Geodatabase user password (required inside the .env)
es: *geodbpwd*: Contraseña de usuario de la geodatabase (requerida dentro del .env)

source: *clientid*: Oauth2 client id (required inside the .env)
es: *clientid*: ID de cliente Oauth2 (requerido dentro del .env)

source: *clientsecret*: Oauth2 client secret (required inside the .env)
es: *clientsecret*: secreto del cliente Oauth2 (requerido dentro del .env)

source: *secret key*: Django secret key (required inside the .env)
es: *secret key*: clave secreta de Django (requerida dentro del .env)

source: *sample_file*: absolute path to a env_sample file used to create the env_file. If not provided, the one inside the GeoNode project is used.
es: *sample_file*: ruta absoluta a un archivo env_sample utilizado para crear el env_file. Si no se proporciona, se utiliza el que está dentro del proyecto GeoNode.

source: *file*: absolute path to a json file that contains all the above configuration
es: *file*: ruta absoluta a un archivo json que contiene toda la configuración anterior

source: if the same configuration is passed in the json file and as an argument, the CLI one will overwrite the one in the JSON file. If some value is not provided, a random string is used
es: Si se pasa la misma configuración en el archivo json y como argumento, la CLI sobrescribirá la del archivo JSON. Si no se proporciona algún valor, se utiliza una cadena aleatoria
