Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/creating_maps.po
Languages: es

source: Creating Maps
es: Creando mapas

source: In this section, we’ll create a *Map* using some uploaded datasets, combine them with some other datasets from remote web services, and then share the resulting map for public viewing.
es: En esta sección, crearemos un *Mapa* utilizando algunos conjuntos de datos cargados, los combinaremos con otros conjuntos de datos de servicios web remotos y luego compartiremos el mapa resultante para que lo vea el público.

source: In order to create new maps you can use:
es: Para crear nuevos mapas puedes utilizar:

source: The :guilabel:`Create map` listed after clicking the :guilabel:`Add Resource` button on the *All Resources* list page.
es: El :guilabel:`Crear mapa` aparece después de hacer clic en el botón :guilabel:`Agregar recurso` en la página de lista *Todos los recursos*.

source: *The Create Map from All Resources page*
es: *La página Crear mapa desde Todos los recursos*

source: The :guilabel:`New` button after clicking the :guilabel:`Maps` button on the menu bar.
es: El botón :guilabel:`Nuevo` después de hacer clic en el botón :guilabel:`Mapas` en la barra de menú.

source: *The Create Map from Maps page*
es: *La página Crear mapa a partir de mapas*

source: The :guilabel:`Create map` link in the *Dataset Page* (it creates a map using a specific dataset)
es: El enlace :guilabel:`Crear mapa` en la *Página de conjunto de datos* (crea un mapa usando un conjunto de datos específico)

source: *The Create map from dataset*
es: *Crear mapa a partir del conjunto de datos*

source: The new *Map* will open in a *Map Viewer* like the one in the picture below.
es: El nuevo *Mapa* se abrirá en un *Visor de mapas* como el de la imagen de abajo.

source: *The Map Viewer*
es: *El visor de mapas*

source: Using the :guilabel:`Add dataset` link, you can add a layer by clicking on one of the layers listed in the catalog. In the upper left corner the *TOC button* button opens the :ref:`toc` of the *Map*. It allows to manage all the datasets associated with the map and to add new ones from the :guilabel:`Add dataset`. The *TOC* component makes possible to manage datasets overlap on the map by shifting their relative positions in the list (drag and drop them up or down in the list). It also allows to hide/show datasets ( |show_button| and |hide_button| ), to zoom to datasets extents ( |zoom_to_dataset_extent_button| ) and to manage their properties ( |dataset_settings_button| ). Once the map datasets have been settled it is possible to save the *Map* by clicking on the :guilabel:`Save as` under the :guilabel:`Resources` link in the map toolbar.
es: Usando el enlace :guilabel:`Agregar conjunto de datos`, puedes agregar una capa haciendo clic en una de las capas enumeradas en el catálogo. En la esquina superior izquierda, el botón *TOC button* abre el :ref:`toc` del *Mapa*. Permite gestionar todos los conjuntos de datos asociados al mapa y añadir nuevos desde el :guilabel:`Añadir conjunto de datos`. El componente *TOC* hace posible gestionar la superposición de conjuntos de datos en el mapa cambiando sus posiciones relativas en la lista (arrastrarlos y soltarlos hacia arriba o hacia abajo en la lista). También permite ocultar/mostrar conjuntos de datos ( |show_button| y |hide_button| ), hacer zoom a las extensiones de los conjuntos de datos ( |zoom_to_dataset_extent_button| ) y administrar sus propiedades ( |dataset_settings_button| ). Una vez que se hayan establecido los conjuntos de datos del mapa, es posible guardar el *Mapa* haciendo clic en :guilabel:`Guardar como` bajo el enlace :guilabel:`Recursos` en la barra de herramientas del mapa.

source: If you followed the steps above, you have just created your first *Map*. Now you should see it in the *Explore Maps* page, see :ref:`map-info` for further details.
es: Si seguiste los pasos anteriores, acabas de crear tu primer *Mapa*. Ahora deberías verlo en la página *Explorar mapas*; consulta :ref:`map-info` para obtener más detalles.

source: We will take a closer look at the *Map Viewer* tools in the :ref:`exploring-maps` section.
es: Echaremos un vistazo más de cerca a las herramientas *Visor de mapas* en la sección :ref:`exploring-maps`.
