Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/map_metadata.po
Languages: es

source: Maps Metadata
es: Metadatos de mapas

source: *Maps Metadata* can be Edited by clicking the :guilabel:`Edit Metadata` link from the *Map Detail* page.
es: *Los metadatos de mapas* se pueden editar haciendo clic en el enlace :guilabel:`Editar metadatos` desde la página *Detalles del mapa*.

source: *The Map Metadata Detail link*
es: *El enlace Detalles de metadatos del mapa*

source: The *Map Metadata* Edit form will open. | Metadata provide essential information for the identification and the comprehension of the map. They also make the map more easily retrievable through the search tools. | Those *Metadata* can be filled out through three-steps in which you have to provide all mandatory information to complete the process. Those three steps are described below.
es: Se abrirá el formulario de edición de *Metadatos del mapa*. | Los metadatos proporcionan información esencial para la identificación y la comprensión del mapa. También hacen que el mapa sea más fácil de recuperar a través de las herramientas de búsqueda. | Esos *Metadatos* se pueden completar a través de tres pasos en los que debe proporcionar toda la información obligatoria para completar el proceso. Esos tres pasos se describen a continuación.

source: **Basic Metadata**
es: **Metadatos básicos**

source: *Basic Map Metadata*
es: *Metadatos básicos del mapa*

source: In the first step the system asks you to insert the following metadata (required fields are highlighted with red outlines):
es: En el primer paso, el sistema le solicita que inserte los siguientes metadatos (los campos obligatorios están resaltados con contornos rojos):

source: *Thumbnail* of the map (click :guilabel:`Edit` to change it);
es: *Miniatura* del mapa (haga clic en :guilabel:`Editar` para cambiarlo);

source: *Title* of the map, which should be clear and understandable;
es: *Título* del mapa, que debe ser claro y comprensible;

source: *Abstract*; brief narrative summary of the content of the Map
es: *Resumen*; breve resumen narrativo del contenido del Mapa

source: The *Abstract* panel allows you to insert HTML code through a *wysiwyg* text editor
es: El panel *Resumen* le permite insertar código HTML a través de un editor de texto *wysiwyg*

source: *Creation/Publication/Revision Dates* which define the time period that is covered by the map;
es: *Fechas de creación/publicación/revisión* que definen el período de tiempo que cubre el mapa;

source: *Keywords*, which should be chosen within the available list;
es: *Palabras clave*, que deberán ser elegidas dentro de la lista disponible;

source: *Category* which the map belongs to;
es: *Categoría* a la que pertenece el mapa;

source: *Group* which the map is linked to.
es: *Grupo* al que está vinculado el mapa.

source: Click :guilabel:`Next >>` to go to the next step.
es: Haga clic en :guilabel:`Siguiente >>` para ir al siguiente paso.

source: **Location and Licenses**
es: **Ubicación y Licencias**

source: *Location and Licenses Metadata for Maps*
es: *Metadatos de ubicación y licencias para mapas*

source: The following list shows what kinds of metadata you are required to enter (see also the picture below):
es: La siguiente lista muestra qué tipos de metadatos debe ingresar (consulte también la imagen a continuación):

source: *Language* of the layer;
es: *Idioma* de la capa;

source: *License* of the dataset;
es: *Licencia* del conjunto de datos;

source: *Regions* covered by the layers extent. Proposed extents cover the following scales: global, continental, regional, national;
es: *Regiones* cubiertas por la extensión de las capas. Los alcances propuestos cubren las siguientes escalas: global, continental, regional, nacional;

source: *Data Quality statement* (general explanation of the data producer's knowledge about the lineage of a dataset);
es: *Declaración de calidad de datos* (explicación general del conocimiento del productor de datos sobre el linaje de un conjunto de datos);

source: Potential *Restrictions* on layer sharing.
es: Posibles *Restricciones* al compartir capas.

source: No further mandatory metadata are required in the next step so, once the required fields have been filled out, a green :guilabel:`Done` button will be visible in the screen. Click :guilabel:`Next >>` to go to the next step or :guilabel:`<< Back` to go back to the previous step.
es: No se requieren más metadatos obligatorios en el siguiente paso, por lo que, una vez que se hayan completado los campos obligatorios, aparecerá un botón verde :guilabel:`Listo` en la pantalla. Haga clic en :guilabel:`Siguiente >>` para ir al siguiente paso o en :guilabel:`<< Atrás` para volver al paso anterior.

source: **Optional Metadata**
es: **Metadatos opcionales**

source: *Optional Map Metadata*
es: *Metadatos de mapa opcionales*

source: Complementary information are:
es: La información complementaria es:

source: *Edition* of the map;
es: *Edición* del mapa;

source: *Purpose* of the map and its objectives;
es: *Propósito* del mapa y sus objetivos;

source: *Supplemental information* that can provide a better understanding of the map;
es: *Información complementaria* que puede proporcionar una mejor comprensión del mapa;

source: *Maintenance frequency* of the map;
es: *Frecuencia de mantenimiento* del mapa;

source: *Spatial representation type*, the method used to represent geographic information in the dataset;
es: *Tipo de representación espacial*, el método utilizado para representar información geográfica en el conjunto de datos;

source: Users who are *Responsible* for the layer, its *Owner*, and the *Author* of its metadata;
es: Usuarios que son *Responsables* de la capa, su *Propietario* y el *Autor* de sus metadatos;

source: *Related resources* to link one or multiple resources to the document. These will be visible inside the :ref:`map-info` panel
es: *Recursos relacionados* para vincular uno o varios recursos al documento. Estos serán visibles dentro del panel :ref:`map-info`

source: If you miss some mandatory metadata the *Completeness* bar shows you a red message like the one in the picture below.
es: Si omite algunos metadatos obligatorios, la barra *Integridad* le muestra un mensaje rojo como el de la imagen a continuación.

source: *Completeness Progress Bar*
es: *Barra de progreso de integridad*

source: Metadata Advanced Editing
es: Edición avanzada de metadatos

source: The :guilabel:`Advanced Metadata` editing button in the Metadata Edit form allows to change the map metadata.
es: El botón de edición :guilabel:`Metadatos Avanzados` en el formulario de Edición de Metadatos permite cambiar los metadatos del mapa.

source: *The Advanced Edit button*
es: *El botón Edición avanzada*

source: Click on it to display the *Metadata Advanced Editing Page*. That page allows you to edit all the map metadata described in the previous paragraph.
es: Haga clic en él para mostrar la *Página de edición avanzada de metadatos*. Esa página le permite editar todos los metadatos del mapa descritos en el párrafo anterior.

source: Once you have finished to edit them click on :guilabel:`Update` to save your changes.
es: Una vez que hayas terminado de editarlos haz clic en :guilabel:`Actualizar` para guardar los cambios.
