Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/managing_maps/map_info.po
Languages: es

source: Map Information
es: Información del mapa

source: From the *Map Search Page* (see :ref:`finding-data`) you can select the map you are interested in and click on its name to see an overview about it.
es: Desde la *Página de búsqueda de mapas* (ver :ref:`finding-data`) puede seleccionar el mapa que le interesa y hacer clic en su nombre para ver una descripción general del mismo.

source: The information panel reports:
es: El panel informativo informa:

source: The *Info* tab is active by default. This tab section shows some map metadata such as its title, the abstract, date of publication etc. The metadata also indicates the map owner, what are the topic categories the map belongs to and which regions are affected.
es: La pestaña *Info* está activa de forma predeterminada. Esta sección de pestaña muestra algunos metadatos del mapa, como su título, resumen, fecha de publicación, etc. Los metadatos también indican el propietario del mapa, cuáles son las categorías de temas a las que pertenece el mapa y qué regiones están afectadas.

source: *Map Info tab*
es: *Pestaña Información del mapa*

source: The *Location* tab shows the spacial extent of the map.
es: La pestaña *Ubicación* muestra la extensión espacial del mapa.

source: *Map Location tab*
es: *Pestaña Ubicación en el mapa*

source: By clicking on the copy icons you have a copy of the current *Bounding Box* or the *Center* in the clipboard which once pasted will be a WKT text.
es: Al hacer clic en los iconos de copia, tendrá una copia del *Cuadro delimitador* actual o del *Centro* en el portapapeles que, una vez pegado, será un texto WKT.

source: *Bounding Box and Center*
es: *Cuadro delimitador y centro*

source: The *Linked Resources* tab shows resources, that can be *Documents*, *Datasets*, *GeoStories* and *Dashboards*, linked to the map.
es: La pestaña *Recursos vinculados* muestra recursos, que pueden ser *Documentos*, *Conjuntos de datos*, *GeoHistorias* y *Paneles*, vinculados al mapa.

source: *Map Linked Resources tab*
es: *Pestaña Recursos vinculados al mapa*

source: When a resource is `linked from` the map the link is shown under the *Linked by* list while when a resource is `linked to` the map the link is shown under the *Used by* list
es: Cuando un recurso está "vinculado desde" el mapa, el enlace se muestra en la lista *Vinculado por*, mientras que cuando un recurso está "vinculado" en el mapa, el enlace se muestra en la lista *Usado por*

source: From the right toolbar on the **Info** panel it is possible:
es: Desde la barra de herramientas derecha en el panel **Información** es posible:

source: *Map Info toolbar*
es: *Barra de herramientas de información del mapa*

source: Add map in your *Favorites* (see :ref:`editing-profile`), clicking on star icon.
es: Añadir el mapa a tus *Favoritos* (ver :ref:`editing-profile`), haciendo clic en el icono de estrella.

source: *Share* the map url
es: *Compartir* la URL del mapa

source: Change the map *Title* by clicking on it
es: Cambiar el *Título* del mapa haciendo clic en él

source: You can access the map details page by clicking on *View map* in the overview panel. That page looks like the one shown in the picture below.
es: Puedes acceder a la página de detalles del mapa haciendo clic en *Ver mapa* en el panel de descripción general. Esa página se parece a la que se muestra en la imagen a continuación.

source: *Map page*
es: *Página del mapa*

source: The *Map Viewer* shows the map with very basic functionalities:
es: El *Visor de mapas* muestra el mapa con funcionalidades muy básicas:

source: the *Base Map Switcher* that allows you to change the base map;
es: el *Cambiador de Mapas Base* que te permite cambiar el mapa base;

source: the *Zoom in/out* tool to enlarge and decrease the view;
es: la herramienta *Acercar/alejar* para ampliar y disminuir la vista;

source: the *Zoom to max extent* tool for the zoom to fit the datasets extents;
es: la herramienta *Acercar al máximo* para que el zoom se ajuste a la extensión del conjunto de datos;

source: the *Query Objects* tool to retrieve information about the map objects by clicking on the map;
es: la herramienta *Consultar Objetos* para recuperar información sobre los objetos del mapa haciendo clic en el mapa;

source: the *Print* tool to print the preview.
es: la herramienta *Imprimir* para imprimir la vista previa.

source: the *Measure* tool to measure Distances, Areas and the Bearing of lines.
es: la herramienta *Medir* para medir distancias, áreas y rumbo de líneas.

source: the *Annotations* tool to add an annotation to the map
es: la herramienta *Anotaciones* para agregar una anotación al mapa
