Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/extra_metadata/api.po
Languages: es

source: Rest API
es: API Rest

source: The `api/v2/resources` endpoint provide different ways to handle the metadata.
es: El punto final `api/v2/resources` proporciona diferentes formas de manejar los metadatos.

source: Get the metadata list of the selected resource
es: Obtener la lista de metadatos del recurso seleccionado

source: Adding new metadata to the resource
es: Agregar nuevos metadatos al recurso

source: Update specific metadata for the selected resource. In this case the metadata **ID** is required to perform the update
es: Actualizar metadatos específicos para el recurso seleccionado. En este caso, se requiere el **ID** de metadatos para realizar la actualización

source: Delete the metadata for a given resource by *ID*.
es: Eliminar los metadatos de un recurso determinado por *ID*.

source: **API search**
es: **Búsqueda API**

source: Is possible to search for resources with specific metadata. This feature is available for both API v1 and API v2
es: Es posible buscar recursos con metadatos específicos. Esta función está disponible tanto para API v1 como para API v2

source: To perform the search is enough to add as query parameters the field of the metadata payload.
es: Para realizar la búsqueda basta con agregar como parámetro de consulta el campo de la carga útil de metadatos.

source: Assuming that the payload is the same as the example above, the URL could be something like the following:
es: Suponiendo que la carga útil es la misma que en el ejemplo anterior, la URL podría ser similar a la siguiente:

source: In this way, we can retrieve all the resources that have at least 1 metadata with the `field_category = 'bike'`
es: De esta forma podremos recuperar todos los recursos que tengan al menos 1 metadato con el `field_category='bike'`

source: For the API v2 is a bit different since the library doesnt have a support for the JSON field.
es: Para la API v2 es un poco diferente ya que la biblioteca no admite el campo JSON.

source: To reproduce the same search above, we need to call a URL like the following one:
es: Para reproducir la misma búsqueda anterior, necesitamos llamar a una URL como la siguiente:
