Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/extra_metadata/edit.po
Languages: es

source: Metadata manipulation
es: Manipulación de metadatos

source: There are two possible ways to manipulate extra metadata in geonode:
es: Hay dos formas posibles de manipular metadatos adicionales en GeoNode:

source: via Metadata Editor (Wizard and advanced)
es: a través del Editor de metadatos (asistente y avanzado)

source: via Rest API
es: a través de la API Rest

source: Metadata Editor (wizard/advanced):
es: Editor de metadatos (asistente/avanzado):

source: The metadata section is placed under the OPTIONAL METADATA section available for all the GeoNode resources.
es: La sección de metadatos se coloca debajo de la sección METADATOS OPCIONALES disponible para todos los recursos de GeoNode.

source: The metadata must follow two specific rules to save to the resource:
es: Los metadatos deben seguir dos reglas específicas para guardarse en el recurso:

source: Must always be a list of JSON. This permits to add of more than one metadata for each resource
es: Siempre debe ser una lista de JSON. Esto permite agregar más de un metadato para cada recurso

source: The JSON must follow the schema defined in the `settings.py` for the selected resource.
es: El JSON debe seguir el esquema definido en `settings.py` para el recurso seleccionado.

source: For example, for my document resource, I can have something like the following:
es: Por ejemplo, para mi recurso de documentos, puedo tener algo como lo siguiente:

source: *Advanced edit wizard menù*
es: *Menú del asistente de edición avanzada*

source: After pressing the save button, the system will perform the following checks:
es: Después de presionar el botón guardar, el sistema realizará las siguientes comprobaciones:

source: Check if the text provided is a valid JSON. In case of wrong format input, the following error is shown:
es: Comprueba si el texto proporcionado es un JSON válido. En caso de entrada de formato incorrecto, se muestra el siguiente error:

source: *invalid JSON error*
es: *error JSON no válido*

source: Check if the metadata schema is provided for the resource if not will raise the following error
es: Comprueba si se proporciona el esquema de metadatos para el recurso; de lo contrario, se generará el siguiente error

source: *missing schema error*
es: *falta error de esquema*

source: Check if the metadata schema is coherent with the schema defined in the settings. In case of wrong format input, the error will print the missing JSON keys
es: Comprueba si el esquema de metadatos es coherente con el esquema definido en la configuración. En caso de entrada de formato incorrecto, el error imprimirá las claves JSON que faltan

source: *invalid schema error*
es: *error de esquema no válido*

source: Facet Filtering
es: Filtrado de facetas

source: Automatically the web interface will create dynamically the facets if there is at least 1 metadata defined for the resource.
es: Automáticamente, la interfaz web creará dinámicamente las facetas si hay al menos 1 metadato definido para el recurso.

source: Suppose that a resource heve the following metadata:
es: Supongamos que un recurso tiene los siguientes metadatos:

source: By default GeoNode will convert this metadata info in facets available for the resource
es: De forma predeterminada, GeoNode convertirá esta información de metadatos en facetas disponibles para el recurso

source: The facet will convert:
es: La faceta convertirá:

source: `filter_header`: used as the header filter
es: `filter_header`: utilizado como filtro de encabezado

source: `field_value`: used to perform the search
es: `field_value`: utilizado para realizar la búsqueda

source: `field_name`: used for calculate the unique values (along with `field_value`)
es: `field_name`: utilizado para calcular los valores únicos (junto con `field_value`)

source: After says that, the facet will be the follow:
es: Después de dicho eso, la faceta será la siguiente:
