Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/usage/extra_metadata/settings.po
Languages: es

source: Settings
es: Ajustes

source: Three main settings control the extra metadata field:
es: Tres configuraciones principales controlan el campo de metadatos adicionales:

source: DEFAULT_EXTRA_METADATA_SCHEMA: define the schema used to store the metadata
es: DEFAULT_EXTRA_METADATA_SCHEMA: define el esquema utilizado para almacenar los metadatos

source: `id`: (optional int): the identifier of the metadata. Optional for creation, required in the Upgrade phase
es: `id`: (int opcional): el identificador de los metadatos. Opcional para la creación, requerido en la fase de Actualización

source: `filter_header`: (required object): Can be any type, is used to generate the facet filter header. Is also an identifier.
es: `filter_header`: (objeto obligatorio): puede ser de cualquier tipo, se utiliza para generar el encabezado del filtro de facetas. También es un identificador.

source: `field_name`: (required object): name of the metadata field
es: `field_name`: (objeto requerido): nombre del campo de metadatos

source: `field_label`: (required object): a verbose string of the name. Is used as a label in the facet filters.
es: `field_label`: (objeto requerido): una cadena detallada del nombre. Se utiliza como etiqueta en los filtros de facetas.

source: `field_value`: (required object): metadata values
es: `field_value`: (objeto requerido): valores de metadatos

source: An example of metadata that can be ingested is the following:
es: Un ejemplo de metadatos que se pueden ingerir es el siguiente:

source: The above schema is valid by using the `schema` <https://github.com/keleshev/schema>
es: El esquema anterior es válido utilizando el `schema` <https://github.com/keleshev/schema>

source: CUSTOM_METADATA_SCHEMA: environment variable used to inject additional schema to the default one. Helpful for third-party libraries
es: CUSTOM_METADATA_SCHEMA: variable de entorno utilizada para inyectar un esquema adicional al predeterminado. Útil para bibliotecas de terceros

source: EXTRA_METADATA_SCHEMA: used to get the expected metadata schema for each resource_type.
es: EXTRA_METADATA_SCHEMA: se utiliza para obtener el esquema de metadatos esperado para cada tipo de recurso.
