Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/basic/permissions/index.po
Languages: es

source: Permissions
es: Permisos

source: Permissions in GeoNode are set per resource, where a resource can be a dataset, a map, a document, a service or a geoapp. The way the permissions are set is the same for all of them.
es: Los permisos en GeoNode se configuran por recurso, donde un recurso puede ser un conjunto de datos, un mapa, un documento, un servicio o una geoapp. La forma en que se configuran los permisos es la misma para todos ellos.

source: GeoNode has a set of default permissions that are applied on resource creation **when** you don't explicitly declare them. This is particularly relevant when creating and saving a map, where you won't have the possibility to set the its permissions during the creation phase. GeoNode can be tuned to make sure that by default the new created resource are not public, this can be done by changing two settings, see `Default view permissions <../settings/index.html#default-anonymous-view-permission>`_ and `Default download permissions <../settings/index.html#default-anonymous-download-permission>`_
es: GeoNode tiene un conjunto de permisos predeterminados que se aplican en la creación de recursos **cuando** no los declaras explícitamente. Esto es particularmente relevante al crear y guardar un mapa, donde no tendrás la posibilidad de configurar sus permisos durante la fase de creación. GeoNode se puede ajustar para asegurarse de que, de manera predeterminada, los nuevos recursos creados no sean públicos. Esto se puede hacer modificando dos configuraciones; consulta `Permisos de visualización predeterminados <../settings/index.html#default-anonymous-view-permission>`_ y `Permisos de descarga predeterminados <../settings/index.html#default-anonymous-download-permission>`_

source: Single Resource permissions
es: Permisos de recurso único

source: Resource permissions can be generally set from the *resource detail* page. The detail page has a menu item *Share* which is visible to people who are permitted to set permissions on a resource.
es: Los permisos de los recursos se pueden configurar en general desde la página de *detalles del recurso*. La página de detalles tiene un elemento de menú *Compartir* que es visible para las personas que tienen permiso para configurar permisos sobre un recurso.

source: The share link opens a page on the right with a provision to edit user and group permissions on the resource. see picture below
es: El enlace para compartir abre una página a la derecha con una disposición para editar los permisos de usuario y grupo en el recurso. Ver imagen a continuación

source: *Change Dataset Permissions*
es: *Cambiar permisos del conjunto de datos*

source: The page for setting the permissions, allows addition of users/groups and selection of a permission to assign each of them.
es: La página para configurar los permisos, permite agregar usuarios/grupos y seleccionar un permiso para asignar a cada uno de ellos.

source: *Resource Permission Dialogue*
es: *Diálogo de permiso de recursos*

source: You can set the following types of permissions:
es: Puede configurar los siguientes tipos de permisos:

source: *View:* allows to view the resource;
es: *View:* permite ver el recurso;

source: *Download* allows to download the resource;
es: *Descargar* permite descargar el recurso;

source: *Edit:* allows to change attributes, properties of the datasets features, styles and metadata for the specified resource;
es: *Edición:* permite cambiar atributos, propiedades de las características, estilos y metadatos del conjunto de datos para el recurso especificado;

source: *Manage:* allows to update, delete, change permissions, publish and unpublish the resource.
es: *Administrar:* permite actualizar, eliminar, cambiar permisos, publicar y anular la publicación del recurso.

source: When assigning permissions to a group, all the group members will have those permissions. Be careful in case of editing permissions.
es: Al asignar permisos a un grupo, todos los miembros del grupo tendrán esos permisos. Tenga cuidado en caso de permisos de edición.

source: Geo Limits permissions
es: Permisos de límites geográficos

source: This feature is available **only** when enabling ```GeoServer``` as geospatial backend. Also make sure that the properties ```GEONODE_SECURITY_ENABLED```, ```GEOFENCE_SECURITY_ENABLED``` and ```GEOFENCE_URL``` are correctly set for the ```OGC_SERVER```.
es: Esta función está disponible **solo** cuando se habilita ```GeoServer``` como backend geoespacial. Asegúrese también de que las propiedades ```GEONODE_SECURITY_ENABLED```, ```GEOFENCE_SECURITY_ENABLED``` y ```GEOFENCE_URL``` estén configuradas correctamente para ```OGC_SERVER```.

source: :guilabel:`Geo Limits` are an extension of the GeoNode standard permissions. :guilabel:`Geo Limits` allows the owner of the resource, or the administrator, to restrict users or groups to a specific geographical area, in order to limit the access to the dataset to only the portions contained within that geographic restriction, excluding data outside of it.
es: :guilabel:`Geo Limits` son una extensión de los permisos estándar de GeoNode. :guilabel:`Geo Limits` permite al propietario del recurso, o al administrador, restringir usuarios o grupos a un área geográfica específica, con el fin de limitar el acceso al conjunto de datos solo a las partes contenidas dentro de esa restricción geográfica, excluyendo los datos fuera de ella.

source: In order to be able to set :guilabel:`Geo Limits` you must be an ```administrator``` of the system or the ```owner``` of the resource or you must have ```Manage Permissions``` rights to the resource.
es: Para poder establecer :guilabel:`Geo Limits`, debe ser un ```administrador``` del sistema o el ```propietario``` del recurso o debe tener derechos de ```Administrar permisos``` para el recurso.

source: If you have the permissions to set the :guilabel:`Geo Limits`, you should be able to see the permissions section and the globe icon on each user or group.
es: Si tienes los permisos para establecer los :guilabel:`Geo Limits`, deberías poder ver la sección de permisos y el ícono del globo en cada usuario o grupo.

source: *Geo Limits Icon*
es: *Icono de Geo Limits*

source: You should be able to see an interactive preview of the resource along with few small drawing tools, that allows you to start creating limits on the map manually if you want.
es: Deberías poder ver una vista previa interactiva del recurso junto con algunas pequeñas herramientas de dibujo, que te permiten comenzar a crear límites en el mapa manualmente si lo deseas.

source: This opens a map dialog, with 3 options at the top:
es: Esto abre un cuadro de diálogo de mapa, con 3 opciones en la parte superior:

source: *Geo Limits: Preview Window with Drawing Tools*
es: *Geo Limits: ventana de vista previa con herramientas de dibujo*

source: The |edit_icon| icon allows you to draw limits on a map for which a user will be able to see. Click on it to start drawing on the map. Once you are done drawing, click on it again to deactivate drawing mode.
es: El icono |edit_icon| permite dibujar límites en un mapa que el usuario podrá ver. Haz clic en él para comenzar a dibujar en el mapa. Una vez que hayas terminado de dibujar, haz clic en él nuevamente para desactivar el modo de dibujo.

source: The |delete_icon| icon enables you to remove the limits you have drawn. Click on the limit drawn, and then click the delete icon.
es: El icono |delete_icon| te permite eliminar los límites que has dibujado. Haz clic en el límite dibujado y, a continuación, haga clic en el icono de eliminar.

source: The |refresh_icon| icon removes all changes that are not saved.
es: El icono |refresh_icon| elimina todos los cambios que no se guardan.

source: *Geo Limits: Editing the Geometries*
es: *Geo Limits: Edición de geometrías*

source: Once you finished editing your geometries, save them into the DB using the *Save* link in the resource menu.
es: Una vez que hayas terminado de editar las geometrías, guárdalas en la base de datos utilizando el enlace *Guardar* en el menú de recursos.

source: The user with the specified geometries won't be able from now on to access the whole dataset data.
es: El usuario con las geometrías especificadas a partir de ahora no podrá acceder a todo el conjunto de datos.

source: *Geo Limits: Geospatial restrictions applies for the user*
es: *Geo Limits: Se aplican restricciones geoespaciales para el usuario*

source: The :guilabel:`Geo Limits` will be persisted on GeoNode DB for that resource. That means that everytime you will update the general permissions, also the geospatial restrictions will be applied.
es: El campo :guilabel:`Geo Limits` se guardará en la base de datos de GeoNode para ese recurso. Esto significa que cada vez que actualices los permisos generales, también se aplicarán las restricciones geoespaciales.

source: In order to remove the :guilabel:`Geo Limits` for a certain user or group, you can just :guilabel:`Save` an **empty geometry**. This will **delete** the entry from the DB also.
es: Para eliminar los :guilabel:`Geo Limits` de un usuario o grupo específico, simplemente puedes :guilabel:`Guardar` una **geometría vacía**. Esto **borrará** la entrada de la base de datos también.
