Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/upgrade/3.x-to-4.x/index.po
Languages: es

source: Upgrade Process from GeoNode 3.x to 4.x
es: Proceso de actualización de GeoNode 3.x a 4.x

source: The purpose of this document is to detail the process that we will implement to upgrade GeoNode from version 3.x to version 4.x. This document is proposed to ensure that the upgrade process is efficient and understandable for everyone. It is important to note that this guide is specifically for a GeoNode installation running on Docker.
es: El propósito de este documento es detallar el proceso que implementaremos para actualizar GeoNode de la versión 3.x a la versión 4.x. Este documento se propone para asegurar que el proceso de actualización sea eficiente y comprensible para todos. Es importante señalar que esta guía es específicamente para una instalación de GeoNode que se ejecuta en Docker.

source: The objective of this document is for everyone to understand the processes and steps necessary to carry out the migration.
es: El objetivo de este documento es que todos comprendan los procesos y pasos necesarios para llevar a cabo la migración.

source: Table of Contents
es: Tabla de contenidos

source: Migration Procedure
es: Procedimiento de migración

source: Possible Issues
es: Posibles problemas

source: Version Migration Procedure
es: Procedimiento de migración de versión

source: 1. Download the New Version
es: 1. Descargue la nueva versión

source: With the following command, we will download the new version of GeoNode from the official source or the corresponding repository:
es: Con el siguiente comando, descargaremos la nueva versión de GeoNode desde la fuente oficial o el repositorio correspondiente:

source: **Note:** Replace <branch-or-tag> with the appropriate branch or tag for the version you wish to install.
es: **Nota:** Reemplaza <branch-or-tag> con la rama o etiqueta apropiada para la versión que deseas instalar.

source: It is recommended to do this in a separate directory to keep the previous version intact in case of need.
es: Se recomienda hacer esto en un directorio separado para mantener intacta la versión anterior en caso de necesidad.

source: Directory of the previous version:
es: Directorio de la versión anterior:

source: Directory of the new version:
es: Directorio de la nueva versión:

source: 2. Stop the Current GeoNode
es: 2. Detener el GeoNodo actual

source: Run the following command in the directory where the current GeoNode is deployed to stop the associated Docker containers:
es: Ejecuta el siguiente comando en el directorio donde está desplegado el GeoNode actual para detener los contenedores Docker asociados:

source: 3. Modify the GeoNode .env File
es: 3. Modifique el archivo GeoNode .env

source: Open the ``.env`` file of the new GeoNode in a text editor:
es: Abra el archivo ``.env`` del nuevo GeoNode en un editor de texto:

source: Adjust the environment variables to match the configuration of the previous GeoNode version. This may include variables related to the database, URLs, ports, etc.
es: Ajusta las variables de entorno para que coincidan con la configuración de la versión anterior de GeoNode. Esto puede incluir variables relacionadas con la base de datos, URLs, puertos, etc.

source: 4. Start the GeoNode Containers
es: 4. Inicie los contenedores GeoNode

source: Once you have made the necessary changes to the ``.env`` file, run the following command to start the GeoNode containers in the new version:
es: Una vez que hayas realizado los cambios necesarios en el archivo ``.env``, ejecuta el siguiente comando para iniciar los contenedores de GeoNode en la nueva versión:

source: The version upgrade of GeoNode also involves changes in some of its components, which can generate various issues. Below, we list some common problems and their possible solutions:
es: La actualización de versión de GeoNode también implica cambios en algunos de sus componentes, lo que puede generar varios problemas. A continuación, enumeramos algunos problemas comunes y sus posibles soluciones:

source: PostgreSQL Container in Constant Restart
es: Contenedor PostgreSQL en reinicio constante

source: **Logs:**
es: **Registros:**

source: **Cause:** The PostgreSQL version of the original GeoNode was lower than the current one.
es: **Causa:** La versión de PostgreSQL del GeoNode original era inferior a la actual.

source: **Solution:** Downgrade the PostgreSQL version to match the previously installed version in the GeoNode ``docker-compose.yml`` file.
es: **Solución:** Baja la versión de PostgreSQL para que coincida con la versión previamente instalada en el archivo ``docker-compose.yml`` de GeoNode.

source: Nginx Container in Constant Restart
es: Contenedor Nginx en reinicio constante

source: **Cause:** Nginx is having issues replacing the port variables from the ``nginx.conf.envsubst`` file.
es: **Causa**: Nginx tiene problemas para reemplazar las variables de puerto del archivo ``nginx.conf.envsubst``.

source: **Solution:** Manually replace those variables with the corresponding ports once in the ``nginx.conf.envsubst`` file. After this, Nginx should work correctly and replace the variables normally in the future.
es: **Solución:** Reemplaza manualmente esas variables con los puertos correspondientes una vez en el archivo ``nginx.conf.envsubst``. Después de esto, Nginx debería funcionar correctamente y reemplazar las variables normalmente en el futuro.
