Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/mgmt_commands/index.po
Languages: es

source: Management command job status with a traceback message.
es: Estado del trabajo de comando de administración con un mensaje de traceback.

source: *Example job traceback message*
es: *Ejemplo de mensaje de seguimiento de trabajo*

source: Manage using API endpoints
es: Administrar mediante puntos finales de API

source: The execution of the management commands can be handled by http requests to an API: ``http://<your_geonode_host>/api/v2/management/``.
es: La ejecución de los comandos de gestión se puede gestionar mediante solicitudes http a una API: ``http://<your_geonode_host>/api/v2/management/``.

source: All the requests need to be authenticated with administrative permissions (*superuser*).
es: Todas las solicitudes deben ser autenticadas con permisos administrativos (*superusuario*).

source: You can find here a postman collection with all the exemples listed here and other available endpoints:
es: Puedes encontrar aquí una colección de Postman con todos los ejemplos listados aquí y otros endpoints disponibles:

source: List exposed commands
es: Lista de comandos expuestos

source: Getting a list of the exposed commands:
es: Obtener una lista de los comandos expuestos:

source: Response:
es: Respuesta:

source: You should change the header ``Authorization`` (``Basic YWRtaW46YWRtaW4=``) to your Auth token, in this example I am using a token for ``admin`` as username and ``admin`` as password.
es: Debes cambiar el encabezado ```Authorization`` (``Basic YWRtaW46YWRtaW4=``) a tu token de autenticación, en este ejemplo estoy usando un token para ``admin`` como nombre de usuario y ``admin`` como contraseña.

source: Optionally, before creating the job you can get its *help message* with the following call:
es: Opcionalmente, antes de crear el trabajo puedes obtener tu *mensaje de ayuda* con la siguiente llamada:

source: Creating a job for running ``ping_mngmt_commands_http`` with 30 seconds of sleep time:
es: Creación de un trabajo para ejecutar ``ping_mngmt_commands_http`` con 30 segundos de tiempo de suspensión:

source: Alterantively you can omit the ``jobs`` part of the url to create a job. (Using ``http://<your_geonode_host>/api/v2/management/commands/ping_mngmt_commands_http/`` as url)
es: Alternativamente, puedes omitir la parte ``jobs`` de la URL para crear un trabajo. (Utilice ``http://<your_geonode_host>/api/v2/management/commands/ping_mngmt_commands_http/`` como URL)

source: Start/Stop actions
es: Acciones Start/Stop

source: To start the created job:
es: Para iniciar el trabajo creado:

source: During execution the job can be interrupted using the following call:
es: Durante la ejecución, el trabajo se puede interrumpir mediante la siguiente llamada:

source: Note that the status changed from **CREATED** to **QUEUED**, during execution it will be **STARTED** and at the end **FINISHED**.
es: Tenga en cuenta que el estado cambió de **CREATED** a **QUEUED**, durante la ejecución será **STARTED** y al final **FINISHED**.

source: Jobs list and status
es: Listado de trabajos y estado

source: You can verify your job status and details with the following call:
es: Puedes verificar tu estado y detalles laborales con la siguiente llamada:

source: When runing multiple jobs and to audit already ran jobs. A list of jobs can be retrieved using the following call:
es: Al ejecutar varios trabajos y auditar los trabajos ya ejecutados, se puede recuperar una lista de trabajos mediante la siguiente llamada:

source: This list can be filtered by the fields "celery_result_id", "command", "app_name", "status", "user" and "user__username".
es: Esta lista se puede filtrar por los campos "celery_result_id", "command", "app_name", "status", "user" y "user__username".
