Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/mgmt_commands/index.po
Languages: es

source: Your first step will be to create a user. There are three options to do so, depending on which kind of user you want to create you may choose a different option. We will start with creating a *superuser*, because this user is the most important. A superuser has all the permissions without explicitly assigning them.
es: Tu primer paso será crear un usuario. Existen tres opciones para hacerlo, dependiendo del tipo de usuario que quieras crear puedes elegir una opción diferente. Comenzaremos creando un *superusuario*, ya que este usuario es el más importante. Un superusuario tiene todos los permisos sin necesidad de asignarlos explícitamente.

source: The easiest way to create a superuser (in linux) is to open your terminal and type:
es: La forma más fácil de crear un superusuario (en Linux) es abrir su terminal y escribir:

source: You will be asked a username (in this tutorial we will call the superuser you now create *your_superuser*), an email address and a password.
es: Se te pedirá un nombre de usuario (en este tutorial llamaremos al superusuario que ahora cree *su_superusuario*), una dirección de correo electrónico y una contraseña.

source: Now you've created a superuser you should become familiar with the *Django Admin Interface*. As a superuser you are having access to this interface, where you can manage users, Datasets, permission and more. To learn more detailed about this interface check this LINK. For now it will be enough to just follow the steps. To attend the *Django Admin Interface*, go to your geonode website and *sign in* with *your_superuser*. Once you've logged in, the name of your user will appear on the top right. Click on it and the following menu will show up:
es: Ahora que has creado un superusuario, deberías familiarizarte con la *Interfaz de administración de Django*. Como superusuario, tienes acceso a esta interfaz, donde puedes administrar usuarios, conjuntos de datos, permisos y más. Por ahora, será suficiente con seguir los pasos. Para acceder a la *Interfaz de administración de Django*, ve al sitio web de tu GeoNode e *inicia sesión* con *tu_superusuario*. Una vez que hayas iniciado sesión, el nombre de tu usuario aparecerá en la parte superior derecha. Haz clic en él y aparecerá el siguiente menú:

source: Clicking on *Admin* causes the interface to show up.
es: Al hacer clic en *Admin* se muestra la interfaz.

source: Go to *Auth* -> *Users* and you will see all the users that exist at the moment. In your case it will only be *your_superuser*. Click on it, and you will see a section on *Personal Info*, one on *Permissions* and one on *Important dates*. For the moment, the section on *Permissions* is the most important.
es: Ve a *Auth* -> *Users* y verás todos los usuarios que existen en este momento. En tu caso solo será *your_superuser*. Haz clic en él y verás una sección de *Personal Info*, otra de *Permissions* y otra de *Important dates*. Por el momento, la sección de *Permissions* es la más importante.

source: As you can see, there are three boxes that can be checked and unchecked. Because you've created a superuser, all three boxes are checked as default. If only the box *active* would have been checked, the user would not be a superuser and would not be able to access the *Django Admin Interface* (which is only available for users with the *staff* status). Therefore keep the following two things in mind:
es: Como puedes ver, hay tres casillas que se pueden marcar y desmarcar. Como has creado un superusuario, las tres casillas están marcadas de forma predeterminada. Si solo se hubiera marcado la casilla *active*, el usuario no sería un superusuario y no podría acceder a la *Django Admin Interface* (que solo está disponible para usuarios con el estado *staff*). Por lo tanto, tenga en cuenta las dos cosas siguientes:

source: a superuser is able to access the *Django Admin Interface* and he has all permissions on the data uploaded to GeoNode.
es: un superusuario puede acceder a la *Interfaz de administración de Django* y tiene todos los permisos sobre los datos cargados en GeoNode.

source: an ordinary user (created from the GeoNode interface) only has *active* permissions by default. The user will not have the ability to access the *Django Admin Interface* and certain permissions have to be added for him.
es: Un usuario normal (creado desde la interfaz GeoNode) solo tiene permisos *activos* de forma predeterminada. El usuario no tendrá la capacidad de acceder a la *Interfaz de administración de Django* y se le deben agregar ciertos permisos.

source: Until now we've only created superusers. So how do you create an ordinary user? You have two options:
es: Hasta ahora solo hemos creado superusuarios. ¿Cómo se crea un usuario normal? Tienes dos opciones:

source: Django Admin Interface
es: Interfaz de administración de Django

source: First we will create a user via the *Django Admin Interface* because we've still got it open. Therefore go back to *Auth* -> *Users* and you should find a button on the right that says *Add user*.
es: Primero crearemos un usuario a través de la *Interfaz de administración de Django* porque aún la tenemos abierta. Por lo tanto, regresa a *Auth* -> *Users* y deberías encontrar un botón a la derecha que dice *Add user*.

source: Click on it and a form to fill out will appear. Name the new user test_user, choose a password and click *save* at the right bottom of the site.
es: Haz clic en él y aparecerá un formulario para rellenar. Ponle al nuevo usuario el nombre test_user, elige una contraseña y haz clic en *guardar* en la parte inferior derecha del sitio.

source: Now you should be directed to the site where you could change the permissions on the user *test_user*. As default only *active* is checked. If you want this user also to be able to attend this admin interface you could also check *staff status*. But for now we leave the settings as they are!
es: Ahora deberías ser dirigido al sitio donde puedes cambiar los permisos del usuario *test_user*. De manera predeterminada, solo está marcada la opción *active*. Si quieres que este usuario también pueda asistir a esta interfaz de administración, también puedes marcar *staff status*. ¡Pero por ahora dejamos la configuración como está!

source: To test whether the new user was successfully created, go back to the GeoNode web page and try to sign in.
es: Para probar si el nuevo usuario se creó correctamente, regresa a la página web de GeoNode e intente iniciar sesión.

source: GeoNode website
es: Sitio web de GeoNode

source: To create an ordinary user you could also just use the GeoNode website. If you installed GeoNode using a release, you should
es: Para crear un usuario normal, también puede utilizar el sitio web de GeoNode. Si instaló GeoNode utilizando una versión, debe

source: see a *Register* button on the top, beside the *Sign in* button (you might have to log out before).
es: verá un botón *Registrarse* en la parte superior, al lado del botón *Sign in* (es posible que tenga que cerrar la sesión antes).

source: Hit the button and again a form will appear for you to fill out. This user will be named *geonode_user*
es: Pulsa el botón y aparecerá de nuevo un formulario para que lo rellenes. Este usuario se llamará *geonode_user*

source: By hitting *Sign up* the user will be signed up, as default only with the status *active*.
es: Al pulsar *Sign up* el usuario quedará registrado, por defecto solo con el estado *activo*.

source: Batch Sync Permissions
es: Permisos de sincronización por lotes

source: GeoNode provides a very useful management command ``set_layers_permisions`` allowing an administrator to easily add / remove permissions to groups and users on one or more Datasets.
es: GeoNode proporciona un comando de administración muy útil ``set_layers_permisions`` que permite a un administrador agregar o eliminar fácilmente permisos a grupos y usuarios en uno o más conjuntos de datos.

source: The ``set_layers_permisions`` command arguments are:
es: Los argumentos del comando ``set_layers_permisions`` son:

source: **permissions** to set/unset --> read, download, edit, manage
es: **permissions** para configurar/desconfigurar --> leer, descargar, editar, administrar

source: NB: the above permissions list may change with the ADVANCED_WORKFLOW enabled. For additional info: https://docs.geonode.org/en/master/admin/admin_panel/index.html#how-to-enable-the-advanced-workflow
es: Nota: la lista de permisos anterior puede cambiar si se habilita ADVANCED_WORKFLOW. Para obtener más información, consulte: https://docs.geonode.org/en/master/admin/admin_panel/index.html#how-to-enable-the-advanced-workflow

source: **resources** (Datasets) which permissions will be assigned on --> type the Dataset id, multiple choices can be typed with comma separator, if no ids are provided all the Datasets will be considered
es: **resources** (Conjuntos de datos) sobre los que se asignarán permisos --> escriba el ID del conjunto de datos, se pueden escribir múltiples opciones con separador de coma, si no se proporcionan identificadores, se considerarán todos los conjuntos de datos

source: **users** who permissions will be assigned to, multiple choices can be typed with a comma separator
es: **users** a quienes se les asignarán permisos, se pueden escribir opciones múltiples con un separador de coma

source: **groups** who permissions will be assigned to, multiple choices can be typed with a comma separator
es: **groups** a los que se asignarán permisos, se pueden escribir opciones múltiples con un separador de coma

source: **delete** flag (optional) which means the permissions will be unset
es: Bandera **delete** (opcional) que significa que los permisos no se establecerán

source: Usage examples:
es: Ejemplos de uso:

source: Assign **edit** permissions on the Datasets with id **1** and **2** to the users **username1** and **username2** and to the group **group_name1**.
es: Asignar permisos de **edit** en los conjuntos de datos con id **1** y **2** a los usuarios **username1** y **username2** y al grupo **group_name1**.

source: Assign **manage** permissions on all the Datasets to the group **group_name1**.
es: Asignar permisos de **administración** en todos los conjuntos de datos al grupo **group_name1**.

source: Unset **download** permissions on the Dataset with id **1** for the user **username1**.
es: Anular los permisos de **descarga** en el conjunto de datos con id **1** para el usuario **username1**.

source: The same functionalities, with some limitations, are available also from the :guilabel:`Admin Dashboard >> Users` or :guilabel:`Admin Dashboard >> Groups >> Group profiles`.
es: Las mismas funcionalidades, con algunas limitaciones, están disponibles también desde el :guilabel:`Admin Dashboard >> Users` o desde el :guilabel:`Admin Dashboard >> Groups >> Group profiles`.

source: An action named :guilabel:`Set layer permissions` is available from the list, redirecting the administrator to a form to set / unset read, edit, download permissions on the selected Users/group profile.
es: Una acción denominada :guilabel:`Set layer permissions` está disponible en la lista, redirigiendo al administrador a un formulario para establecer/desestablecer permisos de lectura, edición y descarga en el perfil de usuario/grupo seleccionado.

source: Is enough to select the dataset and press "Submit". If the async mode is activated, the permission assign is asyncronous
es: Basta con seleccionar el conjunto de datos y pulsar "Enviar". Si está activado el modo asíncrono, la asignación de permisos es asíncrona.

source: Delete Certain GeoNode Resources
es: Eliminar determinados recursos de GeoNode

source: The ``delete_resources`` :guilabel:`Management Command` allows to remove resources meeting a certain condition, specified in a form of a serialized django Q() expression.
es: El comando de administración ``delete_resources`` :guilabel:`Management Command` permite eliminar recursos que cumplan una determinada condición, especificada en forma de una expresión serializada django Q().

source: First of all let's take a look at the ``--help`` option of the ``delete_resources`` management command in order to inspect all the command options and features.
es: En primer lugar, echemos un vistazo a la opción ``--help`` del comando de administración ``delete_resources`` para inspeccionar todas las opciones y características del comando.

source: This will produce output the following output:
es: Esto producirá el siguiente resultado:

source: There are two ways to declare Q() expressions filtering which resources should be deleted:
es: Hay dos formas de declarar expresiones Q() para filtrar qué recursos deben eliminarse:

source: With a JSON configuration file: passing ``-c`` argument specifying the path to the JSON configuration file.
es: Con un archivo de configuración JSON: pasando el argumento ``-c`` que especifica la ruta al archivo de configuración JSON.

source: **Example 1**: Relative path to the config file (to ``manage.py``)
es: **Ejemplo 1**: Ruta relativa al archivo de configuración (a ``manage.py``)

source: **Example 2**: Absolute path to the config file
es: **Ejemplo 2**: Ruta absoluta al archivo de configuración

source: With CLI: passing ``-l`` ``-d`` ``-m`` list arguments for each of resources (Datasets, documents, maps)
es: Con CLI: pasando ``-l`` ``-d`` ``-m`` lista de argumentos para cada uno de los recursos (conjuntos de datos, documentos, mapas)

source: **Example 3**: Delete resources without configuration file
es: **Ejemplo 3**: Eliminar recursos sin archivo de configuración

source: Configuration File
es: Archivo de configuración

source: The JSON configuration file should contain a single `filters` object, which consists of `Dataset`, `map` and `document` lists. Each list specifies the filter conditions applied to a corresponding queryset, defining which items will be deleted. The filters are evaluated and directly inserted into Django .filter() method, which means the filters occurring as separated list items are treated as AND condition. To create OR query ``|`` operator should be used. For more info please check Django [documentation](https://docs.djangoproject.com/en/3.2/topics/db/queries/#complex-lookups-with-q-objects)). The only exception is passing a list with ``'*'`` which will cause deleting all the queryset of the resource.
es: El archivo de configuración JSON debe contener un único objeto `filters`, que consta de las listas `Dataset`, `map` y `document`. Cada lista especifica las condiciones de filtro aplicadas a un conjunto de consultas correspondiente, definiendo qué elementos se eliminarán. Los filtros se evalúan y se insertan directamente en el método .filter() de Django, lo que significa que los filtros que aparecen como elementos de lista separados se tratan como una condición AND. Para crear una consulta OR, se debe utilizar el operador ``|``. Para obtener más información, consulte la [documentación](https://docs.djangoproject.com/en/3.2/topics/db/queries/#complex-lookups-with-q-objects) de Django. La única excepción es pasar una lista con ``'*'``, lo que provocará la eliminación de todo el conjunto de consultas del recurso.

source: **Example 4**: Example content of the configuration file, which will delete Datasets with ID's 1, 2, and 3, those owned by `admin` user, along with all defined maps.
es: **Ejemplo 4**: Ejemplo de contenido del archivo de configuración, que eliminará los conjuntos de datos con ID 1, 2 y 3, aquellos propiedad del usuario `admin`, junto con todos los mapas definidos.

source: The CLI configuration can be specified with ``-l`` ``-d`` ``-m`` list arguments, which in fact are a translation of the configuration JSON file. ``-l`` ``-d`` ``-m`` arguments are evaluated in the same manner as filters.Dataset, filters.map and filter.document accordingly from the Example 4. The following example's result will be equivalent to Example 4:
es: La configuración de CLI se puede especificar con argumentos de lista ``-l`` ``-d`` ``-m``, que de hecho son una traducción del archivo JSON de configuración. Los argumentos ``-l`` ``-d`` ``-m`` se evalúan de la misma manera que filters.Dataset, filters.map y filter.document, según el Ejemplo 4. El resultado del siguiente ejemplo será equivalente al Ejemplo 4:

source: **Example 5**: Example CLI configuration, which will delete Datasets with ID's 1, 2, and 3, along with all maps.
es: **Ejemplo 5**: Ejemplo de configuración de CLI, que eliminará los conjuntos de datos con los ID 1, 2 y 3, junto con todos los mapas.

source: Async execution over http
es: Ejecución asincrónica a través de http

source: It is possible to expose and run management commands over http.
es: Es posible exponer y ejecutar comandos de administración a través de http.

source: To run `custom django management commands <https://docs.djangoproject.com/en/3.2/howto/custom-management-commands/>`_ usually we make make use of the command line:
es: Para ejecutar `comandos de administración de django personalizados <https://docs.djangoproject.com/en/3.2/howto/custom-management-commands/>`_ usualmente usamos la línea de comando:

source: The ``management_commands_http`` app allows us to run commands when we have no access to the command line. It's possible to run a command using the API or the django admin GUI.
es: La aplicación ``management_commands_http`` nos permite ejecutar comandos cuando no tenemos acceso a la línea de comandos. Es posible ejecutar un comando mediante la API o la interfaz gráfica de usuario de administración de Django.

source: For security reasons, only admin users can access the feature and the desired command needs to be explicitly exposed. By default the following commands are exposed: *ping_mngmt_commands_http*, *updatelayers*, *sync_geonode_datasets*, *sync_geonode_maps*, *importlayers* and *set_all_datasets_metadata*.
es: Por razones de seguridad, solo los usuarios administradores pueden acceder a la función y el comando deseado debe exponerse explícitamente. De forma predeterminada, se exponen los siguientes comandos: *ping_mngmt_commands_http*, *updatelayers*, *sync_geonode_datasets*, *sync_geonode_maps*, *importlayers* y *set_all_datasets_metadata*.

source: To expose more command you can change the environment variable ``MANAGEMENT_COMMANDS_EXPOSED_OVER_HTTP`` and the added commands will be exposed in your application.
es: Para exponer más comandos, puede cambiar la variable de entorno ``MANAGEMENT_COMMANDS_EXPOSED_OVER_HTTP`` y los comandos agregados se expondrán en tu aplicación.

source: The list of exposed commands is available by the endpoint ``list_management_commands`` and also presented by the form in the admin page ``create management command job``.
es: La lista de comandos expuestos está disponible en el punto final ``list_management_commands`` y también se presenta mediante el formulario en la página de administración ``create management command job``.

source: To use the commands in an asyncronous approach ``ASYNC_SIGNALS`` needs to be set to ``True`` and celery should be running.
es: Para utilizar los comandos de forma asincrónica, ``ASYNC_SIGNALS`` debe configurarse en ``True`` y Celery debe estar ejecutándose.

source: Manage using django admin interface
es: Administrar mediante la interfaz de administración de Django

source: Creating a job
es: Creando un puesto de trabajo

source: Access the admin panel: ``http://<your_geonode_host>/admin`` and go to "Management command jobs".
es: Acceda al panel de administración: ``http://<your_geonode_host>/admin`` y vaya a "Management command jobs".

source: Management commands over http admin menu.
es: Comandos de gestión a través del menú de administración http.

source: *Management command admin section*
es: *Sección de administración del comando de gestión*

source: You will arrive at http://<your_geonode_host>/en/admin/management_commands_http/managementcommandjob/, then click on the buttton ``+ Add management command job`` (``http://<your_geonode_host>/en/admin/management_commands_http/managementcommandjob/add/``).
es: Llegarás a http://<your_geonode_host>/es/admin/management_commands_http/managementcommandjob/, luego harás clic en el botón ``+ Add management command job`` (``http://<your_geonode_host>/es/admin/management_commands_http/managementcommandjob/add/``).

source: Button: Add management command job.
es: Botón: Agregar trabajo de comando de gestión.

source: *Add management command job*
es: *Añadir tarea de comando de gestión*

source: Select the command and fill the form, with the arguments and/or key-arguments if needed. Save you job and in the list select the ``start`` action, alterantively you can mark the ``autostart`` option and the command will be automatic started when created.
es: Seleccione el comando y complete el formulario, con los argumentos y/o claves si es necesario. Guarde su trabajo y en la lista seleccione la acción ``start``, alternativamente puede marcar la opción ``autostart`` y el comando se iniciará automáticamente al crearse.

source: Form: Add management command job.
es: Formulario: Agregar trabajo de comando de gestión.

source: *Creating a management command job form*
es: *Creación de un formulario de trabajo de comando de gestión*

source: Starting a job
es: Comenzando un trabajo

source: To start a job:
es: Para iniciar un trabajo:

source: Starting a management command job.
es: Iniciando un trabajo de comando de administración.

source: *Starting a job*
es: *Comenzando un trabajo*

source: Select the job to be started.
es: Seleccione el trabajo que desea iniciar.

source: Select the ``start`` action.
es: Seleccione la acción "start".

source: Click in ``Go``.
es: Haga clic en "Go".

source: The page will refresh and the job status will have changed. If it takes a long to run, refresh the page to see the updated the status.
es: La página se actualizará y el estado del trabajo habrá cambiado. Si tarda mucho en ejecutarse, actualiza la página para ver el estado actualizado.

source: A ``stop`` option is also available.
es: También está disponible la opción "stop".

source: If it takes too long to load the page, ``ASYNC_SIGNALS`` may not be activated. If its status gets stuck at ``QUEUED``, verify if celery is running and properly configured.
es: Si la página tarda demasiado en cargarse, es posible que ``ASYNC_SIGNALS`` no esté activado. Si tu estado se queda bloqueado en ``QUEUED``, verifique si Celery está ejecutándose y configurado correctamente.

source: Job status
es: Estado del trabajo

source: Clicking at the link in the ID of a job, we can see the details of this job. For the job we just created, we can verify the output message and celery job status.
es: Al hacer clic en el enlace del ID de un trabajo, podemos ver los detalles de este trabajo. Para el trabajo que acabamos de crear, podemos verificar el mensaje de salida y el estado del trabajo de Celery.

source: Management command job status.
es: Estado del trabajo del comando de gestión.

source: *Example job status*
es: *Ejemplo de estado laboral*

source: When we have an error during execution the traceback message will be available in the ``Celery traceback``. In the next image a ``ping_mngmt_commands_http`` job was created with the arguments ``["--force_exception", true]``. Checking the text in this field can be useful when troubleshooting errors.
es: Cuando se produce un error durante la ejecución, el mensaje de seguimiento estará disponible en el ``traceback de Celery``. En la siguiente imagen se creó un trabajo ``ping_mngmt_commands_http`` con los argumentos ``["--force_exception", true]``. Verificar el texto en este campo puede ser útil para solucionar errores.
