Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/mgmt_commands/index.po
Languages: es

source: Let's ingest the Dataset ``geonode:_1_SARMIENTO_ENERO_2018`` from the ``geonode`` workspace.
es: Vamos a incorporar el Conjunto de Datos ``geonode:_1_SARMIENTO_ENERO_2018`` desde el espacio de trabajo ``geonode``.

source: In case you don't specify the :guilabel:`-f` option, the Datasets that already exists in your GeoNode will be just updated and the configuration synchronized between GeoServer and GeoNode.
es: En caso de no especificar la opción :guilabel:`-f`, los Datasets que ya existen en tu GeoNode solo se actualizarán y la configuración se sincronizará entre GeoServer y GeoNode.

source: When updating **from** GeoServer, the configuration on GeoNode will be changed!
es: Al actualizar **desde** GeoServer, ¡se cambiará la configuración en GeoNode!

source: Using ``GDAL`` and ``OGR`` to convert your Data for use in GeoNode
es: Uso de ``GDAL`` y ``OGR`` para convertir tus datos para su uso en GeoNode

source: GeoNode supports uploading data in :guilabel:`ESRI shapefiles`, :guilabel:`GeoTIFF`, :guilabel:`CSV`, :guilabel:`GeoJSON`, :guilabel:`ASCII-GRID` and :guilabel:`KML / KMZ` formats (for the last three formats only if you are using the ``geonode.importer`` backend).
es: GeoNode admite la carga de datos en formatos :guilabel:`ESRI shapefiles`, :guilabel:`GeoTIFF`, :guilabel:`CSV`, :guilabel:`GeoJSON`, :guilabel:`ASCII-GRID` y :guilabel:`KML / KMZ` (solo para los últimos tres formatos si está utilizando el backend ``geonode.importer``).

source: If your data is in other formats, you will need to convert it into one of these formats for use in GeoNode.
es: Si tus datos están en otros formatos, deberás convertirlos a uno de estos formatos para usarlos en GeoNode.

source: If your :guilabel:`Raster` data is not correctly processed, it might be almost unusable with GeoServer and GeoNode. You will need to process it using `GDAL`.
es: Si tus datos ráster no se procesan correctamente, es posible que no puedan utilizarse con GeoServer ni con GeoNode. Deberás procesarlos con GDAL.

source: You need to make sure that you have the GDAL library installed on your system. On Ubuntu you can install this package with the following command:
es: Debes asegurarte de tener la biblioteca GDAL instalada en tu sistema. En Ubuntu puedes instalar este paquete con el siguiente comando:

source: OGR (Vector Data)
es: OGR (datos vectoriales)

source: OGR is used to manipulate vector data. In this example, we will use MapInfo .tab files and convert them to shapefiles with the ogr2ogr command. We will use sample MapInfo files from the website linked below.
es: OGR se utiliza para manipular datos vectoriales. En este ejemplo, utilizaremos archivos .tab de MapInfo y los convertiremos en archivos de formas con el comando ogr2ogr. Utilizaremos archivos de MapInfo de muestra del sitio web vinculado a continuación.

source: You can download the Admin;(Postcode) Dataset by issuing the following command::
es: Puedes descargar el conjunto de datos Admin;(Postcode) emitiendo el siguiente comando::

source: You will need to unzip this dataset by issuing the following command::
es: Necesitarás descomprimir este conjunto de datos emitiendo el siguiente comando::

source: This will leave you with the following files in the directory where you executed the above commands::
es: Esto te dejará con los siguientes archivos en el directorio donde ejecutaste los comandos anteriores::

source: First, lets inspect this file set using the following command::
es: Primero, inspeccionemos este conjunto de archivos usando el siguiente comando::

source: The output will look like the following::
es: La salida tendrá un aspecto similar al siguiente::

source: This gives you information about the number of features, the extent, the projection and the attributes of this Dataset.
es: Esto le proporciona información sobre la cantidad de características, la extensión, la proyección y los atributos de este conjunto de datos.

source: Next, lets go ahead and convert this Dataset into a shapefile by issuing the following command::
es: A continuación, sigamos adelante y convirtamos este conjunto de datos en un shapefile emitiendo el siguiente comando::

source: Note that we have also reprojected the Dataset to the WGS84 spatial reference system with the -t_srs ogr2ogr option.
es: Ten en cuenta que también hemos reproyectado el conjunto de datos al sistema de referencia espacial WGS84 con la opción -t_srs ogr2ogr.

source: The output of this command will look like the following::
es: La salida de este comando se verá así::

source: This output indicates that some of the field names were truncated to fit into the constraint that attributes in shapefiles are only 10 characters long.
es: Esta salida indica que algunos de los nombres de campo se truncaron para ajustarse a la restricción que los atributos en los shapefiles solo tienen 10 caracteres de longitud.

source: You will now have a set of files that make up the postcode_polygon.shp shapefile set. We can inspect them by issuing the following command::
es: Ahora tendrás un conjunto de archivos que conforman el conjunto de archivos de forma postcode_polygon.shp. Podemos inspeccionarlos ejecutando el siguiente comando::

source: The output will look similar to the output we saw above when we inspected the MapInfo file we converted from::
es: El resultado será similar al que vimos arriba cuando inspeccionamos el archivo MapInfo que convertimos::

source: These files can now be loaded into your GeoNode instance via the normal uploader.
es: Estos archivos ahora se pueden cargar en su instancia de GeoNode a través del cargador normal.

source: Visit the upload page in your GeoNode, drag and drop the files that composes the shapefile that you have generated using the GDAL ogr2ogr command (postcode_polygon.dbf, postcode_polygon.prj, postcode_polygon.shp, postcode_polygon.shx). Give the permissions as needed and then click the "Upload files" button.
es: Visita la página de carga de tu GeoNode, arrastra y suelta los archivos que componen el shapefile que has generado con el comando ogr2ogr de GDAL (postcode_polygon.dbf, postcode_polygon.prj, postcode_polygon.shp, postcode_polygon.shx). Concede los permisos necesarios y luego haz clic en el botón "Cargar archivos".

source: As soon as the import process completes, you will have the possibility to go straight to the Dataset info page ("Layer Info" button), or to edit the metadata for that Dataset ("Edit Metadata" button), or to manage the styles for that Dataset ("Manage Styles").
es: Tan pronto como se complete el proceso de importación, tendrás la posibilidad de ir directamente a la página de información del conjunto de datos (botón "Layer Info"), o editar los metadatos para ese conjunto de datos (botón "Edit Metadata"), o administrar los estilos para ese conjunto de datos ("Manage Styles").

source: GDAL (Raster Data)
es: GDAL (datos ráster)

source: Let's see several examples on how to either convert raster data into different formats and/or process it to get the best performances.
es: Veamos varios ejemplos sobre cómo convertir datos raster en diferentes formatos y/o procesarlos para obtener el mejor rendimiento.

source: References:
es: Referencias:

source: Raster Data Conversion: Arc/Info Binary and ASCII Grid data into GeoTIFF format.
es: Conversión de Datos Raster: datos de Grid Binario y ASCII de Arc/Info a formato GeoTIFF.

source: Let's assume we have a sample ASCII Grid file compressed as an archive.
es: Supongamos que tenemos un archivo de Grid ASCII de muestra comprimido como un archivo.

source: You will be left with the following files on your filesystem:
es: Te quedarán los siguientes archivos en tu sistema de archivos:

source: The file ``batemans_elevation.asc`` is an Arc/Info ASCII Grid file and the files in the batemans_ele directory are an Arc/Info Binary Grid file.
es: El archivo ``batemans_elevation.asc`` es un archivo de Grid ASCII de Arc/Info y los archivos en el directorio batemans_ele son un archivo de Grid Binario de Arc/Info.

source: You can use the ``gdalinfo`` command to inspect both of these files by executing the following command:
es: Puedes utilizar el comando ``gdalinfo`` para inspeccionar ambos archivos ejecutando el siguiente comando:

source: The output should look like the following:
es: El resultado debería verse así:

source: You can then inspect the batemans_ele files by executing the following command:
es: Luego puedes inspeccionar los archivos batemans_ele ejecutando el siguiente comando:

source: And this should be the corresponding output:
es: Y este debería ser el resultado correspondiente:

source: You will notice that the ``batemans_elevation.asc`` file does *not* contain projection information while the ``batemans_ele`` file does. Because of this, let's use the ``batemans_ele`` files for this exercise and convert them to a GeoTiff for use in GeoNode. We will also reproject this file into WGS84 in the process. This can be accomplished with the following command.
es: Notarás que el archivo ``batemans_elevation.asc`` no contiene información de proyección, mientras que el archivo ``batemans_ele`` sí. Por este motivo, utilizaremos los archivos ``batemans_ele`` para este ejercicio y los convertiremos a GeoTiff para utilizarlos en GeoNode. También reproyectaremos este archivo en WGS84 en el proceso. Esto se puede lograr con el siguiente comando.

source: The output will show you the progress of the conversion and when it is complete, you will be left with a ``batemans_ele.tif`` file that you can upload to your GeoNode.
es: La salida te mostrará el progreso de la conversión y cuando se complete, obtendrás un archivo ``batemans_ele.tif`` que puede cargar a su GeoNode.

source: You can inspect this file with the gdalinfo command:
es: Puedes inspeccionar este archivo con el comando gdalinfo:

source: Which will produce the following output:
es: Lo que producirá el siguiente resultado:

source: Raster Data Optimization: Optimizing and serving big raster data
es: Optimización de datos ráster: optimización y entrega de datos ráster de gran tamaño

source: When dealing with big raster datasets it could be very useful to use tiles.
es: Al trabajar con grandes conjuntos de datos raster, puede resultar muy útil utilizar mosaicos.

source: Tiling allows large raster datasets to be broken-up into manageable pieces and are fundamental in defining and implementing a higher level raster I/O interface.
es: El mosaico permite dividir grandes conjuntos de datos ráster en partes manejables y es fundamental para definir e implementar una interfaz de ráster E/S de nivel superior.

source: In this example we will use the original dataset of the ``chiangMai_ortho_optimized`` public raster Dataset which is currently available on the Thai `CHIANG MAI Urban Flooding GeoNode platform <https://urbanflooding.geo-solutions.it/>`_.
es: En este ejemplo, utilizaremos el conjunto de datos original del conjunto de datos ráster público ``chiangMai_ortho_optimized`` que actualmente está disponible en la plataforma tailandesa `CHIANG MAI Urban Flooding GeoNode <https://urbanflooding.geo-solutions.it/>`_.

source: This dataset contains an orthorectified image stored as RGBa GeoTiff with 4 bands, three bands for the RGB and one for transparency (the alpha channel).
es: Este conjunto de datos contiene una imagen ortorectificada almacenada como RGBa GeoTiff con 4 bandas, tres bandas para el RGB y una para la transparencia (el canal alfa).

source: Calling the gdalinfo command to see detailed information:
es: Ejecutando el comando gdalinfo para ver información detallada:

source: It will produce the following results:
es: Producirá los siguientes resultados:

source: As you can see, this GeoTiff has not been tiled. For accessing subsets though, tiling can make a difference. With tiling, data are stored and compressed in blocks (tiled) rather than line by line (stripped).
es: Como puedes ver, este GeoTiff no se ha dividido en mosaicos. Sin embargo, para acceder a subconjuntos, el uso de mosaicos puede marcar la diferencia. Con el uso de mosaicos, los datos se almacenan y comprimen en bloques (tiled) en lugar de línea por línea (stripped).

source: In the command output above it is visible that each band has blocks with the same width of the image (63203) and a unit length. The grids in the picture below show an image with equally sized tiles (left) and the same number of strips (right). To read data from the red subset, the intersected area will have to be decompressed.
es: En la salida del comando anterior se puede ver que cada banda tiene bloques con el mismo ancho de la imagen (63203) y una longitud unitaria. Las cuadrículas de la imagen siguiente muestran una imagen con mosaicos de igual tamaño (izquierda) y la misma cantidad de franjas (derecha). Para leer los datos del subconjunto rojo, será necesario descomprimir el área intersectada.

source: In the tiled image we will have to decompress only 16 tiles, whereas in the stripped image on the right we’ll have to decompress many more strips.
es: En la imagen en mosaico tendremos que descomprimir solo 16 mosaicos, mientras que en la imagen despojada de la derecha tendremos que descomprimir muchas más tiras.

source: Drone images data usually have a stripped structure so, in most cases, they need to be optimized to increase performances.
es: Los datos de imágenes de drones suelen tener una estructura simplificada, por lo que, en la mayoría de los casos, es necesario optimizarlos para aumentar el rendimiento.

source: Let’s take a look at the gdal_translate command used to optimize our GeoTiff:
es: Echemos un vistazo al comando gdal_translate utilizado para optimizar nuestro GeoTiff:

source: For the details about the command parameters see https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example5.html
es: Para obtener más detalles sobre los parámetros del comando, consulte https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example5.html

source: Once the process ended, call the gdalinfo command on the resulting tif file:
es: Una vez finalizado el proceso, llame al comando gdalinfo en el archivo tif resultante:

source: The following should be the results:
es: Los siguientes deberían ser los resultados:

source: Our GeoTiff is now tiled with 256x256 tiles, has 3 bands and a 1-bit mask for nodata.
es: Nuestro GeoTiff ahora está dividido en mosaicos de 256x256, tiene 3 bandas y una máscara de 1 bit para no data.

source: We can also add internal overviews to the file using the gdaladdo command:
es: También podemos agregar vistas generales internas al archivo usando el comando gdaladdo:

source: Overviews are duplicate versions of your original data, but resampled to a lower resolution, they can also be compressed with various algorithms, much in the same way as the original dataset.
es: Las vistas generales son versiones duplicadas de los datos originales, pero remuestreadas a una resolución más baja; también se pueden comprimir con varios algoritmos, de la misma manera que el conjunto de datos original.

source: By default, overviews take the same compression type and transparency masks of the input dataset (applied through the gdal_translate command), so the parameters to be specified are:
es: De manera predeterminada, las vistas generales toman el mismo tipo de compresión y máscaras de transparencia del conjunto de datos de entrada (aplicados a través del comando gdal_translate), por lo que los parámetros que se deben especificar son:

source: :guilabel:`-r average`: computes the average of all non-NODATA contributing pixels
es: :guilabel:`-r average`: calcula el promedio de todos los píxeles contribuyentes que no son NODATA

source: :guilabel:`2 4 8 16 32 64 128 256 512`: the list of integral overview levels to build (from gdal version 2.3 levels are no longer required to build overviews)
es: :guilabel:`2 4 8 16 32 64 128 256 512`: la lista de niveles de visión general integral para construir (a partir de la versión 2.3 de gdal ya no se requieren niveles para construir visiones generales)

source: Calling the gdalinfo command again:
es: Llamando nuevamente al comando gdalinfo:

source: It results in:
es: El resultado es:

source: Notice that the transparency masks of internal overviews have been applied (their compression does not show up in the file metadata).
es: Ten en cuenta que se han aplicado las máscaras de transparencia de las vistas generales internas (su compresión no aparece en los metadatos del archivo).

source: UAVs usually provide also two other types of data: ``DTM (Digital Terrain Model)`` and ``DSM (Digital Surface Model)``.
es: Los vehículos aéreos no tripulados suelen proporcionar también otros dos tipos de datos: «DTM (modelo digital del terreno)» y «DSM (modelo digital de superficie)».

source: Those data require different processes to be optimized. Let’s look at some examples to better understand how to use gdal to accomplish that task.
es: Para optimizar esos datos es necesario llevar a cabo distintos procesos. Veamos algunos ejemplos para entender mejor cómo utilizar gdal para llevar a cabo esa tarea.

source: From the `CHIANG MAI Urban Flooding GeoNode platform <https://urbanflooding.geo-solutions.it/>`_ platform it is currently available the ``chiangMai_dtm_optimized`` Dataset, let’s download its original dataset.
es: Desde la plataforma `CHIANG MAI Urban Flooding GeoNode <https://urbanflooding.geo-solutions.it/>`_ se encuentra actualmente disponible el conjunto de datos ``chiangMai_dtm_optimized``, descarguemos su conjunto de datos original.

source: This dataset should contain the DTM file ``chiangMai_dtm.tif``.
es: Este conjunto de datos debe contener el archivo DTM ``chiangMai_dtm.tif``.

source: Calling the gdalinfo command on it:
es: Llamando al comando gdalinfo:

source: The following information will be displayed:
es: Se mostrará la siguiente información:

source: Reading this image could be very slow because it has not been tiled yet. So, as discussed above, its data need to be stored and compressed in tiles to increase performances.
es: La lectura de esta imagen puede resultar muy lenta porque aún no se ha dividido en mosaicos. Por lo tanto, como se mencionó anteriormente, sus datos deben almacenarse y comprimirse en mosaicos para aumentar el rendimiento.

source: The following gdal_translate command should be appropriate for that purpose:
es: El siguiente comando gdal_translate debería ser apropiado para ese propósito:

source: When the data to compress consists of imagery (es. aerial photographs, true-color satellite images, or colored maps) you can use lossy algorithms such as JPEG. We are now compressing data where the precision is important, the band data type is Float32 and elevation values should not be altered, so a lossy algorithm such as JPEG is not suitable. JPEG should generally only be used with Byte data (8 bit per channel) so we have choosen the lossless DEFLATE compression through the COMPRESS=DEFLATE creation option.
es: Cuando los datos a comprimir consisten en imágenes (por ejemplo, fotografías aéreas, imágenes satelitales en color verdadero o mapas en color), se pueden utilizar algoritmos con pérdida como JPEG. Ahora estamos comprimiendo datos donde la precisión es importante, el tipo de datos de banda es Float32 y los valores de elevación no deben alterarse, por lo que un algoritmo con pérdida como JPEG no es adecuado. JPEG generalmente solo se debe utilizar con datos de bytes (8 bits por canal), por lo que hemos elegido la compresión DEFLATE sin pérdida a través de la opción de creación COMPRESS=DEFLATE.

source: We can observe the following results:
es: Podemos observar los siguientes resultados:

source: We need also to create overviews through the gdaladdo command:
es: También necesitamos crear vistas generales a través del comando gdaladdo:

source: Unlike the previous example, overviews will be created with the **nearest resampling algorithm**. That is due to the nature of the data we are representing: we should not consider the average between two elevation values but simply the closer one, it is more reliable regarding the conservation of the original data.
es: A diferencia del ejemplo anterior, las vistas generales se crearán con el algoritmo de remuestreo más cercano. Esto se debe a la naturaleza de los datos que estamos representando: no debemos considerar el promedio entre dos valores de elevación sino simplemente el más cercano, ya que es más confiable en cuanto a la conservación de los datos originales.

source: We can see the following information:
es: Podemos ver la siguiente información:

source: Overviews have been created. By default, they inherit the same compression type of the original dataset (there is no evidence of it in the gdalinfo output).
es: Se han creado vistas generales. De manera predeterminada, heredan el mismo tipo de compresión del conjunto de datos original (no hay evidencia de ello en la salida de gdalinfo).

source: Other Raster Data Use Cases
es: Otros casos de uso de datos ráster

source: `Serving a large number of GrayScale GeoTiff with Palette <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example1.html>`_
es: `Cómo servir a una gran cantidad de GeoTiff en escala de grises con Palette <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example1.html>`_

source: `Serving a large number of DTM ASCII Grid Files <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example2.html>`_
es: `Cómo proporcionar un gran número de archivos de cuadrícula ASCII DTM <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example2.html>`_

source: `Serving a large number of Cartographic Black/White GeoTiff with Palette <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example3.html>`_
es: `Ofreciendo un gran número de GeoTiff cartográficos en blanco y negro con paleta <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example3.html>`_

source: `Serving a large number of satellite/aerial RGB GeoTiff with compression <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example4.html>`_
es: `Ofreciendo un gran número de imágenes satelitales/aéreas RGB GeoTiff con compresión <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example4.html>`_

source: `Optimizing and serving UAV data <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example5.html>`_
es: `Optimización y servicio de datos de UAV <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example5.html>`_

source: `Optimizing and serving 16-bits satellite/aerial RGB GeoTiff <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example6.html>`_
es: `Optimización y servicio de imágenes satelitales/aéreas RGB GeoTiff de 16 bits <https://geoserver.geo-solutions.it/edu/en/raster_data/advanced_gdal/example6.html>`_

source: Process Raster Datasets Programmatically
es: Procesar conjuntos de datos ráster mediante programación

source: In this section we will provide a set of :guilabel:`shell` scripts which might be very useful to batch process a lot of raster datasets programmatically.
es: En esta sección proporcionaremos un conjunto de scripts :guilabel:`shell` que pueden resultar muy útiles para procesar por lotes una gran cantidad de conjuntos de datos ráster de forma programada.

source: Thesaurus Import and Export
es: Tesauro Importación y Exportación

source: See :ref:`load_thesaurus` and :ref:`dump_thesaurus`.
es: Consulte :ref:`load_thesaurus` y :ref:`dump_thesaurus`.

source: Create Users and Super Users
es: Crear usuarios y superusuarios
