Repository: Kan-T-IT/geonode-documentation
Catalog: locale/*/LC_MESSAGES/admin/mgmt_commands/index.po
Languages: es

source: Migrate GeoNode Base URL
es: Migrar la URL Base de GeoNode

source: The ``migrate_baseurl`` :guilabel:`Management Command` allows you to fix all the GeoNode Links whenever, for some reason, you need to change the :guilabel:`Domain Name` of :guilabel:`IP Address` of GeoNode.
es: El comando de administración ``migrate_baseurl`` :guilabel:`Management Command` te permite reparar todos los enlaces de GeoNode siempre que, por alguna razón, necesites cambiar el :guilabel:`Domain Name` o la :guilabel:`IP Address` de GeoNode.

source: This **must** be used also in the cases you'll need to change the network schema from ``HTTP`` to ``HTTPS``, as an instance.
es: Esto **debe** usarse también en los casos en que necesites cambiar el esquema de red de ``HTTP`` a ``HTTPS``, por ejemplo.

source: First of all let's take a look at the :guilabel:`--help` option of the ``migrate_baseurl`` management command in order to inspect all the command options and features.
es: En primer lugar, echemos un vistazo a la opción :guilabel:`--help` del comando de administración ``migrate_baseurl`` para inspeccionar todas las opciones y características del comando.

source: Run
es: Correr

source: This will produce output that looks like the following
es: Esto producirá un resultado similar al siguiente

source: **Example 1**: I want to move my GeoNode instance from ``http:\\127.0.0.1`` to ``http:\\example.org``
es: **Ejemplo 1**: Quiero mover mi instancia de GeoNode de ``http:\\127.0.0.1`` a ``http:\\example.org``

source: Make always sure you are using the **correct** settings
es: Asegúrate siempre de utilizar la configuración **correcta**

source: **Example 2**: I want to move my GeoNode instance from ``http:\\example.org`` to ``https:\\example.org``
es: **Ejemplo 2**: Quiero mover mi instancia de GeoNode de ``http:\\example.org`` a ``https:\\example.org``

source: **Example 3**: I want to move my GeoNode instance from ``https:\\example.org`` to ``https:\\geonode.example.org``
es: **Ejemplo 3**: Quiero mover mi instancia de GeoNode de ``https:\\example.org`` a ``https:\\geonode.example.org``

source: After migrating the base URL, make sure to sanitize the links and catalog metadata also (:ref:`sync_layers_and_metadata`).
es: Después de migrar la URL base, asegúrate de sanitizar los enlaces y los metadatos del catálogo también (:ref:`sync_layers_and_metadata`).

source: Update Permissions, Metadata, Legends and Download Links
es: Actualizar permisos, metadatos, leyendas y enlaces de descarga

source: The following three utility :guilabel:`Management Commands`, allow to fixup:
es: Las siguientes tres utilidades :guilabel:`Management Commands`, permiten realizar correcciones:

source: :guilabel:`Users/Groups Permissions` on :guilabel:`Datasets`; those will be refreshed and synchronized with the :guilabel:`GIS Server` ones also
es: :guilabel:`Users/Groups Permissions` en :guilabel:`Datasets`; estos se actualizarán y sincronizarán también con los del :guilabel:`GIS Server`

source: :guilabel:`Metadata`, :guilabel:`Legend` and :guilabel:`Download` links on :guilabel:`Datasets` and :guilabel:`Maps`
es: :guilabel:`Metadata`, :guilabel:`Legend` y enlaces de :guilabel:`Download` en :guilabel:`Datasets` y :guilabel:`Maps`

source: Cleanup :guilabel:`Duplicated Links` and :guilabel:`Outdated Thumbnails`
es: Limpia los :guilabel:`Duplicated Links` y las :guilabel:`Outdated Thumbnails`.

source: Management Command ``sync_geonode_datasets``
es: Comando de administración ``sync_geonode_datasets``

source: This command allows to sync already existing permissions on Datasets. In order to change/set Datasets' permissions refer to the section :ref:`batch_sync_permissions`
es: Este comando permite sincronizar los permisos ya existentes en los conjuntos de datos. Para cambiar o configurar los permisos de los conjuntos de datos, consulta la sección :ref:`batch_sync_permissions`

source: The options are:
es: Las opciones son:

source: **filter**; Only update data the Dataset names that match the given filter.
es: **filter**; Solo actualiza los datos de los nombres de conjuntos de datos que coinciden con el filtro dado.

source: **username**; Only update data owned by the specified username.
es: **username**; Actualizar únicamente los datos que pertenecen al nombre de usuario especificado.

source: **updatepermissions**; Update the Dataset permissions; synchronize it back to the GeoSpatial Server. This option is also available from the :guilabel:`Layer Details` page.
es: **updatepermissions**; Actualiza los permisos del conjunto de datos; sincronízalos nuevamente con GeoSpatial Server. Esta opción también está disponible en la página :guilabel:`Layer Details`.

source: **updateattributes**; Update the Dataset attributes; synchronize it back to the GeoSpatial Server. This option is also available from the :guilabel:`Layer Details` page.
es: **updateattributes**; Actualiza los atributos del conjunto de datos; sincronízalos nuevamente con GeoSpatial Server. Esta opción también está disponible en la página :guilabel:`Layer Details`.

source: **updatethumbnails**; Update the Dataset thumbnail. This option is also available from the :guilabel:`Layer Details` page.
es: **updatethumbnails**; Actualizar la miniatura del conjunto de datos. Esta opción también está disponible en la página :guilabel:`Layer Details`.

source: **updatebbox**; Update the Dataset BBOX and LotLan BBOX. This option is also available from the :guilabel:`Layer Details` page.
es: **updatebbox**; Actualizar el conjunto de datos BBOX y el BBOX de LotLan. Esta opción también está disponible en la página :guilabel:`Layer Details`.

source: **remove-duplicates**; Removes duplicated Links.
es: **remove-duplicates**; Elimina enlaces duplicados.

source: First of all let's take a look at the :guilabel:`--help` option of the ``sync_geonode_datasets`` management command in order to inspect all the command options and features.
es: En primer lugar, echemos un vistazo a la opción :guilabel:`--help` del comando de administración ``sync_geonode_datasets`` para inspeccionar todas las opciones y características del comando.

source: If you enabled ``local_settings.py`` the command will change as following:
es: Si habilitó ``local_settings.py`` el comando cambiará de la siguiente manera:

source: **Example 1**: I want to update/sync all Datasets permissions and attributes with the GeoSpatial Server
es: **Ejemplo 1**: Quiero actualizar/sincronizar todos los permisos y atributos de los conjuntos de datos con el servidor geoespacial

source: **Example 2**: I want to regenerate the Thumbnails of all the Datasets belonging to ``afabiani``
es: **Ejemplo 2**: Quiero regenerar las miniaturas de todos los conjuntos de datos pertenecientes a ``afabiani``

source: Management Command ``sync_geonode_maps``
es: Comando de gestión ``sync_geonode_maps``

source: This command is basically similar to the previous one, but affects the :guilabel:`Maps`; with some limitations.
es: Este comando es básicamente similar al anterior, pero afecta a los :guilabel:`Maps`; con algunas limitaciones.

source: **filter**; Only update data the maps titles that match the given filter.
es: **filter**; Solo actualiza los datos de los títulos de los mapas que coinciden con el filtro dado.

source: **updatethumbnails**; Update the map styles and thumbnails. This option is also available from the :guilabel:`Map Details` page.
es: **updatethumbnails**; Actualiza los estilos y las miniaturas del mapa. Esta opción también está disponible en la página :guilabel:`Map Details`.

source: First of all let's take a look at the :guilabel:`--help` option of the ``sync_geonode_maps`` management command in order to inspect all the command options and features.
es: En primer lugar, echemos un vistazo a la opción :guilabel:`--help` del comando de administración ``sync_geonode_maps`` para inspeccionar todas las opciones y características del comando.

source: **Example 1**: I want to regenerate the Thumbnail of the Map ``This is a test Map``
es: **Ejemplo 1**: Quiero regenerar la Miniatura del Mapa ``Este es un Mapa de prueba``

source: Management Command ``set_all_datasets_metadata``
es: Comando de administración ``set_all_datasets_metadata``

source: This command allows to reset **Metadata Attributes** and **Catalogue Schema** on Datasets. The command will also update the :guilabel:`CSW Catalogue` XML and Links of GeoNode.
es: Este comando permite restablecer los **Atributos de metadatos** y el **Esquema de catálogo** en los conjuntos de datos. El comando también actualizará el XML del `Catálogo CSW` y los vínculos de GeoNode.

source: **filter**; Only update data the Datasets that match the given filter.
es: **filter**; Actualiza únicamente los datos de los conjuntos de datos que coincidan con el filtro dado.

source: **remove-duplicates**; Update the map styles and thumbnails.
es: **remove-duplicates**; Actualiza los estilos y miniaturas del mapa.

source: **delete-orphaned-thumbs**; Removes duplicated Links.
es: **delete-orphaned-thumbs**; Elimina enlaces duplicados.

source: **set-uuid**; will refresh the UUID based on the UUID_HANDLER if configured (Default False).
es: **set-uuid**; actualizará el UUID en función del UUID_HANDLER si está configurado (predeterminado False).

source: **set_attrib**; If set will refresh the attributes of the resource taken from Geoserver. (Default True).
es: **set_attrib**; Si se establece, se actualizarán los atributos del recurso tomados de Geoserver. (Predeterminado: True).

source: **set_links**; If set will refresh the links of the resource. (Default True).
es: **set_links**; Si se establece, se actualizarán los enlaces del recurso. (Predeterminado: True).

source: First of all let's take a look at the :guilabel:`--help` option of the ``set_all_datasets_metadata`` management command in order to inspect all the command options and features.
es: En primer lugar, echemos un vistazo a la opción :guilabel:`--help` del comando de administración ``set_all_datasets_metadata`` para inspeccionar todas las opciones y características del comando.

source: **Example 1**: After having changed the Base URL, I want to regenerate all the Catalogue Schema and eventually remove all duplicates.
es: **Ejemplo 1**: Después de haber cambiado la URL Base, quiero regenerar todo el esquema del catálogo y eventualmente eliminar todos los duplicados.

source: Loading Data into GeoNode
es: Cargando datos en GeoNode

source: There are situations where it is not possible or not convenient to use the :guilabel:`Upload Form` to add new Datasets to GeoNode via the web interface. For instance:
es: Hay situaciones en las que no es posible o no resulta conveniente utilizar el :guilabel:`Upload Form` para añadir nuevos Conjuntos de Datos a GeoNode a través de la interfaz web. Por ejemplo:

source: The dataset is too big to be uploaded through a web interface.
es: El conjunto de datos es demasiado grande para cargarlo a través de una interfaz web.

source: Import data from a mass storage programmatically.
es: Importar datos desde un almacenamiento masivo mediante programación.

source: Import tables from a database.
es: Importar tablas de una base de datos.

source: This section will walk you through the various options available to load data into your GeoNode from GeoServer, from the command-line or programmatically.
es: Esta sección lo guiará a través de las distintas opciones disponibles para cargar datos en su GeoNode desde GeoServer, desde la línea de comandos o mediante programación.

source: Some parts of this section have been taken from the `GeoServer <https://geoserver.geo-solutions.it/edu/en>`_ project and training documentation.
es: Algunas partes de esta sección se han tomado del proyecto `GeoServer <https://geoserver.geo-solutions.it/edu/en>`_ y de la documentación de capacitación.

source: Management Command ``importlayers``
es: Comando de gestión ``importlayers``

source: The ``geonode.geoserver`` Django app includes 2 management commands that you can use to load data in your GeoNode.
es: La aplicación Django ``geonode.geoserver`` incluye 2 comandos de administración que puedes usar para cargar datos en tu GeoNode.

source: Both of them can be invoked by using the ``manage.py`` script.
es: Ambos pueden invocarse mediante el script ``manage.py``.

source: First of all let's take a look at the :guilabel:`--help` option of the ``importlayers`` management command in order to inspect all the command options and features.
es: En primer lugar, echemos un vistazo a la opción :guilabel:`--help` del comando de administración ``importlayers`` para inspeccionar todas las opciones y características del comando.

source: While the description of most of the options should be self explanatory, its worth reviewing some of the key options a bit more in details.
es: Si bien la descripción de la mayoría de las opciones debería explicarse por sí sola, vale la pena revisar algunas de las opciones clave un poco más en detalle.

source: The :guilabel:`-hh` Identifies the GeoNode server where we want to upload our Datasets. The default value is :guilabel:`http://localhost:8000`.
es: El :guilabel:`-hh` identifica el servidor GeoNode donde queremos cargar nuestros conjuntos de datos. El valor predeterminado es :guilabel:`http://localhost:8000`.

source: The :guilabel:`-u` Identifies the username for the login. The default value is :guilabel:`admin`.
es: :guilabel:`-u` identifica el nombre de usuario para iniciar sesión. El valor predeterminado es :guilabel:`admin`.

source: The :guilabel:`-p` Identifies the password for the login. The default value is :guilabel:`admin`.
es: :guilabel:`-p` identifica la contraseña para iniciar sesión. El valor predeterminado es :guilabel:`admin`.

source: The import Datasets management command is invoked by specifying options as described above and specifying the path to a directory that contains multiple files. For purposes of this exercise, let's use the default set of testing Datasets that ship with geonode. You can replace this path with a directory to your own shapefiles.
es: El comando de gestión de importación de conjuntos de datos se invoca especificando las opciones descritas anteriormente y especificando la ruta a un directorio que contiene varios archivos. Para los fines de este ejercicio, utilizaremos el conjunto predeterminado de conjuntos de datos de prueba que se incluyen con GeoNode. Puede reemplazar esta ruta con un directorio a sus propios shapefiles.

source: This command will produce the following output to your terminal
es: Este comando producirá la siguiente salida en tu terminal

source: As output the command will print:
es: Como salida, el comando imprimirá:

source: The status code, is the response coming from GeoNode. For example 201 means that the Dataset has been correctly uploaded
es: El código de estado es la respuesta que llega desde GeoNode. Por ejemplo, 201 significa que el conjunto de datos se ha cargado correctamente.

source: If you encounter errors while running this command, please check the GeoNode logs for more information.
es: Si encuentras errores al ejecutar este comando, consulte los registros de GeoNode para obtener más información.

source: Management Command ``updatelayers``
es: Comando de administración ``updatelayers``

source: While it is possible to import Datasets directly from your servers filesystem into your GeoNode, you may have an existing GeoServer that already has data in it, or you may want to configure data from a GeoServer which is not directly supported by uploading data.
es: Si bien es posible importar conjuntos de datos directamente desde el sistema de archivos de tu servidor a tu GeoNode, es posible que tengas un GeoServer existente que ya contenga datos o que desees configurar datos desde un GeoServer que no sea directamente compatible con la carga de datos.

source: GeoServer supports a wide range of data formats and connections to database, some of them may not be supported as GeoNode upload formats. You can add them to your GeoNode by following the procedure described below.
es: GeoServer admite una amplia gama de formatos de datos y conexiones a bases de datos; es posible que algunos de ellos no sean compatibles con los formatos de carga de GeoNode. Puede agregarlos a tu GeoNode siguiendo el procedimiento que se describe a continuación.

source: GeoServer supports 4 types of data: :guilabel:`Raster`, :guilabel:`Vector`, :guilabel:`Databases` and :guilabel:`Cascaded`.
es: GeoServer admite 4 tipos de datos: :guilabel:`Raster`, :guilabel:`Vector`, :guilabel:`Databases` y :guilabel:`Cascaded`.

source: For a list of the supported formats for each type of data, consult the following pages:
es: Para obtener una lista de los formatos admitidos para cada tipo de datos, consulta las siguientes páginas:

source: Some of these raster or vector formats or database types require that you install specific plugins in your GeoServer in order to use the. Please consult the GeoServer documentation for more information.
es: Algunos de estos formatos raster o vectoriales o tipos de bases de datos requieren que instale complementos específicos en GeoServer para poder usarlos. Consulta la documentación de GeoServer para obtener más información.

source: Data from a PostGIS database
es: Datos de una base de datos PostGIS

source: Lets walk through an example of configuring a new PostGIS database in GeoServer and then configuring those Datasets in your GeoNode.
es: Veamos un ejemplo de configuración de una nueva base de datos PostGIS en GeoServer y luego configure esos conjuntos de datos en tu GeoNode.

source: First visit the GeoServer administration interface on your server. This is usually on port 8080 and is available at http://localhost:8080/geoserver/web/
es: En primer lugar, visite la interfaz de administración de GeoServer en tu servidor. Normalmente, se encuentra en el puerto 8080 y está disponible en http://localhost:8080/geoserver/web/

source: You should login with the superuser credentials you setup when you first configured your GeoNode instance.
es: Debe iniciar sesión con las credenciales de superusuario que configuró cuando configuró por primera vez tu instancia de GeoNode.

source: Once you are logged in to the GeoServer Admin interface, you should see the following.
es: Una vez que hayas iniciado sesión en la interfaz de administración de GeoServer, deberías ver lo siguiente.

source: The number of stores, Datasets and workspaces may be different depending on what you already have configured in your GeoServer.
es: La cantidad de tiendas, conjuntos de datos y espacios de trabajo puede ser diferente dependiendo de lo que ya tenga configurado en tu GeoServer.

source: Next you want to select the "Stores" option in the left hand menu, and then the "Add new Store" option. The following screen will be displayed.
es: A continuación, selecciona la opción "Stores" en el menú de la izquierda y luego la opción "Add new Store". Se mostrará la siguiente pantalla.

source: In this case, we want to select the PostGIS store type to create a connection to our existing database. On the next screen you will need to enter the parameters to connect to your PostGIS database (alter as necessary for your own database).
es: En este caso, queremos seleccionar el tipo de almacenamiento PostGIS para crear una conexión a nuestra base de datos existente. En la siguiente pantalla, deberás ingresar los parámetros para conectarse a tu base de datos PostGIS (modifica según sea necesario para tu propia base de datos).

source: If you are unsure about any of the settings, leave them as the default.
es: Si no estás seguro de alguna configuración, déjala como predeterminada.

source: The next screen lets you configure the Datasets in your database. This will of course be different depending on the Datasets in your database.
es: La siguiente pantalla te permite configurar los conjuntos de datos en tu base de datos. Por supuesto, esto variará según los conjuntos de datos en tu base de datos.

source: Select the "Publish" button for one of the Datasets and the next screen will be displayed where you can enter metadata for this Dataset. Since we will be managing this metadata in GeoNode, we can leave these alone for now.
es: Selecciona el botón "Publish" para uno de los conjuntos de datos y se mostrará la siguiente pantalla en la que podrás ingresar metadatos para este conjunto de datos. Dado que administraremos estos metadatos en GeoNode, podemos dejarlos así por ahora.

source: The things that *must* be specified are the Declared SRS and you must select the "Compute from Data" and "Compute from native bounds" links after the SRS is specified.
es: Las cosas que *deben* especificarse son el SRS declarado y debes seleccionar los enlaces "Calcular desde datos" y "Calcular desde límites nativos" después de especificar el SRS.

source: Click save and this Dataset will now be configured for use in your GeoServer.
es: Haz clic en guardar y este conjunto de datos ahora estará configurado para su uso en su GeoServer.

source: The next step is to configure these Datasets in GeoNode. The ``updatelayers`` management command can be used for this purpose. As with ``importlayers``, it's useful to look at the command line options for this command by passing the :guilabel:`--help` option
es: El siguiente paso es configurar estos conjuntos de datos en GeoNode. El comando de administración ``updatelayers`` se puede utilizar para este propósito. Al igual que con ``importlayers``, es útil ver las opciones de línea de comandos para este comando pasando la opción :guilabel:`--help`

source: The update procedure includes the following steps:
es: El procedimiento de actualización incluye los siguientes pasos:

source: The process fetches from GeoServer the relevant WMS layers (all, by store or by workspace)
es: El proceso obtiene de GeoServer las capas WMS relevantes (todas, por tienda o por espacio de trabajo)

source: If a filter is defined, the GeoServer layers are filtered
es: Si se define un filtro, se filtran las capas de GeoServer

source: For each of the layers, a GeoNode dataset is created based on the metadata registered on GeoServer (title, abstract, bounds)
es: Para cada una de las capas, se crea un conjunto de datos GeoNode basado en los metadatos registrados en GeoServer (título, resumen, límites)

source: New layers are added, existing layers are replaced, unless the :guilabel:`--skip-geonode-registered` option is used
es: Se agregan nuevas capas, se reemplazan las capas existentes, a menos que se use la opción :guilabel:`--skip-geonode-registered`

source: The GeoNode layers, added in previous runs of the update process, which are no longer available in GeoServer are removed, if the :guilabel:`--remove-delete` option is set
es: Las capas GeoNode, agregadas en ejecuciones anteriores del proceso de actualización, que ya no están disponibles en GeoServer se eliminan, si la opción :guilabel:`--remove-delete` está configurada

source: One of the :guilabel:`--workspace` or :guilabel:`--store` must be always specified if you want to ingest Datasets belonging to a specific ``Workspace``. As an instance, in order to ingest the Datasets present into the ``geonode`` workspace, you will need to specify the option ``-w geonode``.
es: Siempre se debe especificar uno de los :guilabel:`--workspace` o :guilabel:`--store` si deseas ingerir conjuntos de datos que pertenecen a un ``Workspace`` específico. Por ejemplo, para ingerir los conjuntos de datos presentes en el espacio de trabajo ``geonode``, deberás especificar la opción ``-w geonode``.
